{"ED 10": {"number": "10", "sub_dept": "ED", "title": "Introduction to the College Experience", "dept": "ED", "prereqs": [], "prereq_description": "Must be a  new freshman at UCSB.", "comments": "Quarters usually offered: Fall. Offered fall quarter only.", "units": "2", "description": "An introductory course for fall quarter freshmen.  Course provides new students with direction and guidance on how to be successful in higher education, and specifically, at the research university.  Topics include critical thinking and reading, analytical writing,  major selection,   university structure, mental health and wellness, citizenship, campus  resources, institutional and system-wide objectives.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 20": {"number": "20", "sub_dept": "ED", "title": "Introduction to the University Experience", "dept": "ED", "prereqs": [], "prereq_description": "Lower division standing.", "comments": "Not open to students who have completed INT 20.", "units": "3", "description": "Introduces first-year students to the mission of the research university, the role of higher education in society and their role, as students, within the community of scholars.  Topics cover academic, social and personal issues relevant to the college experience. Undergraduate research opportunities will be promoted.", "recommended_prep": "", "professor": "LUBACH", "college": "GGSE"},
"ED 20I": {"number": "20I", "sub_dept": "ED", "title": "Introduction to the Research University for International Students", "dept": "ED", "prereqs": [], "prereq_description": "Must be an international student.", "comments": "Not open to students who have completed INT 20.", "units": "3", "description": "Course introduces first-year international students to US higher education systems with a specific focus on achieving academic success at UCSB through the process of academic writing enhancement, critical thinking and exploring university resources for personal development and academic success.", "recommended_prep": "", "professor": "MARINA", "college": "GGSE"},
"ED 30": {"number": "30", "sub_dept": "ED", "title": "Statistical Foundations for Human Services and Education Sciences", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "An introduction to various statistical concepts in research and evaluation related to education and applied psychology. The course covers topics that include: Descriptive Statistics, probability, sampling, hypothesis testing, inferential statistics, categorical variables, regression and correlation.", "recommended_prep": "", "professor": "AZZAM, QUIRK, NYLUND-GIBSON", "college": "GGSE"},
"ED 31": {"number": "31", "sub_dept": "ED", "title": "Current Trends in Learning and Human Development", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Introduction to major themes and current issues in human development and learning. Featuring current research and theoretical foundations in social, cognitive, physical, linguistic, and psychological development. Content includes theory and research on psychological dimensions of children and adults in various contextual settings.", "recommended_prep": "", "professor": "RIOS, ORTIZ, GOODWIN, ROMO", "college": "GGSE"},
"ED 99": {"number": "99", "sub_dept": "ED", "title": "Independent Studies", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "1-5", "description": "Study of special problems in various fields of education and/or faculty  supervised research assistance.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 103": {"number": "103", "sub_dept": "ED", "title": "Technology Tools for Teachers", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor; upper-division standing.", "comments": "", "units": "3", "description": "Intended for upper-division undergraduates who contemplate entering a  teacher credential program. It will teach for and certify their competency in selected Technology Proficiencies required for the California Level I Teaching Credential.", "recommended_prep": "", "professor": "COPELAND", "college": "GGSE"},
"ED 109M": {"number": "109M", "sub_dept": "ED", "title": "Health Education", "dept": "ED", "prereqs": [], "prereq_description": "Admission to the Teacher Education Program; upper-division standing.", "comments": "", "units": "1", "description": "Introduces physiological, psychological, and sociological factors that   promote health and prevent disease including alcohol, narcotic, drug, and  tobacco abuse: nutrition, chronic and infectious diseases; reproductive  health and stress management. General educational applications lectures.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 111": {"number": "111", "sub_dept": "ED", "title": "Introduction to Child and Adolescent Development", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor; upper-division standing.", "comments": "", "units": "4", "description": "An introductory course on the development of children from infancy to  adolescence. Examines developmental changes and basic developmental    theories (e.g., Piaget, Vygotsky) in four general areas: cognitive,    social, language, and physical development. Fulfills TEP developmental   course prerequisite or Education minor.", "recommended_prep": "", "professor": "HUDLEY, KYRATZIS, OKAMOTO,", "college": "GGSE"},
"ED 112": {"number": "112", "sub_dept": "ED", "title": "The Education of Black Children", "dept": "ED", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "Explores the effects of social, political, and economic forces on the history of Black education. Examines ways of challenging the impacts of race, class, gender, and language in the educational achievement of Black children. Focuses on anti-bias/multicultural curricula in urban settings. Fieldwork required.", "recommended_prep": "", "professor": "MICHEL", "college": "GGSE"},
"ED 117M": {"number": "117M", "sub_dept": "ED", "title": "Motivation and Learning for Academic Success", "dept": "ED", "prereqs": [], "prereq_description": "Course is open only to newly-admitted transfer students entering in the", "comments": "Quarters usually offered: Summer. This is a summer only course.", "units": "2", "description": "Presents topics on motivation and learning that contribute to academic achievement. Students transitioning to the university will apply theory  to develop effective learning, study, and self-management strategies.  Designed for new transfer students taking at least 1 course in summer  session.", "recommended_prep": "", "professor": "HUDLEY", "college": "GGSE"},
"ED 118": {"number": "118", "sub_dept": "ED", "title": "The Research University and The Transfer Student Experience", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor; must be a new transfer student.", "comments": "", "units": "4", "description": "Introduces new transfer students to the mission of the research    university, the role of higher education in society and their role, as   students, within the community of scholars.  Topics cover academic, social and personal issues relevant to college students, specifically transfer  students.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED W  119": {"number": "W  119", "sub_dept": "ED", "title": "Framework for Teaching and Learning in K-12 Public School Classrooms", "dept": "ED", "prereqs": [], "prereq_description": "Upper division standing.", "comments": "", "units": "4", "description": "ED W 119 provides students the opportunity to consider and prepare for the K-12 teaching profession by examining six core responsibilities of K-12 educators: Knowing Your Students, Creating Learning Environments, Organizing Subject Matter, Designing Instruction, Assessing Student Learning, and Professional Development.", "recommended_prep": "", "professor": "BLACKWELL", "college": "GGSE"},
"ED 120": {"number": "120", "sub_dept": "ED", "title": "Practicum in Teaching in Higher Education", "dept": "ED", "prereqs": [], "prereq_description": "Upper-division standing; consent of instructor.", "comments": "", "units": "4", "description": "A course designed for undergraduate students who were selected to serve as co-leaders in one of our large courses (ED 20, ED 118, ED 173.)   Students will learn about adult development theories, pedagogical techniques, and learning assessment. Students will create lesson plans, facilitate discussions, grade assignments, and foster positive learning environments.", "recommended_prep": "", "professor": "LUBACH", "college": "GGSE"},
"ED 121": {"number": "121", "sub_dept": "ED", "title": "Introduction to K-12 Teaching", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "No prior experience or instructor approval required. After registration, students will be contacted by the instructor for K-12 classroom    placement instructions.", "units": "3", "description": "Provides students the opportunity to explore the teaching profession.  Students gain firsthand experience in a local K-12 classroom, examine the  California Standards for the Teaching Profession, and practice lesson  planning and other fundamental aspects of the teaching profession.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 122": {"number": "122", "sub_dept": "ED", "title": "Pre-professional Work in the K-12 Classroom", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "No prior experience or instructor approval required. After registration, students will be contacted by the instructor for K-12 classroom    placement instructions. Classroom time counts towards the      pre-professional requirement for UCSB's and other teacher education    programs. Course may be repeated for a maximum of four credits.", "units": "2", "description": "Students are placed in a local K-12 classroom to participate in and    observe firsthand the fundamental aspects of teaching and learning.    Through independent coursework, students reflect upon their classroom  experiences within the framework of the California Standards for the   Teaching Profession.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 123": {"number": "123", "sub_dept": "ED", "title": "Culture, Development, and Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor; upper-division standing.", "comments": "Priority enrollment will be given to seniors.", "units": "4", "description": "An examination of culturally constructed beliefs, attitudes, and values. Course examines how culture shapes human development, behavior, and    interpersonal relations in culturally pluralistic environments, with an  emphasis on educational settings.", "recommended_prep": "", "professor": "HUDLEY, BRENNER", "college": "GGSE"},
"ED 124": {"number": "124", "sub_dept": "ED", "title": "Practicum in Community Based Learning", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor; upper-division standing.", "comments": "May be repeated for credit to a maximum of 12 units.", "units": "4", "description": "Students do practicum hours in the local community and schools, read relevant articles and examine results from related research projects.", "recommended_prep": "", "professor": "BRENNER, DURAN", "college": "GGSE"},
"ED 125": {"number": "125", "sub_dept": "ED", "title": "", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor; upper-division standing.", "comments": "Priority enrollment will be given to seniors.", "units": "4", "description": "A study of the relationship between school and society. Social and political influences on education historically and currently are examined as well as schools as complex organizations and their unique roles in society.", "recommended_prep": "", "professor": "DUQUE", "college": "GGSE"},
"ED W  125": {"number": "W  125", "sub_dept": "ED", "title": "", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor; upper-division standing.", "comments": "", "units": "4", "description": "Study of the relationship between school and society.  Social and political influences on education historically and currently will be examined as well as schools as complex organizations and their unique roles in society.", "recommended_prep": "", "professor": "DUQUE", "college": "GGSE"},
"ED 126": {"number": "126", "sub_dept": "ED", "title": "Social Connectedness, Motivation, and Self-Regulation in Education", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "This course explores three fundamental student needs: to be connected to others socially, to be motivated, and to be self-regulated. The course investigates how educators might address these needs, and explores how interventions might improve these student outcomes.", "recommended_prep": "", "professor": "GEHLBACH, MIRELES RIOS</span> <i>", "college": "GGSE"},
"ED 128": {"number": "128", "sub_dept": "ED", "title": "CalTeach, Elementary Mathematics Education", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Introduction to learning and teaching mathematics in grades K-8.  The course requires attending a weekly on-campus seminar and participating in 15 hours of field placement in a local school.", "recommended_prep": "", "professor": "ROSS, CARLYLE", "college": "GGSE"},
"ED 129": {"number": "129", "sub_dept": "ED", "title": "CalTeach, Elementary Science Education", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Introduction to learning and teaching science in grades K-8.  The course requires attending a weekly on-campus seminar and participating in 15 hours of field placement in a local school.", "recommended_prep": "", "professor": "BIANCHINI, FELDWINN, LOHWASSER", "college": "GGSE"},
"ED 130": {"number": "130", "sub_dept": "ED", "title": "CalTeach, Secondary Mathematics Education", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Introduction to learning and teaching mathematics in grades 7-12.  The course requires attending a weekly on-campus seminar and participating in 15 hours of field placement in a local school.", "recommended_prep": "", "professor": "OGRAIN, ROSS, ROBERTS", "college": "GGSE"},
"ED 131": {"number": "131", "sub_dept": "ED", "title": "CalTeach, Secondary Science Education", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Introduction to learning and teaching science in grade 7-12.  The course requires attending a weekly on-campus seminar and participating in 15 hours of field placement in a local school.", "recommended_prep": "", "professor": "BIANCHINI, LOHWASSER, FELDWINN", "college": "GGSE"},
"ED 132": {"number": "132", "sub_dept": "ED", "title": "Innovative Practices for English Language Learners in K-12 Mathematics and Science Classrooms", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Introduces undergraduate students to the experiences and perspectives of English language learners (ELLs) in mathematics and science classrooms and ways in which teachers can support these students.", "recommended_prep": "", "professor": "ROBERTS, ARYA</span> <i>", "college": "GGSE"},
"ED 133": {"number": "133", "sub_dept": "ED", "title": "Physics and Everyday Thinking", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Develops ideas about physics content, the nature of scientific inquiry and about learning science through inquiry-based activities.", "recommended_prep": "", "professor": "HARLOW, BIANCHINI", "college": "GGSE"},
"ED 134": {"number": "134", "sub_dept": "ED", "title": "Advanced Problem Solving in Mathematical, Historical and Pedagogical Contexts", "dept": "ED", "prereqs": [["MATH 8"]], "prereq_description": "Mathematics 8 with a minimum grade of C.", "comments": "", "units": "4", "description": "Focuses on the strategies, representations, and language learners use to conceptualize and develop fundamental ideas of mathematics. Includes advanced mathematical problem solving and its implications for teaching and learning at the secondary level. Especially suitable for prospective middle school and high school teachers.", "recommended_prep": "", "professor": "OGRAIN, JACOB", "college": "GGSE"},
"ED 135": {"number": "135", "sub_dept": "ED", "title": "Advanced Problem Solving in Mathematical, Historical and Pedagogical Contexts", "dept": "ED", "prereqs": [["MATH 181A", "ED 134"]], "prereq_description": "Math 181A or ED 134 with a minimum grade of C.", "comments": "", "units": "4", "description": "Continuation of Math 181A or ED 134. Focuses on the representations, strategies, and language learners use to conceptualize and develop fundamental ideas of mathematics. Includes advanced mathematical problem solving and its implications for teaching and learning at the secondary level. Especially suitable for prospective middle and high school teachers.", "recommended_prep": "", "professor": "OGRAIN, JACOB", "college": "GGSE"},
"ED 136": {"number": "136", "sub_dept": "ED", "title": "Green Works- Exploring Technology and the Search for Sustainability", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "A multi-disciplinary class examining the interplay of technology, society, science, and history.  Investigate green technologies in an interactive  class format designed to encourage discussion and debate.  Innovative  science and social science labs provide hands-on learning.", "recommended_prep": "", "professor": "DARBY FELDWINN, JULIE DILLEMUT", "college": "GGSE"},
"ED 137": {"number": "137", "sub_dept": "ED", "title": "Equity in STEM Education", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Designed to study equity issues in the teaching and learning of STEM disciplines in P-20 education. Theory and practice is emphasized to understand some of the complexities and challenges in addressing issues of equity in STEM.", "recommended_prep": "", "professor": "ROBERTS</span> <i>", "college": "GGSE"},
"ED 138": {"number": "138", "sub_dept": "ED", "title": "Computer Programming and Engineering Design in Elementary School", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "This course focuses on computer programming skills, computational    thinking, and engineering design as they apply to the learning of    elementary school students.  It also includes a focus on how children  learn computer science.", "recommended_prep": "", "professor": "HARLOW</span> <i>", "college": "GGSE"},
"ED 139": {"number": "139", "sub_dept": "ED", "title": "Community Based Coastal Literacies: Exploring Culturally Responsive Texts and Tools for a Maritime Learning Community", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "The undergraduate course focuses on local K-12 learning and building a critical, culturally responsive framework for developing textual materials and assessments related to the following topics: oceanic/aquatic life and sustainability, environmental studies, marine biology, and local environmental issues and sustainability.", "recommended_prep": "", "professor": "ARYA</span> <i>", "college": "GGSE"},
"ED 140": {"number": "140", "sub_dept": "ED", "title": "Seminar and Practicum in Early Care and Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4-5", "description": "Introduction to early childhood education programs and a variety of design influences ranging from government mandates to child development theory. Topics include conflict resolution, language, literacy,and play in infant, toddler and preschool settings. Students reflect on application through  observation, field-note taking and practicum experience.", "recommended_prep": "", "professor": "KYRATZIS", "college": "GGSE"},
"ED 142": {"number": "142", "sub_dept": "ED", "title": "", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor; upper-division standing.", "comments": "", "units": "4", "description": "Examines the nature of language (grammar, semantics, pragmatics,     discourse). Topics include theoretical accounts of grammar and language  acquisition, and topics of language and literacy development in early care settings, including child peer discourse, and grammar and literacy   development in play.", "recommended_prep": "", "professor": "KYRATZIS, COOK-GUMPERZ", "college": "GGSE"},
"ED 145": {"number": "145", "sub_dept": "ED", "title": "Introduction to Research Methods", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Provides an overview of methods used to conduct educational research. Skills learned help students conduct their own research projects. No previous coursework or research experience is required.", "recommended_prep": "", "professor": "GOTTFRIED</span> <i>", "college": "GGSE"},
"ED 146": {"number": "146", "sub_dept": "ED", "title": "Community-Based Research and Outreach", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Community psychology and other ecologically-oriented psychologies strive to understand reciprocal relationships between individuals and their social contexts. Students learn about Ecological Systems theories to understand the experiences of children and their families in the communities we are working with and how to sustain reciprocal University-Community relationships. Students work directly at a site in the community to further understand social and educational dynamics. This is a 4-unit practicum course that applies to the Education Minor.", "recommended_prep": "", "professor": "MIRELES RIOS</span> <i>", "college": "GGSE"},
"ED 150": {"number": "150", "sub_dept": "ED", "title": "Teaching and Teachers", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Provides a basic foundation for understanding both (a) the nature of teaching as a specialized human activity (as distinct from other human activities) and (b) the organization and conduct of teaching in contemporary U.S. schools.", "recommended_prep": "", "professor": "DUQUE, DEWAR</span> <i>", "college": "GGSE"},
"ED 173": {"number": "173", "sub_dept": "ED", "title": "Introduction to Leadership Development", "dept": "ED", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "This course is an overview of theoretical constructs and practical   applications of leadership. Through lectures, readings, discussions, and projects, the course will assist students in developing individual   approaches to effective leadership.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 176B": {"number": "176B", "sub_dept": "ED", "title": "Practicum in Individual Differences", "dept": "ED", "prereqs": [], "prereq_description": "Upper-division standing; consent of instructor.", "comments": "Class attendance is mandatory. Students must have access to an email   account and web browser.", "units": "4", "description": "Students study and discuss important educational policy issues while   tutoring with elementary school students with learning problems in   mathematics, reading, and language development.", "recommended_prep": "", "professor": "GERBER", "college": "GGSE"},
"ED 190": {"number": "190", "sub_dept": "ED", "title": "Introduction to Autism", "dept": "ED", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "Overview of diagnostic, clinical, and educational approaches used for autism. Intervention procedures in clinical, school, and family settings are discussed in relation to language development, social development, and self-stimulatory behavior, self-injury, and pivotal behaviors related to a favorable prognosis.", "recommended_prep": "", "professor": "VERNON", "college": "GGSE"},
"ED 191A": {"number": "191A", "sub_dept": "ED", "title": "Sex and Relationships", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "Since this course is a pre-requisite for ED 191D, Peer Health Education  Internship, students enrolling in this class should be interested in   being trained as a health intern. As such, professional standards of   behavior will be expected.", "units": "4", "description": "", "recommended_prep": "", "professor": "WHITE", "college": "GGSE"},
"ED 191B": {"number": "191B", "sub_dept": "ED", "title": "Alcohol and Drugs", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "Since this course is a pre-requisite for ED 191D, Peer Health Education  Internship, students enrolling in this class should be interested in   being trained as a health intern. As such, professional standards of   behavior will be expected.", "units": "4", "description": "", "recommended_prep": "", "professor": "WHITE", "college": "GGSE"},
"ED 191C": {"number": "191C", "sub_dept": "ED", "title": "Healthy Eating and Living", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "Since this course is a pre-requisite for ED 191D, Peer Health Education  Internship, students enrolling in this class should be interested in   being trained as a health intern. As such, professional standards of   behavior will be expected.", "units": "4", "description": "Internship training in healthy eating and living (HEAL), life skills   (i.e., self-  awareness and assertive communication); health skills; and peer education skills (i.e., group facilitation and motivational   interviewing). Enrollment into ED 191D (Peer Health Education    Internship) will be based on performance in ED 191A, ED 191B, ED 191C, and ED 191W.", "recommended_prep": "", "professor": "WHITE", "college": "GGSE"},
"ED 191D": {"number": "191D", "sub_dept": "ED", "title": "Peer Health Education Internship", "dept": "ED", "prereqs": [["ED 191A", "ED 191B", "ED 191C", "ED 191W"]], "prereq_description": "ED 191A, ED 191B, ED 191C or ED 191W; enrollment into ED 191D (Peer Health Education", "comments": "Half of students in this course will be students new to ED 191D and half will be students repeating ED 191D. Professional standards of behavior will be expected. Enrollment into ED 191D (Peer Health Education   Internship) will be based on performance in ED 191A, ED 191B, ED 191C, and ED 191W.", "units": "3", "description": "Under supervision, interns provide health and wellness services to UCSB  students through informational, educational, environmental, and    motivational activities. Enrollment into ED 191D (Peer Health Education  Internship) will be based on performance in ED 191A, ED 191B, ED 191C, and ED 191W.", "recommended_prep": "", "professor": "WHITE", "college": "GGSE"},
"ED 191W": {"number": "191W", "sub_dept": "ED", "title": "Health and Well-Being", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Explores how personal, family, school, community and environmental factors are related to academic, physical, emotional and social well-being. Topics include physiological and sociological effects of mental health,     nutrition; sexual health; relationships; alcohol, tobacco, drug abuse.   Covers children through emerging adults.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "GGSE"},
"ED 196": {"number": "196", "sub_dept": "ED", "title": "Special Practicum in Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "2-4", "description": "Topics and field placement sites vary by instructor.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 197": {"number": "197", "sub_dept": "ED", "title": "Special Topics in Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "2-4", "description": "Topics vary by instructor.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 199": {"number": "199", "sub_dept": "ED", "title": "Independent Studies", "dept": "ED", "prereqs": [], "prereq_description": "Upper-division standing; completion of 2 upper-division courses in", "comments": "Students must have a minimum 3.0 GPA for the preceding 3 quarters and  are limited to five units per quarter and 30 units total in all    99/199/199RA courses combined.", "units": "1-5", "description": "Study of special problems in various fields of education.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 199RA": {"number": "199RA", "sub_dept": "ED", "title": "Independent Research Assistance", "dept": "ED", "prereqs": [], "prereq_description": "Upper-division standing; completion of 2 upper-division courses in", "comments": "Students must have a minimum 3.0 GPA for the preceding 3 quarters and  are limited to five units per quarter and 30 units total in all    99/199/199RA courses combined.", "units": "1-5", "description": "Coursework shall consist of faculty supervised research assistance.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 200A": {"number": "200A", "sub_dept": "ED", "title": "Education Proseminar", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "2", "description": "Introduction to both graduate student life and research in Education. Includes information about campus resources, trainings in campus requirements, and an introduction to the basic principles of qualitative and quantitative research in Education.", "recommended_prep": "", "professor": "HARLOW, LEE, OKAMOTO</span> <i>", "college": "GGSE"},
"ED 200B": {"number": "200B", "sub_dept": "ED", "title": "Education Proseminar II", "dept": "ED", "prereqs": [["ED 200A"]], "prereq_description": "ED 200A", "comments": "", "units": "1", "description": "This course helps to build community among Education graduate students. It explores research and community outreach projects led by Education faculty and colleagues. It also provides opportunities to strengthen research skills and present emergent research ideas.", "recommended_prep": "", "professor": "BIANCHINI, NYLUND-GIBSON, MAUL", "college": "GGSE"},
"ED 201B": {"number": "201B", "sub_dept": "ED", "title": "Survey Research Design", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "The design of original surveys and the use of existing surveys in    educational reseach. Topics include sampling, questionnaire construction,  scales and coding, data management, and supplemental data from school  records.", "recommended_prep": "", "professor": "OKAMOTO, RUMBERGER", "college": "GGSE"},
"ED 201D": {"number": "201D", "sub_dept": "ED", "title": "Single Case Experimental Design", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "Not open for credit to students who have completed Education 213A.", "units": "4", "description": "Students design and critique original single case experimental projects. The course covers the internal logic of each design, internal validity,  external validity, development of reliable dependent of reliable dependent measures and observational systems, as well as issues regarding social   validity.", "recommended_prep": "", "professor": "FURLONG, KOEGEL", "college": "GGSE"},
"ED 201F": {"number": "201F", "sub_dept": "ED", "title": "Issues in Research Methodology", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "1-6", "description": "In-depth consideration of emerging topics in research methodology in   education.", "recommended_prep": "", "professor": "NYLUND-GIBSON; MARCOULIDES", "college": "GGSE"},
"ED 201G": {"number": "201G", "sub_dept": "ED", "title": "APPLIED CASUAL INFERENCE", "dept": "ED", "prereqs": [["ED 216A"]], "prereq_description": "Education 216A", "comments": "", "units": "4", "description": "INTRODUCES A SET OF QUASI-EXPERIMENTAL APPROACHES FOR ESTIMATING CAUSAL  INFERENCES IN EDUCATIONAL RESEARCH.  METHODS EXPLORED INCLUDE: FIXED EFFECTS, INSTRUMENTAL VARIABLES, DIFFERENCE-IN-DIFFERENCE ESTIMATORS,  REGRESSION DISCONTINUITY, AND PROPENSITY SCORE MATCHING.  STUDENTS   WILL APPLY THESE TECHNIQUES USING LARGE-SCALE DATASETS.", "recommended_prep": "", "professor": "GOTTFRIED, RUMBERGER", "college": "GGSE"},
"ED 202A": {"number": "202A", "sub_dept": "ED", "title": "Bilingual Language Development", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "This course describes theoretical and empirical accounts of the knowledge  representations and psychological processes underlying language    comprehension and production. Representative topics include discourse  processing; conversational interaction; memory for words, sentences, and text; metalinguistic skills, language development.", "recommended_prep": "", "professor": "KYRATZIS", "college": "GGSE"},
"ED 202B": {"number": "202B", "sub_dept": "ED", "title": "Language Socialization and Education", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Examines how children and youth, in contexts of migration and postcolonialism, become socialized through discourse to become competent members of communities, and how children (and institutions) navigate discontinuities in cultural and linguistic practices across home and school settings.", "recommended_prep": "", "professor": "KYRATZIS</span> <i>", "college": "GGSE"},
"ED 202C": {"number": "202C", "sub_dept": "ED", "title": "Development of Academic Literacies", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Examination of the research literature on the development of writing competence in and outside of school from early childhood through advanced adult competence.", "recommended_prep": "", "professor": "BAZERMAN, DEWAR", "college": "GGSE"},
"ED 202D": {"number": "202D", "sub_dept": "ED", "title": "Writing Across the Curriculum and in the Disciplines", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Examination of research literature in writing in disciplines and     professions to consider the different dynamics, functions, and forms of  writing in the separate areas and different paths of skill development and socialization  Consideration of findings at university and professional  levels and their application to K-12 settings.", "recommended_prep": "", "professor": "BAZERMAN, BLAU", "college": "GGSE"},
"ED 202E": {"number": "202E", "sub_dept": "ED", "title": "History of Literacy and Social Organization", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Investigation of historical emergence of literate practices in relation to social organization realized in scribal, print, and electronic media.  Consideration of the rise and role of school, academic, disciplinary,  professional, and information culture with implications for current    literacy education.", "recommended_prep": "", "professor": "BAZERMAN, BLAU", "college": "GGSE"},
"ED 202F": {"number": "202F", "sub_dept": "ED", "title": "Literacy in the Information Age", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor to finalize registration.", "comments": "", "units": "4", "description": "Definitions of \"literacy\" are evolving and expanding as they and new   information technologies (especially computers) are co-constructed. This course examines the political, pedagogical, and research consequences  implied when traditional definitions of literacy are revised and when new  literacies are introduced.", "recommended_prep": "", "professor": "LUNSFORD, BAZERMAN", "college": "GGSE"},
"ED 202H": {"number": "202H", "sub_dept": "ED", "title": "Writing Program Administration", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Examination of theory and practice of writing program administration   focusing on important issues in the field. Students learn about and    discuss those issues and focus their research on a local instantiation of  administration. An optional administrative internship may be added to the  class work.", "recommended_prep": "", "professor": "LUNSFORD, BAZERMAN", "college": "GGSE"},
"ED 202I": {"number": "202I", "sub_dept": "ED", "title": "Literacy Assessment", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Issues of writing assessment from micro (student papers) to macro (large-scale assessment: NAEP, UC Subject A Examinations), and writing program assessment. Exploration of different research paradigms in writing assessment: empirical and hermeneutic are also discussed.", "recommended_prep": "", "professor": "LUNSFORD, BAZERMAN", "college": "GGSE"},
"ED 203A": {"number": "203A", "sub_dept": "ED", "title": "", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Students will develop a rigorous way of thinking about, talking about, and practicing education for a diverse society. Explores the complex relationship among culture, society, and the organization of school. Considers the complex relations among teachers and learners within the context of U.S. schools.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "GGSE"},
"ED 205": {"number": "205", "sub_dept": "ED", "title": "Anthropological/Sociological Perspectives on Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Examination of anthropological and sociological approaches that have   education as a central theoretical issue. Use of a comparative perspective to explore a series of issues of relevance to U.S. education and to    education in a variety of other countries.", "recommended_prep": "", "professor": "BRENNER, COOK-GUMPERZ", "college": "GGSE"},
"ED 206": {"number": "206", "sub_dept": "ED", "title": "Epistemology and Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Theories of knowledge are brought to bear on educational issues such as  pedagogy, research traditions, and curricular legitimization. The course treats epistemological topics such as perception, objectivity,     argumentation, rationality, theories, paradigms, and the aims of social  science research.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 207": {"number": "207", "sub_dept": "ED", "title": "Sociolinguistics in Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Course addresses the origins, basic concepts, and recent research in   sociolinguistics. Both earlier foundational work and recent development in new topics are explored. These include, but are not limited to     interactional sociolinguistics, feminist sociolinguistics,       sociolinguistics in the classroom.", "recommended_prep": "", "professor": "COOK-GUMPERZ, GREEN", "college": "GGSE"},
"ED 208": {"number": "208", "sub_dept": "ED", "title": "Applied Rhetoric, Poetics, and Linguistics", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Examines current and seminal theory and research in the areas of literary  criticism, rhetoric, composition, linguistics, and language acquisition as they apply to the teaching of english in grades 7-14.", "recommended_prep": "", "professor": "BLAU", "college": "GGSE"},
"ED 209A": {"number": "209A", "sub_dept": "ED", "title": "Seminar in Language Development", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "The course describes theoretical and empirical accounts of the development of the knowledge representations and psychological and social processes  underlying language comprehension and use. Topics: grammatical and word  meaning development, role of social-interactive routines, situational  variation, child discourse, emergent literacy, relationships of    oral/written discourse, atypical language development and issues of    cultureand language.", "recommended_prep": "", "professor": "KYRATZIS, OKAMOTO", "college": "GGSE"},
"ED 209B": {"number": "209B", "sub_dept": "ED", "title": "Seminar in Social Development", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instuctor.", "comments": "", "units": "4", "description": "Examination of theory and research on human social development from    infancy to adolescence. Topics include family socialization, agression and prosocial behavior, gender differences, peer and media influences, and   social cognition.", "recommended_prep": "", "professor": "HUDLEY, JIMERSON", "college": "GGSE"},
"ED 209C": {"number": "209C", "sub_dept": "ED", "title": "Seminar in Cognitive Development", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Examination of current research and theories in cognitive development.   Focus on young children's thinking. Special attention to biological and  cultural influences on thinking as well as to implications of cognitive  development research for education.", "recommended_prep": "", "professor": "KYRATZIS, OKAMOTO", "college": "GGSE"},
"ED 209D": {"number": "209D", "sub_dept": "ED", "title": "Research Seminar in Human Development", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "May be repeated for credit.", "units": "1-6", "description": "Seminar for students engaged in the conceptualization, conduct, or   analysis of research on child and adolescent development.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 209E": {"number": "209E", "sub_dept": "ED", "title": "Seminar in Human Development", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "May be repeated.", "units": "4", "description": "In-depth consideration of emerging topics in human development. Course   content may vary.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 209G": {"number": "209G", "sub_dept": "ED", "title": "Ethnic Identity", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Seminar examines the development of ethnic and racial identity among   children and adolescents. Topics include self-concept, family      socialization, language, peers, and inter-and-intra group relations.   Specific attention given to theories pertinent to this area of development.", "recommended_prep": "", "professor": "HUDLEY, ROMO", "college": "GGSE"},
"ED 209H": {"number": "209H", "sub_dept": "ED", "title": "Physical Development and Health", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Examines the physical changes moving the individual from childhood into  adolescence, and the prevention of behaviors that can lead to health   problems.  Interventions designed to reduce adolescent risk-taking   behavior and enhance the adoption of health-promoting behavior will be   discussed.", "recommended_prep": "", "professor": "ROMO, OKAMOTO", "college": "GGSE"},
"ED 209I": {"number": "209I", "sub_dept": "ED", "title": "Cognitive Perspectives on Achievement Motivation", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Course examines the role of individual cognitions, interpersonal     interaction, and environmental characteristics in the development of   achievement motivation. We will discuss key cognitive constructs that are  implicated in the development of achievement motivation, including   perceived competence, self-efficacy, self-worth, stereotype threat, and  intrinsic motivation.", "recommended_prep": "", "professor": "HUDLEY", "college": "GGSE"},
"ED 210": {"number": "210", "sub_dept": "ED", "title": "Introduction to Learning, Teaching, and Teacher Education", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Provides an overview of critical issues in teaching, learning, and teacher education, including: the role of schools in U.S. society; analysis of learners in school; seminal learning theories and their applications to content learning and teaching theory; and teacher learning.", "recommended_prep": "", "professor": "SLOAN, LAMBERT, DUQUE</span> <i>", "college": "GGSE"},
"ED 210A": {"number": "210A", "sub_dept": "ED", "title": "Advances in the Learning Sciences and Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Survey of contemporary theoretical approaches and empirical findings in  the areas of learning, instruction, cognitive processes, situated    cognition, cultural models of education,  and innovative applications of information technology.", "recommended_prep": "", "professor": "DURAN, GREEN", "college": "GGSE"},
"ED 210B": {"number": "210B", "sub_dept": "ED", "title": "Introduction to Children's Thinking", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Presents a broad perspective of cognitive development and focuses on   topics such as perception; problem solving; meta cognition; etc. The   educational application of cognitive research is also covered.", "recommended_prep": "", "professor": "OKAMOTO", "college": "GGSE"},
"ED 210D": {"number": "210D", "sub_dept": "ED", "title": "Seminar in Cultural Perspectives of Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "May be repeated for credit.", "units": "1-6", "description": "In-depth consideration of emerging topics in cultural perspectives of  education.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 210E": {"number": "210E", "sub_dept": "ED", "title": "Foundations of Sociocultural Learning Theory", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Examination of founding theoretical texts of sociocultural theory of   learning in both Russia and the West and their application to current  issues in education.", "recommended_prep": "", "professor": "BAZERMAN, DURAN", "college": "GGSE"},
"ED 210F": {"number": "210F", "sub_dept": "ED", "title": "Cultural Psychology: Contemporary Socio-Cultural Learning Theory", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "An examination of contemporary developments in cultural psychology and   applications to education and learning in diverse sociocultural settings.", "recommended_prep": "", "professor": "BAZERMAN, DURAN", "college": "GGSE"},
"ED 210G": {"number": "210G", "sub_dept": "ED", "title": "Crosscultural Psychology", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instuctor.", "comments": "", "units": "4", "description": "Investigation of current issues in social and cognitive psychology with a  crosscultural perspective.", "recommended_prep": "", "professor": "BROWN, HO", "college": "GGSE"},
"ED 211A": {"number": "211A", "sub_dept": "ED", "title": "Proseminar: Introduction to Human Development", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Introduction to on-going human development pursued by education faculty. Emphasis on current theory and methods guiding research in human     development.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 211B": {"number": "211B", "sub_dept": "ED", "title": "Development: Infancy and Early Childhood", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Theoretical bases and empirical findings on the development of children  from conception through pre-school age across various areas of competency; such as social, language, moral, cognitive, and motor.", "recommended_prep": "", "professor": "HUDLEY, KYRATZIS, OKAMOTO, ROM", "college": "GGSE"},
"ED 211C": {"number": "211C", "sub_dept": "ED", "title": "Development: Middle Childhood to Adolescence", "dept": "ED", "prereqs": [["ED 211B"]], "prereq_description": "Education 211B.", "comments": "", "units": "4", "description": "Theoretical bases and empirical findings on the development of children  from age six to adolescence across various areas of competency, such as  social, language, moral, cognitive, and motor.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 211D": {"number": "211D", "sub_dept": "ED", "title": "Development: Adolescence to Adulthood", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Theory and research about development during adolescence. Discussion of  transitions and adaptations during adolescence considering social    development, cognitive development, personality development, biological  development, and important contexts of adolescent development (e.g.    families, schools, peer groups, work and communities).", "recommended_prep": "", "professor": "HUDLEY, JIMERSON", "college": "GGSE"},
"ED 211G": {"number": "211G", "sub_dept": "ED", "title": "Theories of Human Development", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor", "comments": "", "units": "4", "description": "Course presents a comprehensive overview of the major theoretical    perspectives that guide research and thinking on human growth and change across cultures and contexts. Students will discuss and analyze selected theories guiding the scientific study of cognitive development, social   development, and lifespan development.", "recommended_prep": "", "professor": "HUDLEY", "college": "GGSE"},
"ED 212": {"number": "212", "sub_dept": "ED", "title": "Quantitative Methods in the Social Sciences Colloquium", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "Same course as Sociology 212Q, PSTAT 250, and Geography 201Q. May be   repeated.", "units": "2", "description": "Required course for students in the Interdisciplinary Quantitative Methods in the Social Science emphasis.", "recommended_prep": "", "professor": "ZWICK", "college": "GGSE"},
"ED 214A": {"number": "214A", "sub_dept": "ED", "title": "Introductory Statistics", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Introduction to the application of descriptive and and basic inferential statistics in educational research. Topics include experimental and survey design principles, measures of central tendency and variability,     elementary probability concepts, basic hypothesis testing, and procedures  for testing the difference between two means.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "GGSE"},
"ED 214B": {"number": "214B", "sub_dept": "ED", "title": "Inferential Statistics", "dept": "ED", "prereqs": [["ED 214A"]], "prereq_description": "Education 214A.", "comments": "", "units": "4", "description": "Hypothesis testing and interval estimation techniques for application of educational research. Includes bivariate correlation and regression,   one-way analysis of variance, and elementary techniques for categorical  data analysis.", "recommended_prep": "", "professor": "HO, NYLUND-GIBSON, ZWICK", "college": "GGSE"},
"ED 214C": {"number": "214C", "sub_dept": "ED", "title": "Linear Models for Data Analysis", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Intermediate data analysis methods, all of which can be considered to be instances of a general linear model. Selected topics in multiple     regression and analysis of variance (ANOVA), including regression with   qualitative independent variables, logistic regression models, one- and  two-way ANOVA models and analysis of covariance.", "recommended_prep": "", "professor": "NYLUND-GIBSON, ZWICK", "college": "GGSE"},
"ED 215B": {"number": "215B", "sub_dept": "ED", "title": "Psychometrics", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Introduction to classical test theory and item response theory which   provide tools for understanding and analyzing data from educational and  psychological tests. Topics include test scoring, validity, reliability, test bias and the development of tests and questionnaires.", "recommended_prep": "", "professor": "ZWICK", "college": "GGSE"},
"ED 216A": {"number": "216A", "sub_dept": "ED", "title": "Advanced Multivariate Statistics", "dept": "ED", "prereqs": [["ED 214A"], ["ED 214B"], ["ED 214C"]], "prereq_description": "Education 214A, 214B, 214C.", "comments": "", "units": "4", "description": "The theory and application of multivariate statistics, including     multivariate analysis of variance, discriminant analysis, and canonical  correlation. Instruction in the necessary matrix algebra will be provided.", "recommended_prep": "", "professor": "ZWICK", "college": "GGSE"},
"ED 216B": {"number": "216B", "sub_dept": "ED", "title": "Factor Analysis", "dept": "ED", "prereqs": [["ED 214A"], ["ED 214B"], ["ED 214C"], ["ED 216A"]], "prereq_description": "Education 214A, 214B, 214C, and 216A.", "comments": "", "units": "4", "description": "The theory and application of exploratory and confirmatory factor    analysis models.", "recommended_prep": "", "professor": "NYLUND-GIBSON", "college": "GGSE"},
"ED 216C": {"number": "216C", "sub_dept": "ED", "title": "Hierarchical Linear Models", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Many educational phenomena operate at multiple levels, such as the effects of school characteristics on student achievement. This course introduces students to statistical techniques for estimating linear models involving  multilevel data, including time periods, individuals, and institutions.", "recommended_prep": "", "professor": "RUMBERGER", "college": "GGSE"},
"ED 216E": {"number": "216E", "sub_dept": "ED", "title": "Nonparametric Statistics", "dept": "ED", "prereqs": [["ED 214A"], ["ED 214B"]], "prereq_description": "Education 214A and 214B.", "comments": "", "units": "4", "description": "Analysis of data using techniques that are appropriate when assumptions of traditional normal-theory statistical procedures are not met. Includes the Wilcoxon and Kruskal-Wallis tests, Spearman Correlation, Kendall's Tau,and methods for the analysis of frequency data.", "recommended_prep": "", "professor": "ZWICK", "college": "GGSE"},
"ED 216F": {"number": "216F", "sub_dept": "ED", "title": "Structural Equation Models", "dept": "ED", "prereqs": [["ED 214A"], ["ED 214B"], ["ED 214C"]], "prereq_description": "Education 214A, 214B, and 214C.", "comments": "", "units": "4", "description": "The theory and application of structural equation modeling (also called  analysis of covariance structures).", "recommended_prep": "", "professor": "HONG", "college": "GGSE"},
"ED 216G": {"number": "216G", "sub_dept": "ED", "title": "Introduction to Applied Mixture Modeling", "dept": "ED", "prereqs": [["ED 216B"], ["ED 216F"]], "prereq_description": "ED 216B and ED 216F.", "comments": "", "units": "4", "description": "This course provides an introduction to the theory and practice of mixture modeling.", "recommended_prep": "", "professor": "NYLUND-GIBSON, MARCOULIDES", "college": "GGSE"},
"ED 217A": {"number": "217A", "sub_dept": "ED", "title": "Constructing Measures", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Covers foundational issues in the design and evaluation of measurement instruments in education and psychology. Students design and     pilot-test an instrument (e.g. an academic test, attitudinal survey, observation protocol, etc.) and evaluate its reliability and validity.", "recommended_prep": "Participants in this course are expected to have a familiarity with  basic issues in research design and statistics commensurate with what is normally covered in first-year courses.", "professor": "MAUL", "college": "GGSE"},
"ED 217B": {"number": "217B", "sub_dept": "ED", "title": "Analyzing and Validating Measures", "dept": "ED", "prereqs": [["ED 217A"]], "prereq_description": "ED 217A or consent of instructor", "comments": "", "units": "4", "description": "Covers foundational issues in the design, evaluation, and use of   measurement instruments in education and psychology, including basic   treatment of psychometrics, and in particular, item response theory  (IRT).", "recommended_prep": "", "professor": "MAUL", "college": "GGSE"},
"ED 217C": {"number": "217C", "sub_dept": "ED", "title": "Philosophy of Measurement", "dept": "ED", "prereqs": [["ED 217A"], ["ED 217B"]], "prereq_description": "ED 217A and ED 217B OR consent of instructor.", "comments": "", "units": "4", "description": "Introduction to the philosophical foundations of measurement theory, with a focus on applications in the social sciences. Explores how different philosophical perspectives affect the way in which measurement results are used and interpreted. Also provides an introduction to validity theory.", "recommended_prep": "", "professor": "MAUL", "college": "GGSE"},
"ED 218": {"number": "218", "sub_dept": "ED", "title": "Questionnaire Design: A Practical Guide From Conceptualization to Administration", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "Concurrently offered with ESM 269.", "units": "4", "description": "Participants learn a survey design process by developing their own survey scale.  The process includes: a literature review, interviews/focus groups, synthesizing key indicators, writing items according to best practices, conducting an expert review, cognitive pre-testing items, and small-scale pilot testing.", "recommended_prep": "", "professor": "GEHLBACH", "college": "GGSE"},
"ED 219B": {"number": "219B", "sub_dept": "ED", "title": "Research on Classroom Teaching", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Introduction to various genre of research that have attempted to     understand and improve classroom teaching over the past thirty years.  Exploration of contemporary research programs and their results.", "recommended_prep": "", "professor": "GREEN, COPELAND", "college": "GGSE"},
"ED 220": {"number": "220", "sub_dept": "ED", "title": "Introduction to Program Evaluation", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "This course is an overview of the field of program evaluation and its  various aspects (planning, collecting, analyzing information, and    reporting), as well as various evaluation strategies (i.e., qualitative, quantitative, formative, and summative), including those employing   experimental and quasi-  experimental designs.", "recommended_prep": "", "professor": "YUN, RUMBERGER</span> <i>", "college": "GGSE"},
"ED 221A": {"number": "221A", "sub_dept": "ED", "title": "Introduction to Qualitative Research Methods", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Provides an introduction to qualitative research methods, including  techniques for data collection and analysis within various     disciplinary perspectives, experience participating in field research  methods, and qualitative data analysis programs.", "recommended_prep": "", "professor": "ARYA, DUQUE, ROBERTS</span> <i>", "college": "GGSE"},
"ED 221B": {"number": "221B", "sub_dept": "ED", "title": "Qualitative Interviewing", "dept": "ED", "prereqs": [["ED 221A"]], "prereq_description": "Education 221A or consent of instructor.", "comments": "", "units": "4", "description": "Provides an introduction to qualitative interviewing traditions,   including ethnographic interviews, life history interviews, cognitive  interviews, and focus group interviews. Includes examination of the  nuts and bolts of conducting and analyzing interviews as well.", "recommended_prep": "", "professor": "BIANCHINI, BRENNER, COOK-GUMPE", "college": "GGSE"},
"ED 221D": {"number": "221D", "sub_dept": "ED", "title": "Video Analysis", "dept": "ED", "prereqs": [["ED 221A"]], "prereq_description": "Education 221A or consent of instructor.", "comments": "", "units": "4", "description": "Examines ways of analyzing classroom ethnography data, sociolinguistic and ethnographic approaches to data analysis, and issues in data   analysis.  Involves participants in the process of video data analysis.", "recommended_prep": "", "professor": "DUQUE, ROBERTS", "college": "GGSE"},
"ED 221F": {"number": "221F", "sub_dept": "ED", "title": "Community Ethnography", "dept": "ED", "prereqs": [["ED 221"]], "prereq_description": "Education 221a or consent of instructor.", "comments": "", "units": "4", "description": "Explores how to carry out ethnographic research in order to investigate  the relationships among schools, families, and communities.", "recommended_prep": "", "professor": "BRENNER", "college": "GGSE"},
"ED 221H": {"number": "221H", "sub_dept": "ED", "title": "Design-Based Research and Research-Based Design", "dept": "ED", "prereqs": [["ED 221A"]], "prereq_description": "Education 221A or consent of instructor.", "comments": "", "units": "4", "description": "Examines the concurrent design of learning contexts and research on  learning. Combines many different research methods. The readings and   topics are subject to change based on students' interest.", "recommended_prep": "", "professor": "HARLOW", "college": "GGSE"},
"ED 221CC": {"number": "221CC", "sub_dept": "ED", "title": "Observational Research", "dept": "ED", "prereqs": [["ED 221A"]], "prereq_description": "Education 221A or consent of instructor.", "comments": "", "units": "4", "description": "Explores theory used in observations, the kinds of field notes used  during observations, how to organize field notes to create scenes, and how to complete analysis of observations through memos, coding, and  moving between theory and data.", "recommended_prep": "", "professor": "DUQUE, ROBERTS", "college": "GGSE"},
"ED 221EE": {"number": "221EE", "sub_dept": "ED", "title": "Discourse Analysis in Educational Settings", "dept": "ED", "prereqs": [["ED 221A"]], "prereq_description": "Education 221A or consent of instructor.", "comments": "", "units": "4", "description": "Examines the nature of discourse, linguistic constructs, and how they  apply to student discourse in educational settings. Includes issues in transcribing and analyzing classroom talk.", "recommended_prep": "", "professor": "CHUN", "college": "GGSE"},
"ED 221GG": {"number": "221GG", "sub_dept": "ED", "title": "Case Study Methods: Research and Practice", "dept": "ED", "prereqs": [["ED 221A"]], "prereq_description": "Education 221A or consent of instructor.", "comments": "", "units": "4", "description": "Focuses on case study methodology. Students learn the different types of case studies and the value of using a multiple case design. Also   provides students with tools for preparing their dissertation proposal.", "recommended_prep": "", "professor": "CONLEY, COOK-GUMPERZ", "college": "GGSE"},
"ED 222A": {"number": "222A", "sub_dept": "ED", "title": "Introduction to Exceptional Children", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Overview of the historical, social, and legislative foundations of the education of the exceptional pupil. Survey of the range and nature of disabilities requiring special education.", "recommended_prep": "", "professor": "SINGER, WANG</span> <i>", "college": "GGSE"},
"ED 222B": {"number": "222B", "sub_dept": "ED", "title": "Academic and Cognitive Characteristics of Students with Mild Disabilities", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Study of the academic and cognitive characteristics of children who are at risk or have mild disabilities. Interventions for these students will also be covered.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 222C": {"number": "222C", "sub_dept": "ED", "title": "", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Study of the affective and social characteristics of children who are at risk or have mild disabilities. Interventions for these students will also be covered.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 222D": {"number": "222D", "sub_dept": "ED", "title": "Law, Ethics, and History of Special Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Intensive look at the laws governing special education and civil rights  for people with disabilities in the U.S. The ethics of special education and key historical developments are also covered. Topics include current controversies and historical trends.", "recommended_prep": "", "professor": "GERBER, SINGER", "college": "GGSE"},
"ED 222E": {"number": "222E", "sub_dept": "ED", "title": "Developmental Behavioral Genetics", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Provides an overview of the field of developmental behavioral genetics.  Topics covered include basic principles of genetics, mechanisms of   genetics transmission, chromosomal abnormalities, behavior genetics    methodologies, and the genetics of specific behavioral disorders in    children and adults.", "recommended_prep": "", "professor": "HO, GERBER</span> <i>", "college": "GGSE"},
"ED 222F": {"number": "222F", "sub_dept": "ED", "title": "Inclusive Education", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Explores critical issues in inclusive education, the participation of students with disabilities in general education settings. The class explores the history of inclusion within social justice movements, Multi-Tiered Systems of Support (MTSS) and Universal Design for Learning.", "recommended_prep": "", "professor": "LAMBERT, WANG</span> <i>", "college": "GGSE"},
"ED 223H": {"number": "223H", "sub_dept": "ED", "title": "Education Policy for Special Populations", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Focus on federal and state education policy that addresses education   problems of special populations \u0016 those characterized in terms of ability, socioeconomic status, or ethno-linguistic differences or veterans status.  Particular attention is given to the Elementary and Secondary Education  Act, originally intended to compensate for the negative effects of   economic disadvantage, and the Individuals with Disabilities Education   Act, originally intended to provide equal access and opportunity for   preschoolers, children, and youth with disabilities. Discussions will  involve different perspectives on policy-making, policy analysis, policy research, and policy analysis research. M.A. or M.Ed.", "recommended_prep": "", "professor": "GERBER, SINGER", "college": "GGSE"},
"ED 224AA": {"number": "224AA", "sub_dept": "ED", "title": "Interactional Ethnography", "dept": "ED", "prereqs": [["ED 221A"], ["ED 221EE"]], "prereq_description": "Education 221A and Education 221EE or consent of instructor.", "comments": "", "units": "4", "description": "Examines the pre-fieldwork and fieldwork phase of ethnography in school  and classroom settings, including issues of entry and access,    theoretical frameworks, indexing data, and the processes of data   collection and analysis.", "recommended_prep": "", "professor": "ARYA", "college": "GGSE"},
"ED 224B": {"number": "224B", "sub_dept": "ED", "title": "Narrative Analysis", "dept": "ED", "prereqs": [["ED 221A"]], "prereq_description": "Education 221A or consent of instructor.", "comments": "", "units": "4", "description": "Explores linguistic/stylistic and thematic/content analyses, and   structural approaches of classic narrative theory.  Explores also how  narratives are used to shape personal shared reality and social    relationships; have power; are embedded in conversations; and differ   across gender and culture.", "recommended_prep": "", "professor": "COOK-GUMPERZ, ARYA", "college": "GGSE"},
"ED 224CC": {"number": "224CC", "sub_dept": "ED", "title": "Textual Analysis", "dept": "ED", "prereqs": [["ED 221A"]], "prereq_description": "Education 221A or consent of instructor.", "comments": "", "units": "4", "description": "Examines principles and practice in methods of investigating writing;  applicability and adaptations of qualitative and quantitative research methods; problems of assessing writing test, skills, and processes in  research; and use of research techniques for reflective practice of  teachers and writers.", "recommended_prep": "", "professor": "BAZERMAN, ARYA", "college": "GGSE"},
"ED 225": {"number": "225", "sub_dept": "ED", "title": "Evaluation Procedures", "dept": "ED", "prereqs": [["ED 220"]], "prereq_description": "ED 220", "comments": "", "units": "4", "description": "Evaluation practice integrated of three facets: 1) program context, 2) evaluator skills, and 3) evaluation methods. This class is designed to illustrate how these three facets connect when designing an evaluation that is theoretically grounded, feasible, and useful.", "recommended_prep": "", "professor": "AZZAM", "college": "GGSE"},
"ED 227": {"number": "227", "sub_dept": "ED", "title": "Mixed Methods", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "This course provides an overview of mixed methods research and consists of defining mixed methods research, describing its history and foundations. We examine the types of mixed methods designs available along with how and when to utilize them.", "recommended_prep": "", "professor": "AZZAM</span> <i>", "college": "GGSE"},
"ED 228A": {"number": "228A", "sub_dept": "ED", "title": "Learners with Severe Disabilities: Skills Instruction", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Learning and motivational characteristics, assessments for screening,  diagnosis, instructional planning, and functional analysis of behavioral problems. Procedures for teaching functional skills and recent research  arecovered.", "recommended_prep": "", "professor": "MORRISON, SINGER", "college": "GGSE"},
"ED 228B": {"number": "228B", "sub_dept": "ED", "title": "Learners with Severe Disabilities: Communication", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Teaching and research on instruction of communication and language   competence and social competance. Research theory, and instructional   practice are covered. The course is designed for masters and doctoral  students.", "recommended_prep": "", "professor": "MORRISON, SINGER", "college": "GGSE"},
"ED 228C": {"number": "228C", "sub_dept": "ED", "title": "Learners with Severe Disabilities: Functional Academics and Inclusion", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Functional academics and social academics as well as managerial aspects of inclusion. Along with practical skills, students learn key theories and  review recent research on social and academic inclusion.", "recommended_prep": "", "professor": "MORRISON, SINGER", "college": "GGSE"},
"ED 228D": {"number": "228D", "sub_dept": "ED", "title": "Direct Instruction and Strategy Instruction", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Theory, practice, effectiveness and controversy. Two of the major    research-based approaches to teaching academic skills to students with   learning disabilities are covered.", "recommended_prep": "", "professor": "SINGER", "college": "GGSE"},
"ED 228E": {"number": "228E", "sub_dept": "ED", "title": "Families and Disabilities", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "An overview of theories about the family, contemporary research regarding  family issues, and home-school interactions. Designed for doctoral   students who are interested in research and masters students who want to learn practical school-related methods.", "recommended_prep": "", "professor": "COSDEN, SINGER", "college": "GGSE"},
"ED 228F": {"number": "228F", "sub_dept": "ED", "title": "Topics in Family and Disability Research", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Focus on one important aspect of family life among families of children  with disabilities. Research study on selected topics. Best suited for  doctoral students.", "recommended_prep": "", "professor": "COSDEN, SINGER", "college": "GGSE"},
"ED 228H": {"number": "228H", "sub_dept": "ED", "title": "Working with Stakeholders in Special Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Provides special educators with information and skills for working with themany stakeholders in special education. Content includes how to    communicate with parents, administrators, paraprofessionals, and teachers.", "recommended_prep": "", "professor": "GERBER, SINGER", "college": "GGSE"},
"ED 228I": {"number": "228I", "sub_dept": "ED", "title": "Assessment Issues in Special and Inclusive Education", "dept": "ED", "prereqs": [["ED 222A"]], "prereq_description": "ED 222A; or an equivalent course on Intro to Special Education", "comments": "", "units": "4", "description": "Introduces measurement principles and procedures and application of norm referenced, criterion referenced, and classroom-based assessments for  students with disabilities. It also presents procedures for designing, selecting, administering, scoring and interpreting various informal  assessment measures in schools.", "recommended_prep": "", "professor": "WANG, GERBER", "college": "GGSE"},
"ED 228J": {"number": "228J", "sub_dept": "ED", "title": "Individualized Education Programs, Assessment, and Transitions in Special Education", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "This course provides special educators applied and background knowledge in Individualized Education Programs for students with disabilities in schools, as well as information on related issues of assessment and transitions.", "recommended_prep": "", "professor": "SINGER, FEDDERS</span> <i>", "college": "GGSE"},
"ED 228K": {"number": "228K", "sub_dept": "ED", "title": "Including Students with Disabilities in Meaningful Mathematics", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "1-4", "description": "Designed for teacher candidates in special education.  Topics include: socioemotional and identity development in mathematics; developmental sequence, how children learn mathematics; standards for mathematical practice; instructional routines; intervention in mathematics.", "recommended_prep": "", "professor": "LAMBERT</span> <i>", "college": "GGSE"},
"ED 228L": {"number": "228L", "sub_dept": "ED", "title": "Psychoeducational Assessment for Teachers", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Course topics include: procedures to assess academic achievement, psycho-perceptual processes, and environmental factors; assessing core academic skills; how to communicate a variety of tests used to measure academic achievement; making data-based decisions to evaluate or develop academic programs or interventions.", "recommended_prep": "", "professor": "MORAN</span> <i>", "college": "GGSE"},
"ED 228M": {"number": "228M", "sub_dept": "ED", "title": "Research in Teaching, Learning, and Assessment in Special Education I", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Students explore research in teaching, learning and assessment in educational research with a focus on students with Extensive Support Needs, such as intellectual disabilities, traumatic-brain injury, Cerebral Palsy, Autism, Downs Syndrome, and other developmental disabilities.", "recommended_prep": "", "professor": "FEDDERS, WANG</span> <i>", "college": "GGSE"},
"ED 228N": {"number": "228N", "sub_dept": "ED", "title": "Research in Teaching, Learning, and Assessment in Special Education II", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Students will explore research in teaching, learning and assessment in educational research with a focus on students with disabilities such as learning disabilities/dyslexia, Attention Deficit Hyperactivity Disorder, speech and language, and emotional disabilities.", "recommended_prep": "", "professor": "LAMBERT, MORAN</span> <i>", "college": "GGSE"},
"ED 229C": {"number": "229C", "sub_dept": "ED", "title": "Practicum in Special Education Programs for Severely Handicapped Pupils", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "2-12", "description": "Supervised field-based practicum in instruction and management of special  education programs for severely handicapped pupils.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 229D": {"number": "229D", "sub_dept": "ED", "title": "Applied Systematic Instruction and Assessment", "dept": "ED", "prereqs": [["ED 229C"]], "prereq_description": "Concurrent enrollment in Education 229C or Education E392; consent of instructor.", "comments": "", "units": "2-4", "description": "Students read research and best practice studies, discuss current work in practicum placements, and develop documentation of performance and knowledge competencies.", "recommended_prep": "", "professor": "HOLDREN", "college": "GGSE"},
"ED 230": {"number": "230", "sub_dept": "ED", "title": "Developmental Behavioral Genetics", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Overview of the field of developmental behavioral genetics.  Topics    include basic principles of genetics, mechanisms of genetic transmission,  chromosomal abnormalities, behavioral genetic methodologies, and the   genetics of specific behavioral disorders in children and adults.", "recommended_prep": "", "professor": "HO, GERBER", "college": "GGSE"},
"ED 236C": {"number": "236C", "sub_dept": "ED", "title": "Research Methods and Practice: Case Studies", "dept": "ED", "prereqs": [], "prereq_description": "Ph.D. or Ed.D students who have completed at least two quarters of", "comments": "Not open for credit to students who have completed Education 249B.", "units": "4", "description": "Focuses on case study methodology as one form of qualitative research  design. Students learn the different types of case studies and the value of using a multiple case design. The course also provides students with  the tools for preparing their dissertation proposal. Meets research    requirements for ELO and ASC Tier II.", "recommended_prep": "", "professor": "CHRISPEELS, CONLEY", "college": "GGSE"},
"ED 240A": {"number": "240A", "sub_dept": "ED", "title": "Education Policy", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "An introduction to education policy that will examine both the process of  education policy and a series of substantive issues that are commonly the  focus of education policy at the state and federal levels.", "recommended_prep": "", "professor": "RUMBERGER", "college": "GGSE"},
"ED 241": {"number": "241", "sub_dept": "ED", "title": "Economics of Education", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Covers the following topics: supply/demand in education; the role of   human capital; production, costs, and financing of education; teachers and teacher labor markets; education markets, school choice, and   incentives.", "recommended_prep": "", "professor": "GOTTFRIED</span> <i>", "college": "GGSE"},
"ED 242A": {"number": "242A", "sub_dept": "ED", "title": "Organizational Theories", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Survey of prominent theories about how organization function, how and why  some organizations flourish while others might flounder, how organizations encourage as well as discourage innovation and creativity, and how   different theories project different realities about organizations.", "recommended_prep": "", "professor": "CONLEY", "college": "GGSE"},
"ED 242B": {"number": "242B", "sub_dept": "ED", "title": "Small Groups in Education and Other Workplace Settings", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Explores observational methods and small group analysis. Provides    insight into the range of methods, the thinking behind individual    methods, the issues addressed by different methods, research agendas   that developed as a result, and implications for social research in  educational settings.", "recommended_prep": "", "professor": "CONLEY, COOK-GUMPERZ", "college": "GGSE"},
"ED 242C": {"number": "242C", "sub_dept": "ED", "title": "Theories of Organizational Change and Development", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "Not open for credit to students who have completed Education 261B.", "units": "4", "description": "An overview of organizational change and development theories, with    special focus on the concepts of organizational complexity and learning  andthe problems of change. Students analyze and apply theories through   class papers and projects.", "recommended_prep": "", "professor": "CHRISPEELS, WEISSGLASS", "college": "GGSE"},
"ED 243": {"number": "243", "sub_dept": "ED", "title": "The Social Side of School: From Principles and Practices to Policies", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Students will apply social psychological theories and principles to personally relevant settings to develop or adapt practices that help improve student or educator outcomes. Then they devise ways of evaluating the efficacy of these new practices.", "recommended_prep": "", "professor": "GEHLBACH</span> <i>", "college": "GGSE"},
"ED 245A": {"number": "245A", "sub_dept": "ED", "title": "Educational Finance", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "An introduction to the financing of education at the school, district,   county, state, and federal levels. Emphasis will be given to the economic  foundations of school financing.", "recommended_prep": "", "professor": "GLASMAN", "college": "GGSE"},
"ED 246C": {"number": "246C", "sub_dept": "ED", "title": "Testing Students", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Introduction to student testing with special emphasis on three major   schools - measurement, evaluation, assessment.", "recommended_prep": "", "professor": "BLOCK", "college": "GGSE"},
"ED 247A": {"number": "247A", "sub_dept": "ED", "title": "Educational Leadership", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Systematic analysis of the antecedents and consequences of administrator behavior in a variety of educational settings.", "recommended_prep": "", "professor": "GLASMAN", "college": "GGSE"},
"ED 250A": {"number": "250A", "sub_dept": "ED", "title": "Doctoral Seminar in Policy and Leadership", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "A seminar for post-comprehensive exam students with the intent of    helping to define areas, problems, specific questions, and methodologies for doctoral research. Topics and instructors may vary from quarter to quarter.", "recommended_prep": "", "professor": "GOTTFRIED, CONLEY", "college": "GGSE"},
"ED 250B": {"number": "250B", "sub_dept": "ED", "title": "Doctoral Seminar in Policy and Leadership", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "A seminar for post-comprehensive exam students with the intent of    helping to define areas, problems, specific questions, and methodologies for doctoral research. Topics and instructors may vary from quarter to quarter.", "recommended_prep": "", "professor": "GOTTFRIED", "college": "GGSE"},
"ED 250C": {"number": "250C", "sub_dept": "ED", "title": "Doctoral Seminar in Policy and Leadership", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "A seminar for post-comprehensive exam students with the intent of    helping to define areas, problems, specific questions, and methodologies for doctoral research. Topics and instructors may vary from quarter to quarter.", "recommended_prep": "", "professor": "GOTTFRIED", "college": "GGSE"},
"ED 253D": {"number": "253D", "sub_dept": "ED", "title": "Seminar in Teaching and Learning", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "May be repeated.", "units": "1-6", "description": "In-depth consideration of emerging topics in teaching and learning. Course content may vary.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 256": {"number": "256", "sub_dept": "ED", "title": "Technology and Learning Contexts", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Critical consideration of research on how technology  changes the learning context. Specifically, issues about how technology may be used to    facilitate student learning and  challenges to integrating technology.", "recommended_prep": "", "professor": "HARLOW, GREEN", "college": "GGSE"},
"ED 257A": {"number": "257A", "sub_dept": "ED", "title": "Learning and Teaching with Digital Media for Adult Learners", "dept": "ED", "prereqs": [["ED 257B"]], "prereq_description": "Graduate Standing. This course is a prerequisite to Ed 257B.", "comments": "", "units": "4", "description": "Examination of educational rationales for the design of hypermedia   applications. Students evaluate existing programs and apply principles of learning with media to the development of their own projects using  tools to acquire and manipulate text, images, sound and video.", "recommended_prep": "", "professor": "CHUN, MICHAELS", "college": "GGSE"},
"ED 257B": {"number": "257B", "sub_dept": "ED", "title": "Learning and Teaching with Digital Media for Adult Learners", "dept": "ED", "prereqs": [["ED 257A"]], "prereq_description": "Graduate Standing and Ed 257A.", "comments": "", "units": "4", "description": "Continuation of Ed 257A. Further investigation of teaching and learning  with media, design of hypermedia applications, and evaluation of their usability and effectiveness.", "recommended_prep": "", "professor": "CHUN, MICHAELS", "college": "GGSE"},
"ED 258A": {"number": "258A", "sub_dept": "ED", "title": "Seminar in Curriculum: Literacy", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Recent developments, review, and evaluation of current research in   curriculum is explored.", "recommended_prep": "", "professor": "DIXON", "college": "GGSE"},
"ED 258B": {"number": "258B", "sub_dept": "ED", "title": "Seminar in Curriculum: Mathematics", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Examination of mathematics curricula from several points of view:    historical, theoretical, and in practice. Special attention will be given  to comparing curricula advocated by the reform movement to curricula   currently used in schools.", "recommended_prep": "", "professor": "BIANCHINI, BRENNER", "college": "GGSE"},
"ED 258D": {"number": "258D", "sub_dept": "ED", "title": "Seminar in Curriculum: Science", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "The course covers the review and evaluation of recent developments in  curriculum development and research in science.", "recommended_prep": "", "professor": "BIANCHINI, KELLY", "college": "GGSE"},
"ED 258J": {"number": "258J", "sub_dept": "ED", "title": "Seminar in Curriculum: Development and Analysis", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "This seminar examines past and current research on curriculum in K-12  education. It discusses curriculum theory, development, analysis, and  implementation - in light of the history of education and current reform movements.", "recommended_prep": "", "professor": "BIANCHINI</span> <i>", "college": "GGSE"},
"ED 259": {"number": "259", "sub_dept": "ED", "title": "Technology and Second Language Acquisition: Adolescents and Adults", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Examines research on the theory and practice of using digital media and  the Internet for teaching and learning second languages and cultures;  discusses principles for the design and development of multimedia    courseware.", "recommended_prep": "", "professor": "CHUN</span> <i>", "college": "GGSE"},
"ED 261": {"number": "261", "sub_dept": "ED", "title": "Language and Culture in Teaching and Learning", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject", "comments": "", "units": "4", "description": "Explores the effect of language, culture, background, and values on    learning processes and the implications for the development of appropriate instructional strategies.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 263": {"number": "263", "sub_dept": "ED", "title": "Adolescent Development and Learning", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of instructor.", "comments": "", "units": "4", "description": "An introduction to psychological principles of learning and development of the adolescent. Explores dimensions of development indicative of adolescence, and the ways in which development and learning are interwoven with social and cultural contexts in the educative process.", "recommended_prep": "", "professor": "MORAN", "college": "GGSE"},
"ED 264": {"number": "264", "sub_dept": "ED", "title": "Child Development and Learning", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject Credential Program.", "comments": "", "units": "4", "description": "An introduction to psychological principles of learning and development of the elementary age child. Explores dimensions of development indicative of middle childhood, and ways in which development and learning are interwoven with social and cultural contexts in the educative process.", "recommended_prep": "", "professor": "OXELSON, DUQUE, HARVEY", "college": "GGSE"},
"ED 264C": {"number": "264C", "sub_dept": "ED", "title": "Behavioral Assessment and Intervention for Children and Adolescents", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "History and philosophy of behavior management approaches, behavioral assessment procedures, treatment delivery paradigms, parent-training, nonaversive/aversive issues, generalization and maintenance of treatment gains, causes, evaluation of behavior changes, medicine, self-management.", "recommended_prep": "", "professor": "FEDDERS", "college": "GGSE"},
"ED 265A": {"number": "265A", "sub_dept": "ED", "title": "Foundation of Teacher Inquiry", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject Credential", "comments": "", "units": "1-4", "description": "An introduction to teacher inquiry for professional growth. Topics include: the relationship between teacher inquiry and classroom practice, systematic data analysis, visual representation of findings and writing for research purposes.", "recommended_prep": "", "professor": "DUQUE", "college": "GGSE"},
"ED 265B": {"number": "265B", "sub_dept": "ED", "title": "Teacher Inquiry and Classroom Practice I", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject Credential", "comments": "", "units": "1-4", "description": "Teacher candidates work on an independent inquiry into classroom practice. Students will refine a research topic, plan and perform multiple layers of data collection and analysis, work in critical research groups, and prepare a final written report.", "recommended_prep": "", "professor": "DUQUE", "college": "GGSE"},
"ED 265C": {"number": "265C", "sub_dept": "ED", "title": "Teacher Inquiry and Classroom Practice II", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject Credential", "comments": "", "units": "1-4", "description": "Teacher candidates work on an independent inquiry into classroom practice. Students will refine a research topic, plan and perform multiple layers of data collection and analysis, work in critical research groups, and prepare a final written report.", "recommended_prep": "", "professor": "DUQUE", "college": "GGSE"},
"ED 265D": {"number": "265D", "sub_dept": "ED", "title": "Teacher Inquiry and Classroom Practice III", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject", "comments": "", "units": "6", "description": "Teacher candidates work on an independent inquiry into classroom   practice. Students will refine a research topic, plan and perform    multiple layers of data collection and analysis, work in critical    research groups, and prepare a final written report.", "recommended_prep": "", "professor": "RALEY", "college": "GGSE"},
"ED 266": {"number": "266", "sub_dept": "ED", "title": "Special Topics in the Teaching Profession", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "1-4", "description": "This course allows for more in-depth and advanced investigations into educative processes that build on prior learning in the Teacher Education program's foundations courses, methods courses, and student teaching.", "recommended_prep": "", "professor": "SLOAN", "college": "GGSE"},
"ED 268": {"number": "268", "sub_dept": "ED", "title": "Foundations of Teaching", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject Credential Program.", "comments": "", "units": "4", "description": "Students develop a rigorous way of thinking about, talking about and practicing education for a diverse society. Explores the complex relationship among culture, society and school organization. Considers complex relations among teachers and learners within U.S. schools.", "recommended_prep": "", "professor": "DUQUE, OXELSON, HARVEY", "college": "GGSE"},
"ED 270A": {"number": "270A", "sub_dept": "ED", "title": "Classrooms as Cultures", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "This course examines classrooms as cultures and over views anthropological studies of classroom processes to identify factors that support and/or   constrain learning in classrooms. Topics to be explored include: classroom discourse, school culture, peer culture, and situated learning.", "recommended_prep": "", "professor": "GREEN", "college": "GGSE"},
"ED 270B": {"number": "270B", "sub_dept": "ED", "title": "Second Language Teaching Methodologies: Adolescents and Adults", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Provides an overview of the basic theoretical principles of second   language acquisition (SLA) as they apply to a second language teaching and learning. We discuss different methodologies of foreign/second   language teaching and the history of the U.S.", "recommended_prep": "", "professor": "CHUN, LEE</span> <i>", "college": "GGSE"},
"ED 270C": {"number": "270C", "sub_dept": "ED", "title": "Race and Ethnicity in American Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Offers a historical overview of minority education in our public schools with emphasis on urban multi-ethnic student populations and their    struggle for educational equity. A research paper is required.", "recommended_prep": "", "professor": "WEISSGLASS", "college": "GGSE"},
"ED 270E": {"number": "270E", "sub_dept": "ED", "title": "Perspectives on Educational Language Policy", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Examination of the implicit and explicit language policies surrounding   bilingual and ESL education and their implications for language minorities in schools and the workplace. Issues concerning language attitudes,    language loyalty, language maintenance, identity, and power are also   discussed.", "recommended_prep": "", "professor": "LEE, KYRATZIS", "college": "GGSE"},
"ED 270F": {"number": "270F", "sub_dept": "ED", "title": "Second Langage Learning in Educational Contexts", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Overview of linguistic, psychological, cognitive, and sociocultural    approaches to second language acquisition. Students will critically review past and current SLA theories and research and develop an understanding of how language proficiency is conceptualized and assessed.", "recommended_prep": "", "professor": "DIXON, LEE", "college": "GGSE"},
"ED 270G": {"number": "270G", "sub_dept": "ED", "title": "Structures of Inequality: Race and Class in Education", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Segregation, differential school quality, and inequitable educational  outcomes do not happen in a vacuum. This class examines issues in    education which are directly related to race and class in understanding  how ideology informs the way we look at schooling.", "recommended_prep": "", "professor": "YUN, DURAN</span> <i>", "college": "GGSE"},
"ED 270H": {"number": "270H", "sub_dept": "ED", "title": "Language, Culture &amp; Learning", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Explores the effect of language, culture, background, and values on    learning processes and the implications for development of appropriate   instructional strategies.", "recommended_prep": "", "professor": "LEE", "college": "GGSE"},
"ED 271": {"number": "271", "sub_dept": "ED", "title": "Cultural Studies in Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Critically explore media and popular arts' cultural influences on everyday life, including books/popular literature, music, visual arts, and    architecture. Consider the importance of these cultural forms for    education and community life.", "recommended_prep": "", "professor": "COOK-GUMPERZ, BRENNER", "college": "GGSE"},
"ED 272": {"number": "272", "sub_dept": "ED", "title": "", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Course will provide a discussion of different models of education and  their impact on changing societies and educational needs. This is a    research seminar and will serve as an introduction for new students to the emphasis on Cultural perspective of Education and Comparative Education.", "recommended_prep": "", "professor": "COOK-GUMPERZ", "college": "GGSE"},
"ED 274": {"number": "274", "sub_dept": "ED", "title": "Proseminar in Language, Interaction and Social Organization", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "May be repeated for credit. Same course as Sociology 274and Linguistics  274.", "units": "2-4", "description": "Discussion of current research, literature, and theoretical and    methodological issues in language and social interaction.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 275": {"number": "275", "sub_dept": "ED", "title": "Research on the Education of Asian/American Students", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Examines the research on the education and development of Asian and Asian  American students.  Topics include: student motivation and achievement,  engagement, aspirations, career choices, acculturation, culture and    identity, collectivism/individualism, parent involvement, home-school  connection, and comparative educational systems.", "recommended_prep": "", "professor": "HO, OKAMOTO", "college": "GGSE"},
"ED 276": {"number": "276", "sub_dept": "ED", "title": "Immigrant Education and Literacy Development", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "This course covers recent theories, empirical research, and strategic  interventions in the area of immigrant education with special attention to sociocultural, critical pedagogy, and new literacies approaches to   learning and development of immigrant adults and youths.", "recommended_prep": "", "professor": "DURAN, ROMO</span> <i>", "college": "GGSE"},
"ED 277": {"number": "277", "sub_dept": "ED", "title": "Latino Children and Their Families", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "This course will provide an overview of the normative development and  challenges experienced by Latino children and adolescents in the United  States underscoring the importance of contexts- families, schools,   communities.", "recommended_prep": "", "professor": "DURAN, ROMO</span> <i>", "college": "GGSE"},
"ED 279": {"number": "279", "sub_dept": "ED", "title": "Foundations of Teacher Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Course for Ph.D. candidates in Education with a focus on pre-service and in-service teacher development. Students read professional literature, research and hear from those doing the work of teacher educators.", "recommended_prep": "", "professor": "SLOAN, DEWAR", "college": "GGSE"},
"ED 280": {"number": "280", "sub_dept": "ED", "title": "Education in Diverse Societies", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Explores various critical approaches to the theory and practice of   crosscultural education in diverse societies.", "recommended_prep": "", "professor": "RALEY", "college": "GGSE"},
"ED 281A": {"number": "281A", "sub_dept": "ED", "title": "Teacher Education Research Practicum", "dept": "ED", "prereqs": [["ED 210"]], "prereq_description": "ED 210", "comments": "", "units": "2-4", "description": "A year-long practicum for doctoral candidates interested in conducting research on teacher education practice. Students will work with UCSB's teacher education program leaders and faculty to design and implement a study of practice in the teacher education program.", "recommended_prep": "", "professor": "SLOAN, DUQUE, DEWAR, FEDDERS", "college": "GGSE"},
"ED 281B": {"number": "281B", "sub_dept": "ED", "title": "Teacher Education Research Practicum", "dept": "ED", "prereqs": [["ED 210"], ["ED 281A"]], "prereq_description": "ED 210, ED 281A", "comments": "", "units": "2-4", "description": "A year-long practicum for doctoral candidates interested in conducting research on teacher education practice. Students will work with UCSB's teacher education program leaders and faculty to design and implement a study of practice in the teacher education program.", "recommended_prep": "", "professor": "SLOAN, DUQUE, DEWAR, FEDDERS", "college": "GGSE"},
"ED 281C": {"number": "281C", "sub_dept": "ED", "title": "Teacher Education Research Practicum", "dept": "ED", "prereqs": [["ED 210"], ["ED 281A"], ["ED 281B"]], "prereq_description": "ED 210, ED 281A, ED 281B", "comments": "", "units": "2-4", "description": "A year-long practicum for doctoral candidates interested in conducting research on teacher education practice. Students will work with UCSB's teacher education program leaders and faculty to design and implement a study of practice in the teacher education program.", "recommended_prep": "", "professor": "SLOAN, DUQUE, DEWAR, FEDDERS", "college": "GGSE"},
"ED 282": {"number": "282", "sub_dept": "ED", "title": "Research Along the Learning to Teach Continuum: Teacher Education,   Induction, and Professional Development", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Examines research on teacher education and professional development.   Course explores theories of teacher learning, standards for teacher    education, teacher education and professional development models, research on teacher professional communities, and enduring challenges faced by  teacher educators.", "recommended_prep": "", "professor": "BIANCHINI", "college": "GGSE"},
"ED 283A": {"number": "283A", "sub_dept": "ED", "title": "Seminar in Teacher Education and Professional Development", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "2", "description": "Designed to provide opportunities for students to explore issues in  teacher education and professional development of beginning and/or   experienced teachers or other professionals (i.e., counselors,     administrators, etc.).", "recommended_prep": "", "professor": "SLOAN</span> <i>", "college": "GGSE"},
"ED 283B": {"number": "283B", "sub_dept": "ED", "title": "Internship in Teacher Education and Professional Development", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instuctor.", "comments": "May be repeated for credit.", "units": "2", "description": "Provides students with opportunities to gain practical experience in   teacher education and professional development broadly defined.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 284": {"number": "284", "sub_dept": "ED", "title": "Teacher Learning and Knowing", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Provides students the opportunity to develop a coherent conceptual   framework for their study of teaching. Course considers several ways of  understanding the relationship between knowledge and practice, with    special attention to learning as the transformation of this relationship.  Approaches used to examine current efforts to improve the quality of   teaching.", "recommended_prep": "", "professor": "RALEY, COPELAND", "college": "GGSE"},
"ED 286C": {"number": "286C", "sub_dept": "ED", "title": "Learning Theories and Instructional Practices in STEM", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Exploration of contemporary theories of learning and instruction in science education. Students examine and critique research on constructivism, groupwork, inquiry, project-based science, multicultural science education and science-technology-society approaches.", "recommended_prep": "", "professor": "BIANCHINI, HARLOW", "college": "GGSE"},
"ED 286ST": {"number": "286ST", "sub_dept": "ED", "title": "The History, Philosophy and Sociology of Science in Science Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Exploration of the nature of science--what science is, how scientific  knowledge is constructed, and how science and society interact--as well as ways to teach the nature of science to students. Primarily for pre-service science teachers.", "recommended_prep": "", "professor": "BIANCHINI", "college": "GGSE"},
"ED 287": {"number": "287", "sub_dept": "ED", "title": "Research in Informal STEM Education", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "The goals of this class are to introduce students to issues and research in informal science education (specifically museums), provide opportunities to develop research skills, engage in a research-practice partnership, and produce publishable research.", "recommended_prep": "", "professor": "HARLOW</span> <i>", "college": "GGSE"},
"ED 289": {"number": "289", "sub_dept": "ED", "title": "Professional Development Seminar for M.Ed. Facilitators", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor; students must be serving as an M.Ed. Facilitator", "comments": "", "units": "2", "description": "Seminar supports facilitators in their work with M.Ed. candidates. Course  examines ways to guide candidates in writing theoretical frameworks,   collecting and analyzing their data, and providing feedback to one   another. Readings include research literature and samples of candidates' work.", "recommended_prep": "", "professor": "BIANCHINI", "college": "GGSE"},
"ED 291": {"number": "291", "sub_dept": "ED", "title": "Professional Issues in Severe Developmental Disabilities", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "2", "description": "Study of professional issues and development of projects in the areas of clinical work with children and families, experimental analyses of severe behavior problems, preparation of articles for publication, organization ofnational conventions and grant writing.", "recommended_prep": "", "professor": "FEDDERS", "college": "GGSE"},
"ED 292A": {"number": "292A", "sub_dept": "ED", "title": "Mathematics Development in Early Years", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Explores how pre-school and early elementary school children acquire early logical and mathematical understanding. The acquisition of: counting,  cardinal, and ordinal understanding, mathematical operations, and the  representations of mathematical ideas by children will be addressed.", "recommended_prep": "", "professor": "OKAMOTO", "college": "GGSE"},
"ED 292B": {"number": "292B", "sub_dept": "ED", "title": "Mathematics Development in Middle Years", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "This course looks at how elementary school children learn mathematics in specific topical areas such as word problems and rational numbers.   Implications for instruction will be discussed.", "recommended_prep": "", "professor": "BRENNER", "college": "GGSE"},
"ED 292C": {"number": "292C", "sub_dept": "ED", "title": "Mathematics Development in Adolescents", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "This course examines mathematical problem solving at the secondary and   college level. Different approaches to problem solving will be discussed interms of the relevant theories, mathematics curricula and instructional  delivery.", "recommended_prep": "", "professor": "BRENNER", "college": "GGSE"},
"ED 293": {"number": "293", "sub_dept": "ED", "title": "Equity in STEM", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "Investigation of mathematics instructions and achievements from a cross-national perspective. Both formal and informal mathematics applications will be reviewed. Sources of information will include the International Education Assessment (IEA) studies of mathematics as well as sources from anthropology, sociology, and educational journals.", "recommended_prep": "", "professor": "BRENNER, OKAMOTO", "college": "GGSE"},
"ED 294": {"number": "294", "sub_dept": "ED", "title": "Seminar in Special Education, Disabilities, and Risk Studies", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "1-6", "description": "In-depth consideration of emerging topics in special education,    disabilities, and risk studies. Course content may vary.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 312": {"number": "312", "sub_dept": "ED", "title": "Context for Child Development and Learning", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject", "comments": "", "units": "2", "description": "Prepares teacher candidates to create a supportive and healthy learning environment for student learning. Helps candidates learn how personal, family, school, community, and other contexts are related to student's academic, physical, emotional, and social well-being.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 313": {"number": "313", "sub_dept": "ED", "title": "Context for Adolescent Development and Learning", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "2", "description": "Prepares teacher candidates to create a supportive and healthy learning environment for student learning. Helps candidates learn how personal, family, school, community, and other contexts are related to student's academic, physical, emotional, and social well-being.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 314": {"number": "314", "sub_dept": "ED", "title": "Linguistics for Elementary and ESC Teachers", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "2", "description": "Foundational course introduces beginning credential candidates to the  structure of the English language (Phonology, Morphology, Syntax and   Semantics).  The course also provides the opportunity to understand the  classroom implications for Pragmatics and Discourse, as well as linguistic variation.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 317": {"number": "317", "sub_dept": "ED", "title": "Historical Thinking", "dept": "ED", "prereqs": [], "prereq_description": "Admission to the Single Subject Program or the Multiple Subject Program.", "comments": "Quarters usually offered: Spring.", "units": "4", "description": "Provides future history teachers with an opportunity to explore the nature of history, to investigate the interdisciplinary aspects of the subject, and to develop their own concepts of historical thinking and historical empathy.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 318": {"number": "318", "sub_dept": "ED", "title": "Foundations of Academic Language: Elementary", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject Credential Program.", "comments": "", "units": "2", "description": "This foundational course introduces beginning credential candidates to the structure of the English language (phonology, morphology, syntax and semantics). The course also provides the opportunity to understand the classroom implications for pragmatics and discourse, as well as linguistic variation.", "recommended_prep": "", "professor": "SCALZO, ARYA", "college": "GGSE"},
"ED 319": {"number": "319", "sub_dept": "ED", "title": "Foundations in Academic Language: Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of instructor.", "comments": "", "units": "2", "description": "This foundational course introduces beginning credential candidates to the structure of the English language (phonology, morphology, syntax and semantics). The course also provides the opportunity to understand that classroom implications form pragmatics and discourse, as well as linguistics variation.", "recommended_prep": "", "professor": "SCALZO, ARYA", "college": "GGSE"},
"ED A  321F": {"number": "A  321F", "sub_dept": "ED", "title": "Secondary Visual Art Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "3", "description": "Development of pedagogical content knowledge, methods, curriculum design,  research, and theory related to teaching and learning visual arts at the secondary level.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED A  321M": {"number": "A  321M", "sub_dept": "ED", "title": "Secondary Visual Arts Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1", "description": "Development of pedagogical content knowledge, methods, curriculum design,  research, and theory related to teaching and learning visual arts at the secondary level.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED M  320": {"number": "M  320", "sub_dept": "ED", "title": "Elementary Mathematics Teaching Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1-4", "description": "The application of research and theory to classroom practice in the teaching of mathematics.", "recommended_prep": "", "professor": "CARLYLE", "college": "GGSE"},
"ED S  320": {"number": "S  320", "sub_dept": "ED", "title": "Elementary Science Teaching Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1-4", "description": "An application of research and theory to classroom practice in the teaching of science.", "recommended_prep": "", "professor": "HARLOW", "college": "GGSE"},
"ED E  321": {"number": "E  321", "sub_dept": "ED", "title": "Secondary English/Language Arts Methods", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "4", "description": "Development of pedagogical content knowledge, methods, curriculum design, research, and theory related to teaching and learning English Language Arts at the secondary level.", "recommended_prep": "", "professor": "DEWAR", "college": "GGSE"},
"ED HSS321": {"number": "HSS321", "sub_dept": "ED", "title": "Secondary History/Social Science Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "4", "description": "Development of pedagogical content knowledge, methods, curriculum design, research, and theory related to teaching and learning History/Social Science at the secondary level.", "recommended_prep": "", "professor": "ESTABROOK, MULLIN", "college": "GGSE"},
"ED IA 321": {"number": "IA 321", "sub_dept": "ED", "title": "Secondary Industrial Technology Methods", "dept": "ED", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Teacher candidates will experience, discuss, research, and practice a variety of teaching methods for technology arts.", "recommended_prep": "", "professor": "HARLOW</span> <i>", "college": "GGSE"},
"ED M  321": {"number": "M  321", "sub_dept": "ED", "title": "Secondary Mathematics Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "4", "description": "Development of pedagogical content knowledge, methods, curriculum design, research, and theory related to teaching and learning Mathematics at the secondary level.", "recommended_prep": "", "professor": "OGRAIN; ROBERTS", "college": "GGSE"},
"ED S  321": {"number": "S  321", "sub_dept": "ED", "title": "Secondary Science Methods", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "4", "description": "Development of pedagogical content knowledge, methods, curriculum design, research, and theory related to teaching and learning Science at the secondary level.", "recommended_prep": "", "professor": "LOHWASSER, BIANCHINI", "college": "GGSE"},
"ED WL 321": {"number": "WL 321", "sub_dept": "ED", "title": "Secondary World Language Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "4", "description": "Development of pedagogical content knowledge, methods, curriculum design, research, and theory related to teaching and learning world language at the secondary level.", "recommended_prep": "", "professor": "ARYA", "college": "GGSE"},
"ED 322": {"number": "322", "sub_dept": "ED", "title": "Instructional Design for Elementary Teachers", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple Credential Program.", "comments": "", "units": "1-4", "description": "Introduces teacher candidate to concepts of effective curriculum development including lesson design and assessment as part of the teach-assess-reflect cycles. Also prepares and supports candidates for the Performance Assessment of California Teachers (PACT).", "recommended_prep": "", "professor": "WHITAKER, MISHLER, HARVEY", "college": "GGSE"},
"ED 323F": {"number": "323F", "sub_dept": "ED", "title": "Instructional Design for Secondary Teachers", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "1-4", "description": "Introduces teacher candidates to concepts of effective curriculum development including lesson design and assessment as part of the teach-assess-reflect cycles. Also prepares and supports candidates for the Performance Assessment of California Teachers (PACT).", "recommended_prep": "", "professor": "SLOAN, HARVEY", "college": "GGSE"},
"ED 323W": {"number": "323W", "sub_dept": "ED", "title": "Instructional Design for Secondary Teachers", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of instructor.", "comments": "", "units": "3", "description": "Introduces teacher candidates to concepts of effective curriculum development including lesson design and assessment as part of the teach-assess-reflect cycles. Also prepares and supports candidates for the Performance Assessment of California Teachers (PACT).", "recommended_prep": "", "professor": "HARVEY", "college": "GGSE"},
"ED E  321M": {"number": "E  321M", "sub_dept": "ED", "title": "Secondary English/Language Arts Methods", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "2", "description": "Development of pedagogical content knowledge, methods, curriculum design, research, and theory related to teaching and learning English Language Arts at the secondary level.", "recommended_prep": "", "professor": "LOWI", "college": "GGSE"},
"ED 324": {"number": "324", "sub_dept": "ED", "title": "Instructional Technology: Elementary", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject", "comments": "", "units": "1-4", "description": "Exploration of issues related to use of computer-based technologies in schools,  including their access, use and control in a democratic society; their use for development of problem solving, critical thinking, and creativity; and their integration into the school curriculum.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 325": {"number": "325", "sub_dept": "ED", "title": "Instructional Technology: Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "1-4", "description": "Exploration of issues related to use of computer-based technologies in schools, including those of their access, use, and control in a democratic society; use for development of problem solving, critical thinking, and creativity; and integration into the school curriculum.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 325A": {"number": "325A", "sub_dept": "ED", "title": "Application of Computers to Educational Purposes I: Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program.", "comments": "", "units": "2", "description": "Exploration of issues related to use of computer-based technologies in schools, including those of their access, use, and control in a    democratic society; use for development of problem solving, critical   thinking, and creativity; and integration into the school curriculum - Part I (see ED 325B for Part II).", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 325B": {"number": "325B", "sub_dept": "ED", "title": "Application of Computers to Educational Purposes II: Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program.", "comments": "", "units": "2", "description": "Exploration of issues related to use of computer-based technologies in schools, including those of their access, use, and control in a    democratic society; use for development of problem solving, critical   thinking, and creativity; and integration into the school curriculum - Part II (see ED 325A for Part I).", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 326": {"number": "326", "sub_dept": "ED", "title": "Practicum in Classroom Management: Elementary", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject", "comments": "", "units": "2", "description": "Designed to raise awareness of often-transparent classroom management strategies to help teacher candidates facilitate learning among students with diverse backgrounds and learning needs. Learn research-based strategies that assist in building positive classroom atmospheres and more productive classroom observations.", "recommended_prep": "", "professor": "WHITAKER", "college": "GGSE"},
"ED 327": {"number": "327", "sub_dept": "ED", "title": "Practicum in Classroom Management: Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject Credential Program.", "comments": "", "units": "2", "description": "To raise awareness of often-transparent classroom management strategies to help teacher candidates facilitate learning among students with diverse backgrounds and learning needs, learn research-based strategies to build positive classroom atmospheres, and prepare them for more productive classroom observations.", "recommended_prep": "", "professor": "GRANGER", "college": "GGSE"},
"ED HSS320S": {"number": "HSS320S", "sub_dept": "ED", "title": "Elementary Social Studies Teaching Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1-4", "description": "Development of pedagogical content knowledge, methods, curriculum design, research, and theory related to teaching and learning at the elementary level.", "recommended_prep": "", "professor": "KOK", "college": "GGSE"},
"ED HSS320W": {"number": "HSS320W", "sub_dept": "ED", "title": "Elementary Social Studies Teaching Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1-4", "description": "Development of pedagogical content knowledge, methods, curriculum design, research, and theory related to teaching and learning at the elementary level.", "recommended_prep": "", "professor": "KOK", "college": "GGSE"},
"ED HSS321M": {"number": "HSS321M", "sub_dept": "ED", "title": "Secondary History/Social Science Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "2", "description": "Development of pedagogical content knowledge, methods, curriculum design, research, and theory related to teaching and learning History/Social Science at the secondary level.", "recommended_prep": "", "professor": "ESTABROOK, MULLIN", "college": "GGSE"},
"ED HSS321S": {"number": "HSS321S", "sub_dept": "ED", "title": "Secondary History/Social Science Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1", "description": "Development of pedagogical content knowledge, methods, curriculum design,  research, and theory related to teaching and learning History/Social   Science at the secondary level.", "recommended_prep": "", "professor": "KOK", "college": "GGSE"},
"ED HSS321W": {"number": "HSS321W", "sub_dept": "ED", "title": "Secondary History/Social Science Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1", "description": "Development of pedagogical content knowledge, methods, curriculum design,  research, and theory related to teaching and learning History/Social   Science at the secondary level.", "recommended_prep": "", "professor": "KOK", "college": "GGSE"},
"ED 330": {"number": "330", "sub_dept": "ED", "title": "Writing Project Approaches to Teaching Composition, K-College", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject Credential Program.", "comments": "", "units": "4", "description": "Experimental approach to learning in a community of writers. Features theory and practice for integrating informal and formal writing activities into the learning process and reading/writing development in all disciplines and grade levels. Let be South Coast Writing Project Fellows.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED L  321F": {"number": "L  321F", "sub_dept": "ED", "title": "Reading and Writing in Content", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "2", "description": "This course is designed to provide credential candidates with the knowledge and skills necessary to design and enact comprehensive English Language Arts instruction in self-contained, integrated and inclusive K-14 classrooms.", "recommended_prep": "", "professor": "STAFF, BLACKWELL", "college": "GGSE"},
"ED L  321M": {"number": "L  321M", "sub_dept": "ED", "title": "Reading and Writing in Content", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1", "description": "This course is designed to provide credential candidates with the    knowledge and skills necessary to design and enact comprehensive English Language Arts instruction in self-contained, integrated and inclusive  K-14 classrooms.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED L  321W": {"number": "L  321W", "sub_dept": "ED", "title": "Reading and Writing in Content", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1", "description": "This course is designed to provide credential candidates with the knowledge and skills necessary to design and enact comprehensive English Language Arts instruction in self-contained, integrated and inclusive K-14 classrooms.", "recommended_prep": "", "professor": "BLACKWELL", "college": "GGSE"},
"ED LA 320F": {"number": "LA 320F", "sub_dept": "ED", "title": "Elementary Reading and Language Arts Teaching Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1-4", "description": "This course is designed to provide ESC and MST credential candidate with the knowledge and skills necessary to design and enact comprehensive English Language Arts instruction in self-contained, integrated and inclusive K-14 classrooms.", "recommended_prep": "", "professor": "WHITAKER", "college": "GGSE"},
"ED LA 320W": {"number": "LA 320W", "sub_dept": "ED", "title": "Elementary Reading and Language Arts Teaching Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1-4", "description": "This course is designed to provide ESC and MST credential candidate with the knowledge and skills necessary to design and enact comprehensive English Language Arts instruction in self-contained, integrated and inclusive K-14 classrooms.", "recommended_prep": "", "professor": "LIPPINCOTT, WHITAKER", "college": "GGSE"},
"ED M  321M": {"number": "M  321M", "sub_dept": "ED", "title": "Secondary Mathematics Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "2", "description": "Development of pedagogical content knowledge, methods, curriculum design, research, and theory related to teaching and learning Mathematics at the secondary level.", "recommended_prep": "", "professor": "OGRAIN, ROBERTS", "college": "GGSE"},
"ED S  321M": {"number": "S  321M", "sub_dept": "ED", "title": "Secondary Science Methods", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "2", "description": "Development of pedagogical content knowledge, methods, curriculum design, research, and theory related to teaching and learning science at the secondary level.", "recommended_prep": "", "professor": "BIANCHINI", "college": "GGSE"},
"ED 340": {"number": "340", "sub_dept": "ED", "title": "Student Teaching: Elementary Schools", "dept": "ED", "prereqs": [], "prereq_description": "Admission to the Multiple Subject Credential Program.", "comments": "", "units": "3-11", "description": "", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED A  341": {"number": "A  341", "sub_dept": "ED", "title": "Student Teaching: Visual Arts Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "3-9", "description": "Supervised fieldwork in secondary Visual Arts classrooms (grades 7-12).", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 341": {"number": "341", "sub_dept": "ED", "title": "Student Teaching - Introduction to Secondary Instruction", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of instructor.", "comments": "", "units": "3-9", "description": "Supervised fieldwork and student teaching in secondary classrooms (grades 7-12).", "recommended_prep": "", "professor": "FEDDERS", "college": "GGSE"},
"ED E  341": {"number": "E  341", "sub_dept": "ED", "title": "Student Teaching: English/Language Arts Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "3-9", "description": "Supervised fieldwork and student teaching in secondary English/Language  Arts classrooms (grades 7-12).", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED HSS341": {"number": "HSS341", "sub_dept": "ED", "title": "Student Teaching: History/Social Science Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "3-9", "description": "Supervised fieldwork in secondary History/Social Science classrooms    (grades 7-12).", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED M  341": {"number": "M  341", "sub_dept": "ED", "title": "Student Teaching: Mathematics Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "3-9", "description": "Supervised fieldwork in secondary Mathematics classrooms (grades 7-12).", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED S  341": {"number": "S  341", "sub_dept": "ED", "title": "Student Teaching: Science Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "3-9", "description": "Supervised fieldwork and student teaching in secondary Science classrooms  (grades 7-12).", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED WL 341": {"number": "WL 341", "sub_dept": "ED", "title": "Student Teaching: World Language Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "3-9", "description": "Supervised fieldwork in secondary World Language classrooms (grades 7-12).", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 343": {"number": "343", "sub_dept": "ED", "title": "Multicultural Reading Field Experiences", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1", "description": "Supervised field experience of teaching content reading skills in    multicultural settings for secondary teacher candidates.", "recommended_prep": "", "professor": "TINE SLOAN", "college": "GGSE"},
"ED WL 321M": {"number": "WL 321M", "sub_dept": "ED", "title": "Secondary World Language Methods", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "2", "description": "Development of pedagogical content knowledge, methods, curriculum design, research, and theory related to teaching and learning world language at the secondary level.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 360F": {"number": "360F", "sub_dept": "ED", "title": "ELD/SDAIE Methods and Procedures", "dept": "ED", "prereqs": [], "prereq_description": "Enrollment in Multiple Subject or Special Education Teaching Credential", "comments": "", "units": "2", "description": "Goal is to prepare educators who can articulately advocate for and enact effective educational practices to ensure English Language proficiency and academic progress for student who are designated as English Learners.", "recommended_prep": "", "professor": "SCALZO", "college": "GGSE"},
"ED 360S": {"number": "360S", "sub_dept": "ED", "title": "ELD/SDAIE Methods and Procedures", "dept": "ED", "prereqs": [], "prereq_description": "Enrollment in multiple subject teaching credential program.", "comments": "", "units": "1", "description": "Goal is to prepare educators who can articulately advocate for and enact effective educational practices to ensure English Language proficiency and academic progress for student who are designated as English Learners.", "recommended_prep": "", "professor": "SCALZO", "college": "GGSE"},
"ED 360W": {"number": "360W", "sub_dept": "ED", "title": "ELD/SDAIE Methods and Procedures", "dept": "ED", "prereqs": [], "prereq_description": "Enrollment in Multiple Subject Teaching Credential Program.", "comments": "", "units": "2", "description": "Goal is to prepare educators who can articulately advocate for and enact effective educational practices to ensure English Language proficiency and academic progress for student who are designated as English Learners.", "recommended_prep": "", "professor": "SCALZO", "college": "GGSE"},
"ED 361F": {"number": "361F", "sub_dept": "ED", "title": "ELD/SDAIE Methods and Procedures", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "1-3", "description": "Goal is to prepare educators who can articulately advocate for and enact effective educational practices to ensure English language proficiently and academic progress for student who are designated as English learners.", "recommended_prep": "", "professor": "SCALZO", "college": "GGSE"},
"ED 361S": {"number": "361S", "sub_dept": "ED", "title": "ELD/SDAIE Methods and Procedures", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "1", "description": "Goal is to prepare educators who can articulately advocate for and enact effective educational practices to ensure English language proficiently and academic progress for students who are designated as English learners.", "recommended_prep": "", "professor": "SCALZO", "college": "GGSE"},
"ED 361W": {"number": "361W", "sub_dept": "ED", "title": "ELD/SDAIE Methods and Procedures", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "1", "description": "Goal is to prepare educators who can articulately advocate for and enact effective educational practices to ensure English language proficiently  and academic progress for student who are designated as English learners.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 362": {"number": "362", "sub_dept": "ED", "title": "Exceptional Children, Inclusive Classrooms", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject", "comments": "", "units": "1-4", "description": "A survey course in special education for students preparing to teach at the elementary school level. Topics include educational policy, instructional modifications and the role of the teaching in supporting children with special needs.", "recommended_prep": "", "professor": "SINGER, WANG, MORAN", "college": "GGSE"},
"ED 363": {"number": "363", "sub_dept": "ED", "title": "Exceptional Adolescents, Inclusive Classrooms", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple or Single Subject", "comments": "", "units": "1-4", "description": "A survey course in special education for students preparing to teach at the high school level. Topics include educational policy, instructional modification, and the role of the teacher in supporting adolescents with special needs.", "recommended_prep": "", "professor": "MORAN", "college": "GGSE"},
"ED 364": {"number": "364", "sub_dept": "ED", "title": "Assistive Technology for Students with Exceptional Learning Needs", "dept": "ED", "prereqs": [["ED 222A"]], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program OR The Department of Education; ED 222A.", "comments": "", "units": "1-4", "description": "Offers teacher candidates exposure to adaptive and assistive technologies, as well as state-of-the-art software and hardware used by and for children with exceptional learning needs. Students learn hands-on skills of designing technology-based instructional materials for children with disabilities.", "recommended_prep": "", "professor": "WANG, EVANS", "college": "GGSE"},
"ED 370": {"number": "370", "sub_dept": "ED", "title": "Professional Seminar in Teaching: Elementary", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple Credential Program.", "comments": "", "units": "1-2", "description": "This seminar focuses on practice-based issues linked to student teaching and includes such topics as classroom environmental, assessment centered teaching, lesson design, integration of the arts, and uses around school policy. Topics differ each quarter, building on student teachers developing expertise.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED A  371": {"number": "A  371", "sub_dept": "ED", "title": "Professional Issues in Teaching Visual Art: Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1", "description": "Seminar in which secondary teacher candidates in visual art share and  discuss their field experience, explore further avenues of teaching    content, and investigate more effective ways of engaging and supporting  students.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED E  371": {"number": "E  371", "sub_dept": "ED", "title": "Professional Issues in Teaching English/Language Arts: Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "1-2", "description": "Seminar in which teacher candidates in English/Language Arts share and discuss their field experience, explore further avenues of teaching content, and investigate more effective ways of engaging and supporting students.", "recommended_prep": "", "professor": "DEWAR", "college": "GGSE"},
"ED HSS371": {"number": "HSS371", "sub_dept": "ED", "title": "Professional Issues in Teaching History/Social Science: Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1-2", "description": "Seminar in which secondary teacher candidates in history/social science share and discuss their field experience, explore further avenues of teaching content, and investigate more effective ways of engaging and supporting students.", "recommended_prep": "", "professor": "ESTABROOK, MULLIN", "college": "GGSE"},
"ED M  371": {"number": "M  371", "sub_dept": "ED", "title": "Professional Issues in Teaching Mathematics: Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "", "units": "1-2", "description": "Seminar in which secondary teacher candidates in mathematics share and discuss their field experience, explore further avenues of teaching content, and investigate more effective ways of engaging and supporting students.", "recommended_prep": "", "professor": "ROSS", "college": "GGSE"},
"ED S  371": {"number": "S  371", "sub_dept": "ED", "title": "Professional Issues in Teaching Science: Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Teaching Credential Program; and consent of", "comments": "", "units": "1-2", "description": "Seminar in which teacher candidates in Science share and discuss their field experience, explore further avenues of teaching content, and investigate more effective ways of engaging and supporting students.", "recommended_prep": "", "professor": "LUBCHENCO", "college": "GGSE"},
"ED WL 371": {"number": "WL 371", "sub_dept": "ED", "title": "Professional Issues in Teaching World Language: Secondary", "dept": "ED", "prereqs": [], "prereq_description": "Graduate standing and enrollment in The Teacher Education Program.", "comments": "May be repeated.", "units": "1-2", "description": "Seminar in which secondary teacher candidates in world language share and discuss their field experience, explore further avenues of teaching content, and investigate more effective ways of engaging and supporting students.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 380": {"number": "380", "sub_dept": "ED", "title": "Teaching Strategies for Bilingual/Cross-Cultural Education: Elementary", "dept": "ED", "prereqs": [], "prereq_description": "Graduate Standing and enrollment in the Multiple Credential Program.", "comments": "", "units": "4", "description": "Intensive examination of effective teaching methods for Spanish Spanish- English classroom with particular emphasis on language arts area. Students explore curriculum materials and also learn instructional strategies for teaching in bilingual settings.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 381": {"number": "381", "sub_dept": "ED", "title": "Teaching Strategies for Bilingual/Cross-Cultural Education", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Teaching Credential Program; and consent of instructor.", "comments": "", "units": "2-4", "description": "Intensive examination of effective teaching methods for bilingual Spanish-English classroom with particular emphasis on language arts. Students explore curriculum materials and applications and also learn instructional strategies for teaching in bilingual settings.", "recommended_prep": "", "professor": "SEVILLA", "college": "GGSE"},
"ED 381A": {"number": "381A", "sub_dept": "ED", "title": "", "dept": "ED", "prereqs": [["ED 381"]], "prereq_description": "Admission to teaching credential program and Education 381.", "comments": "", "units": "4", "description": "Teacher candidates apply the knowledge of language acquisition gained in ED 381 to understand how to best utilize students' cultural and linguistic funds of knowledge to facilitate the further development of their entire linguistic repertoire.", "recommended_prep": "", "professor": "SEVILLA", "college": "GGSE"},
"ED 381B": {"number": "381B", "sub_dept": "ED", "title": "", "dept": "ED", "prereqs": [["ED 381"], ["ED 381A"]], "prereq_description": "Admission to teaching credential program, Education 381 and Education 381A.", "comments": "", "units": "4", "description": "Teacher candidates learn about bilingual instructional models, instructional strategies and materials, as well as assessment practices. All of which will then allow students to plan, develop, implement and assess standards-aligned content instruction in the primary and target language.", "recommended_prep": "", "professor": "SEVILLA", "college": "GGSE"},
"ED SPS390W": {"number": "SPS390W", "sub_dept": "ED", "title": "Special Education in the Secondary School", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Credential Program.", "comments": "", "units": "4", "description": "A survey course in special education for students preparing to teach at  the high school level. Topics include educational policy, instructional  modification, and the role of the teacher in meeting the education needs of the handicapped adolescent.", "recommended_prep": "", "professor": "KOK O N", "college": "GGSE"},
"ED ST 393S": {"number": "ST 393S", "sub_dept": "ED", "title": "Seminar in Teaching Science", "dept": "ED", "prereqs": [], "prereq_description": "Admission to Single Subject Credential Program. Taken concurrently with", "comments": "", "units": "2", "description": "Seminar covers problems related to student teaching.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED E  391HW": {"number": "E  391HW", "sub_dept": "ED", "title": "ELD/SDAIE Methods and Procedures", "dept": "ED", "prereqs": [], "prereq_description": "Enrollment in Multiple Subject Teaching Credential Program.", "comments": "This is a 3-quarter in-progress sequence course with final grades issued upon completion of Ed E 391HS.", "units": "1", "description": "Course focuses on the education of English learners. Primary goal is to  prepare professional educators who can articulately advocate for and   enact effective educational practices for students who are acquiring   English as a new language. Designed to help MST credential candidates  begin to develop skills and understanding necessary to make decisions  regarding instruction that ensure English language proficiency and   academic progress for each student.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 594": {"number": "594", "sub_dept": "ED", "title": "Graduate Group Studies in Education", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "2-4", "description": "Limited to small groups whose interest and needs determine the central focus.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 596": {"number": "596", "sub_dept": "ED", "title": "Directed Reading and Research", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "2-12", "description": "Individual tutorial in doctoral and masters' degree subprogram special   fields.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 597": {"number": "597", "sub_dept": "ED", "title": "Individual Study for Comprehensive Examinations", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "2-12", "description": "Preparation for master's or Ph.D. comprehensive examinations.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 598": {"number": "598", "sub_dept": "ED", "title": "Master's Thesis Research and Preparation", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "2-12", "description": "Supervised research and writing of the thesis in doctoral and masters'   degree subprograms.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED 599": {"number": "599", "sub_dept": "ED", "title": "Ph.D. Dissertation Preparation", "dept": "ED", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "2-12", "description": "Supervised research and writing of dissertation in doctoral degree   subprograms.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"},
"ED R  390AS": {"number": "R  390AS", "sub_dept": "ED", "title": "ELD/SDAIE Methods and Procedures", "dept": "ED", "prereqs": [], "prereq_description": "Admisssion into the Single Subject Credential Program.", "comments": "A three-quarter in-progress sequence course with grades for all quarters issued upon completion of Education R390AS.", "units": "1", "description": "A core methods course required for SST Credential designed to help SST Credential candidates develop knowledge, skills, and understanding   necessary in decision making regarding instruction insuring proper ESL proficiency and progress for each student.", "recommended_prep": "", "professor": "STAFF", "college": "GGSE"}
}