{"ME 6": {"number": "6", "sub_dept": "ME", "title": "Basic Electrical and Electronic Circuits", "dept": "ME", "prereqs": [["PHYS 3L; Mathematics ", "PHYS 4A", "PHYS 4AI", "PHYS 3C"]], "prereq_description": "Physics 3-3L; Mathematics 4A or 4AI or 3C; open to ME majors only.", "comments": "Quarters usually offered: Winter. Not open for credit to students who have completed ECE 2A or 2B, or ECE 6A or 6B.", "units": "4", "description": "Introduction to basic electrical circuits and electronics. Includes Kirchhoff's laws, phasor analysis, circuit elements, operational amplifiers and transistor circuits.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 10": {"number": "10", "sub_dept": "ME", "title": "Engineering Graphics: Sketching, CAD and Conceptual Design", "dept": "ME", "prereqs": [], "prereq_description": "Mechanical Engineering majors only.", "comments": "", "units": "4", "description": "Introduces hands-on engineering design via lessons on the design process, Computer Aided Design (CAD), free hand sketching, use of a laser cutter, soldering, basic circuits, basic microprocessor programming, motors and gear trains. Makes use of a robotic project to allow students to practice all above topics. Students create dimensioned engineering drawings and present their designs at a final design fair. The focus of the course is to empower students to leverage all engineering tools listed above in their future engineering courses.", "recommended_prep": "", "professor": "SUSKO", "college": "COE"},
"ME 11": {"number": "11", "sub_dept": "ME", "title": "Introductory Concepts in Mechanical Engineering", "dept": "ME", "prereqs": [], "prereq_description": "Lower-division standing.", "comments": "", "units": "1", "description": "The theme question of this course is, \"What do mechanical engineers do?\" Survey of mechanical engineering applications. Lectures by mechanical engineering faculty and practicing engineers.", "recommended_prep": "", "professor": "BOTHMAN, FIELDS, BELTZ", "college": "COE"},
"ME 12": {"number": "12", "sub_dept": "ME", "title": "Manufacturing Processes", "dept": "ME", "prereqs": [], "prereq_description": "ME majors only.", "comments": "", "units": "1", "description": "Processes used to convert raw material into finished objects. Overview of  manufacturing processes including: casting, forging, machining, presswork, plastic and composite processing. Videos, demonstrations, and tours    illustrate modern industrial practice. Selection of appropriate processes.", "recommended_prep": "", "professor": "BOTHMAN", "college": "COE"},
"ME 12S": {"number": "12S", "sub_dept": "ME", "title": "Introduction to Machine Shop", "dept": "ME", "prereqs": [], "prereq_description": "Mechanical engineering majors only.", "comments": "Quarters usually offered: Winter, Spring, Fall. Not open for credit to   students who have completed Mechanical Engineering 156S.  Course   materials fee required.", "units": "1", "description": "Basic machine shop skills course. Students learn to work safely in a   machine shop. Students are introduced to the use of hand tools, the  lathe, the milling machine, drill press, saws, and precision measuring tools. Students apply these skills by completing a project.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 13": {"number": "13", "sub_dept": "ME", "title": "Design Case Studies", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "", "units": "1", "description": "Introduces students to the important role of engineering calculations  in product design. This will be accomplished through detailed case   studies that show how fundamental physics and engineering are    applied to scope the performance of engineering prototypes. This will  also show how prototype shape emerges from a combination of customer requirements and what is feasible within the constraints of time,    budget, physics and the current state of technology.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 14": {"number": "14", "sub_dept": "ME", "title": "Statics", "dept": "ME", "prereqs": [["MATH 2B", "MATH 3B", "MATH 5", "MATH 3"]], "prereq_description": "Math 2B, or Math 3B, or AP Calculus AB with a score of 5, or AP Calculus BC with a score of 3 or better; and", "comments": "", "units": "4", "description": "Introduction to applied mechanics. Forces, moments, couples, and resultants; vector algebra; construction of free body diagrams; equilibrium in 2- and 3-  dimensions; analysis of frames, machines, trusses and beams; distributed forces; friction.", "recommended_prep": "", "professor": "BELTZ, SHUGAR, TURNER", "college": "COE"},
"ME 15": {"number": "15", "sub_dept": "ME", "title": "Strength of Materials", "dept": "ME", "prereqs": [["ME 14"]], "prereq_description": "ME 14 with a minimum grade of C-; open to mechanical engineering majors", "comments": "Quarters usually offered: Fall.", "units": "4", "description": "Properties of structural materials, including Hooke?s law and behavior   beyond the elastic limit. Concepts of stress, strain, displacement,  force, force systems, and multiaxial stress states. Design applications  to engineering structures, including problems of bars in tension,    compression, and torsion, beams subject to flexure, pressure vessels,  and buckling.", "recommended_prep": "", "professor": "BELTZ", "college": "COE"},
"ME 16": {"number": "16", "sub_dept": "ME", "title": "Engineering Mechanics: Dynamics", "dept": "ME", "prereqs": [["PHYS 2", "ME 14", "MATH 5C", "MATH 6B"]], "prereq_description": "Physics 2, ME 14 with a minimum grade of C-, Mathematics 5C or 6B (may be  taken", "comments": "", "units": "4", "description": "Vectorial kinematics of particles. Coordinate systems, moving frames,  relative and constrained motion. Dynamics of particles and systems of  particles. Energy and momentum methods. Collisions. Planar kinematics  and kinematics of rigid bodies. Energy and momentum methods for rigid  body systems.", "recommended_prep": "", "professor": "TURNER, MEZIC, BAMIEH", "college": "COE"},
"ME 17": {"number": "17", "sub_dept": "ME", "title": "Mathematics of Engineering", "dept": "ME", "prereqs": [["ENGR 3"]], "prereq_description": "Engineering 3; open to ME majors only.", "comments": "Quarters usually offered: Spring, Summer.", "units": "3", "description": "Introduction to basic numerical and analytical methods, with implementation using MATLAB. Topics include a Matlab review, ordinary differential equations, partial differential equations and boundary conditions, eigenvalue/eigenvectors. Graphic and visualization tools in Matlab.", "recommended_prep": "", "professor": "GIBOU", "college": "COE"},
"ME 18": {"number": "18", "sub_dept": "ME", "title": "Toy Product Design", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "", "units": "3", "description": "Introduction to the product design process with a focus on designing for play and entertainment. It is a project-centric class. Students work in small teams of 5-6 members to design and prototype new toys. Students will be introduced to various design topics, including: brainstorming; estimation; sketching; graphic design; industrial design drawing; sketch modeling; concept development; design aesthetics; prototyping; and written, visual, and oral communication.", "recommended_prep": "", "professor": "TSAI", "college": "COE"},
"ME 95": {"number": "95", "sub_dept": "ME", "title": "Introduction to Mechanical Engineering", "dept": "ME", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "May be repeated for credit to a maximum of 6 units.", "units": "1-4", "description": "Participation in projects in the laboratory or machine shop. Projects may  be student- or faculty-originated depending upon student interest and  consent of faculty member.", "recommended_prep": "", "professor": "</b>", "college": "COE"},
"ME 97": {"number": "97", "sub_dept": "ME", "title": "Mechanical Engineering Design Projects", "dept": "ME", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "May be repeated for maximum of 12 units.", "units": "1-4", "description": "Course offers students opportunity to work on established departmental   design projects.  P/NP grading, does not satisfy technical elective    requirement.", "recommended_prep": "", "professor": "</b>", "college": "COE"},
"ME 99": {"number": "99", "sub_dept": "ME", "title": "Introduction to Research", "dept": "ME", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "May be repeated for credit to a maximum of 6 units. Students are limited to 5 units per quarter and 30 units total in all 98/99/198/199/199AA-ZZ courses combined.", "units": "1-4", "description": "Directed study to be arranged with individual faculty members. Course offers exceptional students an opportunity to participate in a research group.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 100": {"number": "100", "sub_dept": "ME", "title": "Professional Seminar", "dept": "ME", "prereqs": [], "prereq_description": "Undergraduate standing.", "comments": "May be repeated for up to 3 units. May not be used as a departmental elective.", "units": "1", "description": "A series of weekly lectures given by university staff and outside experts in all fields of mechanical engineering.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 102": {"number": "102", "sub_dept": "ME", "title": "Finite Elements Analysis of Heat Transfer and Fluid Flow with COMSOL", "dept": "ME", "prereqs": [["ME 151C"], ["ME 152B"]], "prereq_description": "ME 151C and ME 152B; or consent by instructor", "comments": "", "units": "3", "description": "Study of modeling and analysis of Heat Transfer and Fluid Flow problems using Finite Elements numerical techniques. Students learn to develop sound numerical models of engineering devices using COMSOL Multiphysics Finite Elements software. Addresses geometry construction, model development, meshing, results generation, and physical analysis.", "recommended_prep": "", "professor": "MATTHYS, MEINHART", "college": "COE"},
"ME 104": {"number": "104", "sub_dept": "ME", "title": "Mechatronics", "dept": "ME", "prereqs": [["ME 6"]], "prereq_description": "ME 6; open to ME majors only.", "comments": "", "units": "4", "description": "Interfacing of mechanical and electrical systems and mechatronics. Basic introduction to sensors, actuators, and computer interfacing and control. Transducers and measurement devices, actuators, A/D and D/A conversion, signal conditioning and filtering. Practical skills developed in weekly lab exercises.", "recommended_prep": "", "professor": "BAMIEH", "college": "COE"},
"ME 105": {"number": "105", "sub_dept": "ME", "title": "Mechanical Engineering Laboratory", "dept": "ME", "prereqs": [["ME 151B", "ME 152B", "ME 163", "MATRL 101", "MATRL 100B"]], "prereq_description": "ME 151B, 152B, 163; and, Materials 101 or 100B.", "comments": "Quarters usually offered: Spring.", "units": "4", "description": "Introduction to fundamental engineering laboratory measurement techniques and report writing skills. Experiments from thermosciences, fluid mechanics, mechanics,and materials science. Introduction to modern data acquisition and analysis techniques.", "recommended_prep": "", "professor": "VALENTINE", "college": "COE"},
"ME 106A": {"number": "106A", "sub_dept": "ME", "title": "Advanced Mechanical Engineering Laboratory", "dept": "ME", "prereqs": [["ME 155A"]], "prereq_description": "ME 155A.", "comments": "", "units": "3", "description": "An advanced lab course with experiments in dynamical systems and feedback  control design. Students design, troubleshoot, and perform detailed,   multi-session experiments.", "recommended_prep": "", "professor": "KHAMMASH, BAMIEH", "college": "COE"},
"ME 107": {"number": "107", "sub_dept": "ME", "title": "Machine Learning", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "", "units": "3", "description": "This course is meant to introduce students to machine learning and deep learning. ME 107 is taught at the undergraduate level and teaches students how to identify a machine learning problem in the context of real-world applications, mathematically formulate a learning problem, identify when a learning problem is well-posed, under-determined and overdetermined, and develop algorithms and Python code to solve the problem. Students are introduced to the concepts of learning algorithms, overfitting, under-fitting, statistical measures of estimators, optimization approaches to learning, principal component analysis, regression, support vector machines, and artificial neural networks.", "recommended_prep": "", "professor": "YEUNG</span> <i>", "college": "COE"},
"ME 108": {"number": "108", "sub_dept": "ME", "title": "Applications of Finite Element Analysis", "dept": "ME", "prereqs": [["ME 14", "ME 15"]], "prereq_description": "ME 14; ME 15", "comments": "", "units": "3", "description": "Modeling and translation into practical FEA using SolidWorks simulation tools. The course focuses on choosing the correct constraints for parts and assembly. Another focus is on moving parts within SolidWorks. If time permits the class considers optimization of mechanical structures based on anticipated loads. This class goes through the cycle of designing, performing FEA, testing and repeat. SolidWorks, including its geometry optimization module, is used in this class as a \"calculator\". This fulfills the need of industry (SolidWorks), while preparing students to Capstone and other courses.", "recommended_prep": "", "professor": "TSAI", "college": "COE"},
"ME 110": {"number": "110", "sub_dept": "ME", "title": "Aerodynamics and Aeronautical Engineering", "dept": "ME", "prereqs": [["ENGR 14"], ["ENGR 152A"]], "prereq_description": "Mechanical Engineering 14 and 152A.", "comments": "", "units": "3", "description": "Concepts from aerodynamics, including lift and drag analysis for airfoils  as well as aircraft sizing/scaling issues. Structural mechanics concepts are applied to practical aircraft design. Intended for students    considering a career in aeronautical engineering.", "recommended_prep": "", "professor": "BELTZ, MEINHART", "college": "COE"},
"ME 112": {"number": "112", "sub_dept": "ME", "title": "Energy", "dept": "ME", "prereqs": [], "prereq_description": "Senior Undergraduate or Graduate Student status in the College of", "comments": "", "units": "3", "description": "Introduction to the field of Energetics. Topics may include energy   sources and production, energy usage, renewable technologies, hardware,  operating principles, environmental impact, energy reserves, national  and global energy budgets, historical perspectives, economics, societal  considerations, and others.", "recommended_prep": "", "professor": "MATTHYS, MARSCHALL", "college": "COE"},
"ME 124": {"number": "124", "sub_dept": "ME", "title": "Advanced Topics in Transport Phenomena/Safety", "dept": "ME", "prereqs": [["CH E 120A"], ["CH E 120B"], ["CH E 120C"], ["ENGR 151A"], ["ENGR 151B"], ["ENGR 152A"]], "prereq_description": "Chemical Engineering 120A-B-C; or, Mechanical Engineering 151A-B and 152A.", "comments": "Same course as Chemical Engineering 124.", "units": "3", "description": "Hazard identification and assessments, runaway reactions, emergency    relief. Plant accidents and safety issues. Dispersion and consequences of  releases.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 125AAZZ": {"number": "125AAZZ", "sub_dept": "ME", "title": "Special Topics in Mechanical Engineering", "dept": "ME", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "May be repeated for credit to a maximum of 12 units provided letter designations are different. Students are advised to consult their faculty advisor before making their course selection.", "units": "3", "description": "Individual courses each concentrating on one area in the following subjects: applied mechanics, cad/cam, controls, design, environmental engineering, fluid mechanics, materials science, mechanics of solids and structures, ocean and coastal engineering, robotics, theoretical mechanics,thermal sciences, and recent developments in mechanical engineering.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 127": {"number": "127", "sub_dept": "ME", "title": "Introduction to Mechanisms", "dept": "ME", "prereqs": [["ME 16"]], "prereq_description": "Upper-division standing. ME 16 or consent of the instructor.", "comments": "", "units": "3", "description": "Generation, analysis, and refinement of the design of electro-mechanical devices for common machine elements including fasteners, joints, springs, bearings, gearing, motors, pneumatics, clutches, couplings, belts, chains, and shafts making use of physics, mathematics, and engineering principles.", "recommended_prep": "", "professor": "TSAI", "college": "COE"},
"ME 128": {"number": "128", "sub_dept": "ME", "title": "Design of Biomedical Devices", "dept": "ME", "prereqs": [["ENGR 10"], ["ENGR 14"], ["ENGR 15"], ["ENGR 16"], ["ENGR 153"]], "prereq_description": "Mechanical Engineering 10, 14, 15, 16, and 153; open to ME majors only.", "comments": "", "units": "3", "description": "Introductory course addresses the challenges of biomedical device    design, prototyping and testing, material considerations, regulatory   requirements, design control, human factors and ethics.", "recommended_prep": "", "professor": "LAGUETTE", "college": "COE"},
"ME 129": {"number": "129", "sub_dept": "ME", "title": "Manufacturing and Geometric Dimensioning and Tolerancing", "dept": "ME", "prereqs": [["ME 127"]], "prereq_description": "ME 127 or consent of instructor.", "comments": "", "units": "3", "description": "Introduction to manufacturing, surveying a broad range of manufacturing methods and focusing on a few select processes. The course covers some of the considerations and decisions that go into process selection, manufacturing systems, design for manufacture, and design for assembly, as well as how those decisions influence manufacturing quality and cost.", "recommended_prep": "", "professor": "TSAI", "college": "COE"},
"ME 134": {"number": "134", "sub_dept": "ME", "title": "Advanced Thermal Science", "dept": "ME", "prereqs": [["ENGR 151C"]], "prereq_description": "Mechanical Engineering 151C.", "comments": "", "units": "3", "description": "This class will address advanced topics in fluid mechanics, heat transfer, and thermodynamics. Topics if interest may include combustion, phase   change, experimental techniques, materials processing, manufacturing,  engines, HVAC, non-newtonian fluids, etc.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 140A": {"number": "140A", "sub_dept": "ME", "title": "Numerical Analysis in Engineering", "dept": "ME", "prereqs": [["ME 17", "CH E 132A"]], "prereq_description": "ME 17 with a minimum grade of C-, or Chemical Engineering 132A.", "comments": "Designed for majors. Quarters usually offered: Fall.", "units": "3", "description": "Numerical analysis and analytical solutions of problems described by   linear and nonlinear differential equations with an emphasis on MATLAB.  First and second order differential equations; systems of differential equations; linear algebraic equations, matrices and eigenvalues;   boundary value problems; finite differences.", "recommended_prep": "", "professor": "MOEHLIS, GIBOU, MEIBURG", "college": "COE"},
"ME 140B": {"number": "140B", "sub_dept": "ME", "title": "Theoretical Analysis in Mechanical Engineering", "dept": "ME", "prereqs": [["ME 140A"]], "prereq_description": "ME 140A.", "comments": "", "units": "3", "description": "Analysis of engineering problems formulated in terms of partial    differential equations. Solutions of these mathematical models by means of analytical and numerical methods. Physical interpretation of the results.", "recommended_prep": "", "professor": "MOEHLIS, GIBOU, MEIBURG", "college": "COE"},
"ME 141A": {"number": "141A", "sub_dept": "ME", "title": "Introduction to Nanoelectromechanical and Microelectromechanical systems (NEMS/MEMS)", "dept": "ME", "prereqs": [["ME 16", "ME 17", "ME 152A", "ME 151A", "ECE 130A", "ECE 137A"]], "prereq_description": "ME 16 &amp; 17; ME 152A &amp; ME 151A (may be concurrent); or ECE 130A &amp; 137A with a minimum grade", "comments": "", "units": "3", "description": "Introduction to nano- and microtechnology. Scaling laws and nanoscale  physics are stressed. Individual subjects at the nanoscale including   materials, mechanics, photonics, electronics, and fluidics will be   described, with an emphasis on differences of behavior at the nanoscale  and real-world examples.", "recommended_prep": "", "professor": "PENNATHUR, TURNER", "college": "COE"},
"ME 141B": {"number": "141B", "sub_dept": "ME", "title": "MEMS: Processing and Device Characterization", "dept": "ME", "prereqs": [["ME 141A", "ME 163", "ECE 141A"]], "prereq_description": "ME 141A, ME 163 (may be concurrent); or ECE 141A.", "comments": "Quarters usually offered: Winter.", "units": "4", "description": "Lectures and laboratory on semiconductor-based processing for MEMS.    Description of key equipment and characterization tools used for MEMS and  design, fabrication, characterization and testing of MEMS. Emphasis on   current MEMS devices including accelerometers, comb drives,      micro-reactors and capacitor-actuators.", "recommended_prep": "", "professor": "PENNATHUR, TURNER", "college": "COE"},
"ME 146": {"number": "146", "sub_dept": "ME", "title": "Molecular and Cellular Biomechanics", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "Concurrently offered with ME 246. Quarters usually offered: Fall.", "units": "3", "description": "Course introduces fundamental concepts in molecular and cellular     biomechanics. Will consider the role of physical, thermal and chemical   forces, examine their influence on cell strength and elasticity, and   explore the properties of enzymatically-active materials.", "recommended_prep": "", "professor": "VALENTINE", "college": "COE"},
"ME 147": {"number": "147", "sub_dept": "ME", "title": "Mechatronics Using Labview", "dept": "ME", "prereqs": [["ENGR 3"], ["ENGR 6"]], "prereq_description": "Engineering 3; and Mechanical Engineering 6", "comments": "Not open for additional credit to students who have completed ME 125CH.", "units": "3", "description": "Introduction to mechatronics, electromechanical systems, data acquisition, software programming and Labview. Students learn programming fundamentals, hardware interfacing and controls with simulated hardware and actual motor controllers.  Students compete to control a motor system through a variety of control problems.  Final projects automate working hardware in research labs.", "recommended_prep": "", "professor": "HARE", "college": "COE"},
"ME 151A": {"number": "151A", "sub_dept": "ME", "title": "", "dept": "ME", "prereqs": [["PHYS 2", "ME 14"], ["MATH 5C"]], "prereq_description": "Physics 2; ME 14 with a minimum grade of C-; and, Mathematics 5C or", "comments": "Quarters usually offered: Fall.", "units": "4", "description": "Basic concepts in thermodynamics, system analysis, energy, thermodynamic laws, and cycles.", "recommended_prep": "", "professor": "BENNETT, MEINHART", "college": "COE"},
"ME 151B": {"number": "151B", "sub_dept": "ME", "title": "", "dept": "ME", "prereqs": [["ME 151A"], ["ME 152A"]], "prereq_description": "ME 151A and 152A.", "comments": "Quarters usually offered: Winter.", "units": "4", "description": "Introduction to heat transfer processes, steady and unsteady state   conduction, multidimensional analysis. Introduction to convective heat transfer.", "recommended_prep": "", "professor": "BENNETT", "college": "COE"},
"ME 151C": {"number": "151C", "sub_dept": "ME", "title": "", "dept": "ME", "prereqs": [["ME 151B"], ["ME 152B"]], "prereq_description": "ME 151B and 152B. Open to ME majors only.", "comments": "", "units": "3", "description": "Convective heat transfer, external and internal flow, forced and free  convection, phase change, heat exchangers. Introduction to radiative heat  transfer.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 152A": {"number": "152A", "sub_dept": "ME", "title": "Fluid Mechanics", "dept": "ME", "prereqs": [["MATH 5C", "MATH 6B", "ME 16"]], "prereq_description": "Mathematics 5C or Math 6B; and, ME 16 with a minimum grade of C-.", "comments": "Quarters usually offered: Fall.", "units": "4", "description": "Introduction to the fundamental concepts in fluid mechanics and basic  fluid properties. Basic equations of fluid flow. Dimensional analysis  and similitude. Hydrodynamics.", "recommended_prep": "", "professor": "MEINHART", "college": "COE"},
"ME 152B": {"number": "152B", "sub_dept": "ME", "title": "Fluid Mechanics", "dept": "ME", "prereqs": [["ME 152A"]], "prereq_description": "ME 152A. Open to ME majors only.", "comments": "", "units": "3", "description": "Incompressible viscous flow. Turbomachinery. Boundary-layer theory.    Introductory considerations for one-dimensional compressible flow.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 153": {"number": "153", "sub_dept": "ME", "title": "Introduction to Mechanical Engineering Design", "dept": "ME", "prereqs": [["ME 10"], ["ME 16"]], "prereq_description": "ME 10 and 16; open to ME majors only.", "comments": "Course materials fee required.", "units": "3", "description": "This course introduces engineering design with a focus on an iterative design process. Throughout the course, a group project cements the topics learned through active application to a real design problem. The lectures are broken into three sections.  Section 1 introduces a version of this iterative Design Cycle, which comprises four components: 1) Define, 2) Ideate, 3) Prototype &amp; Test, and 4) Analyze. These steps are repeated many times over the course of design development, not always in this order. Section 2 of the course focuses on applying this Design Cycle to the team project. Section 3 wraps up and focuses on presenting the project.", "recommended_prep": "", "professor": "BELTZ, TURNER, HAWKES", "college": "COE"},
"ME 154": {"number": "154", "sub_dept": "ME", "title": "Design and Analysis of Structures", "dept": "ME", "prereqs": [["ME 15"], ["ME 16"]], "prereq_description": "ME 15 with a minimum grade of C-; and, ME 16 with a minimum grade of C-;", "comments": "", "units": "3", "description": "Introductory course in structural analysis and design. The theories of   matrix structural analysis and finite element analysis for the solution  of analytical and design problems in structures are emphasized. Lecture  material includes structural theory compatibility method, slope    deflection method, displacement method, and virtual work. Topics include applications to bars, beams, trusses, frames, and solids.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 155A": {"number": "155A", "sub_dept": "ME", "title": "Control System Design", "dept": "ME", "prereqs": [["ME 17", "ME 163"]], "prereq_description": "ME 17 with a minimum grade of C-; ME 163.", "comments": "", "units": "3", "description": "The discipline of control and its application. Dynamics and feedback. The mathematical models: transfer functions and state space descriptions. Simple control design (PID). Assessment of a control problem, specification, fundamental limitations, codesign of system and control.", "recommended_prep": "", "professor": "BAMIEH, BULLO", "college": "COE"},
"ME 155B": {"number": "155B", "sub_dept": "ME", "title": "Advanced Control Systems Design", "dept": "ME", "prereqs": [["ME 155A"]], "prereq_description": "ME 155A.", "comments": "", "units": "3", "description": "Dynamic system modeling using state-space methods, controllability and observability, state-space methods for control design including pole placement, and linear quadratic regulator methods. Observers and observer-based feedback controllers. Sampled-data and digital control. Laboratory exercises using MATLAB for simulation and control design.", "recommended_prep": "", "professor": "BAMIEH", "college": "COE"},
"ME 155C": {"number": "155C", "sub_dept": "ME", "title": "Control Systems Laboratory", "dept": "ME", "prereqs": [["ME 155A"]], "prereq_description": "ME 155A.", "comments": "", "units": "3", "description": "An advanced lab course with experiments in dynamical systems and feedback control design. Students design, troubleshoot, and perform detailed, multi-session experiments.", "recommended_prep": "", "professor": "BAMIEH", "college": "COE"},
"ME 156A": {"number": "156A", "sub_dept": "ME", "title": "Mechanical Engineering Design - I", "dept": "ME", "prereqs": [["ME 14"], ["ME 15"], ["MATRL 101"]], "prereq_description": "ME 14, with a minimum grade of C-; and ME 15, with a minimum grade of C-; and MATRL 101", "comments": "", "units": "3", "description": "The rational selection of engineering materials, and the utilization of Ashby-  charts, stress, strain, strength, and fatigue failure consideration as applied to the design of machine elements. Lectures also support the development of system design concepts using assigned projects and involve the preparation of engineering reports and drawings.", "recommended_prep": "", "professor": "SUSKO", "college": "COE"},
"ME 156B": {"number": "156B", "sub_dept": "ME", "title": "Mechanical Engineering Design-II", "dept": "ME", "prereqs": [["ME 156A"]], "prereq_description": "ME 156A. Open to ME majors only.", "comments": "", "units": "3", "description": "Machine elements including gears, bearings and shafts. Joint design and  analysis: bolts, rivets, adhesive bonding and welding. Machine dynamics andfatigue. Design reliability and safety. Codes and standards. Topics coveredwill be applies in practical design projects.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 157": {"number": "157", "sub_dept": "ME", "title": "Introduction to Multiphysics Simulation", "dept": "ME", "prereqs": [["ENGR 151A"], ["ENGR 151B"], ["ENGR 152A"], ["ENGR 152B"]], "prereq_description": "Mechanical Engineering 151A-B; and Mechanical Engineering 152A-B", "comments": "Concurrently offered with ME 257. May not be taken for additional credit by students who have completed ME 125CM. May not be taken by students who have completed ME 225CM or ME 257.", "units": "3", "description": "Introduces students to the concepts of multiphysics simulation. Students are introduced to PDEs, associated analytical solutions, and the finite elements method. Multiphysics problems are solved in multiple domains, and with fluid/structure interactions. Each student conducts a project where multiphysics tools are used to explore details of multiphysical processes.", "recommended_prep": "", "professor": "MEINHART", "college": "COE"},
"ME 158": {"number": "158", "sub_dept": "ME", "title": "Computer Aided Design and Manufacturing", "dept": "ME", "prereqs": [["ME 10"], ["ME 156A"]], "prereq_description": "ME 10 and ME 156A; open to ME majors only.", "comments": "", "units": "3", "description": "Emphasis on programming, operation and design of automated manufacturing tools. Students learn to program CNC tools to make parts with G&amp;M Code and Mastercam CAM software. Students make parts in hands-on labs using CNC tools, 3D printers and laser cutters. Select topics in automated tool design and construction.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 162": {"number": "162", "sub_dept": "ME", "title": "Introduction to Elasticity", "dept": "ME", "prereqs": [["ME 15"], ["ME 140A"]], "prereq_description": "ME 15 and 140A.", "comments": "", "units": "3", "description": "Equations of equilibrium, compatibility, and boundary conditions.    Solutionsof two-dimensional problems in rectangular and polar coordinates. Eigen-solutions for the Wedge and Williams' solution for cracks. Stress  intensity factors. Extension, torsion, and bending. Energy theorems.   Introduction to wave propagation in elastic solids.", "recommended_prep": "", "professor": "MCMEEKING, BELTZ", "college": "COE"},
"ME 163": {"number": "163", "sub_dept": "ME", "title": "Engineering Mechanics: Vibrations", "dept": "ME", "prereqs": [["ME 16"]], "prereq_description": "ME 16 with a minimum grade of C-; open to ME majors only.", "comments": "Not open for credit to students who have completed ME 163B.", "units": "3", "description": "Topics relating to vibration in mechanical systems; exact and approximate  methods of analysis, matrix methods, generalized coordinates and     Lagrange's equations, applications of systems. Basic feedback systems  and controlled dynamic behavior.", "recommended_prep": "", "professor": "MCMEEKING, MEZIC", "college": "COE"},
"ME 166": {"number": "166", "sub_dept": "ME", "title": "Advanced Strength of Materials", "dept": "ME", "prereqs": [["ME 15"]], "prereq_description": "ME 15.", "comments": "", "units": "3", "description": "Analysis of statically determinate and indeterminate systems using   integration, area moment, and energy methods. Beams on elastic     foundations,curved beams stress concentrations, fatigue, and theories of failure for ductile and brittle materials. Photoelasticity and other   experimental techniques are covered, as well as methods of interpreting  in-service failures.", "recommended_prep": "", "professor": "TURNER", "college": "COE"},
"ME 167": {"number": "167", "sub_dept": "ME", "title": "Structural Analysis", "dept": "ME", "prereqs": [["ME 15"]], "prereq_description": "ME 15", "comments": "May not be taken for additional credit by students who have completed ME W 167.", "units": "3", "description": "Presents introductory matrix methods for analysis of structures. Topics include review of matrix algebra and linear equations, basic structural theorems including the principle of superposition and energy theorems, truss bar, bean and plane frame elements, and programming techniques to realize these concepts.", "recommended_prep": "", "professor": "YANG", "college": "COE"},
"ME W  167": {"number": "W  167", "sub_dept": "ME", "title": "Structural Analysis", "dept": "ME", "prereqs": [["ME 15"]], "prereq_description": "ME 15", "comments": "May not be taken for additional credit by students who have completed ME 167.", "units": "3", "description": "Presents introductory matrix methods for analysis of structures. Topics include review of matrix algebra and linear equations, basic structural theorems including the principle of superposition and energy theorems, truss bar, bean and plane frame elements, and programming techniques to realize these concepts.", "recommended_prep": "", "professor": "YANG", "college": "COE"},
"ME 169": {"number": "169", "sub_dept": "ME", "title": "Nonlinear Phenomena", "dept": "ME", "prereqs": [["PHYS 105A", "PHYS 103", "ME 163"]], "prereq_description": "Physics 105A or Physics 103; or ME 163 or upper-division standing in ECE.", "comments": "Same course as ECE 183 and Physics 106. Not open for credit to students  who have completed ECE 163C.", "units": "4", "description": "An introduction to nonlinear phenomena. Flows and bifurcations in one and  two dimensions, chaos, fractals, strange attractors. Applications to   physics, engineering, chemistry, and biology.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 179D": {"number": "179D", "sub_dept": "ME", "title": "Introduction to Robotics: Dynamics and Control", "dept": "ME", "prereqs": [["ECE 130A [O]", "ME 155A [O]"]], "prereq_description": "ECE 130A or ME 155A (may be taken concurrently)", "comments": "", "units": "4", "description": "Dynamic modeling and control methods for robotic systems. Lagrangian   method for deriving equations of motion, introduction to the Jacobian, and modeling and control of forces and contact dynamics at a robotic end effector. Laboratories encourage a problem-solving approach to control.", "recommended_prep": "", "professor": "BYL", "college": "COE"},
"ME 179L": {"number": "179L", "sub_dept": "ME", "title": "Introduction to Robotics: Design Laboratory", "dept": "ME", "prereqs": [["ENGR 3"], ["ME 6", "ECE 2A"]], "prereq_description": "Engr 3; and ME 6 or ECE 2A. Not open for credit to students who have", "comments": "Course materials fee required.", "units": "4", "description": "Design, programming, and testing of mobile robots. Design problems are   formulated in terms of robot performance. Students solve       electromechanical problems, developing skills in brainstorming,    concept selection, spatial reasoning, teamwork and communication. Robots are controlled with micro-controllers using C programming and interfaced to sensors and motors.", "recommended_prep": "", "professor": "PADEN", "college": "COE"},
"ME 179P": {"number": "179P", "sub_dept": "ME", "title": "Introduction to Robotics: Planning and Kinematics", "dept": "ME", "prereqs": [["ENGR 3"], ["ME 17 [O]", "ECE 130C [O]"]], "prereq_description": "Engr 3; and either ME 17 or ECE 130C (may be taken concurrently). Not open for credit to students", "comments": "", "units": "4", "description": "Motion planning and kinematics topics with an emphasis on geometric reasoning, programming and matrix computations. Motion planning: configuration spaces, sensor-based planning, decomposition and sampling methods, and advanced planning algorithms. Kinematics: reference frames, rotations and displacements, kinematic motion models.", "recommended_prep": "", "professor": "BULLO", "college": "COE"},
"ME 185": {"number": "185", "sub_dept": "ME", "title": "Materials in Engineering", "dept": "ME", "prereqs": [["MATRL 100B", "MATRL 101"]], "prereq_description": "Materials 100B or 101.", "comments": "Same course as Materials 185.", "units": "3", "description": "Introduces the student to the main families of materials and the principlesbehind their development, selection, and behavior. Discusses the generic properties of metals, ceramics, polymers, and composites more relevant   to structural applications. The relationship of properties to structure  and processing is emphasized in every case.", "recommended_prep": "", "professor": "LEVI, ODETTE", "college": "COE"},
"ME 186A": {"number": "186A", "sub_dept": "ME", "title": "Manufacturing and Materials", "dept": "ME", "prereqs": [["ME 151C"], ["ME 15"], ["MATRL 101", "MATRL 100C"]], "prereq_description": "ME 151C; and ME 15; and Materials 101 or Materials 100C", "comments": "Same course as Materials 186A.", "units": "3", "description": "Introduction to the fundamentals of common manufacturing processes and their interplay with the structure and properties of materials as they are transformed into products. Emphasis on process understanding and the key physical and basic mathematical relationships involved in each of the processes discussed.", "recommended_prep": "", "professor": "LEVI", "college": "COE"},
"ME 186B": {"number": "186B", "sub_dept": "ME", "title": "Introduction to Additive Manufacturing", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "", "units": "3", "description": "Introduction to additive manufacturing processes: review of  manufacturing methods and process selection consideration, economies of production, common additive manufacturing strategies, and brief description of the physics of photopolymerization, extrusion, selective laser melting and e-beam melting fabrication.", "recommended_prep": "", "professor": "BEGLEY", "college": "COE"},
"ME 189A": {"number": "189A", "sub_dept": "ME", "title": "Capstone Mechanical Engineering Design Project", "dept": "ME", "prereqs": [["ME 151C"], ["ME 152B"], ["ME 153"], ["ME 163"]], "prereq_description": "ME 151C; and ME 152B; and ME 153; and ME 163; or consent of instructor.", "comments": "Designed for majors. Concurrently offered with ART 189A. Quarters usually offered: Fall. A 3-quarter sequence with grades issued for each quarter. Students may not concurrently enroll in ME 197 and ME 189A-B-C with the same design project.  Course materials fee required.</div><div><strong>Repeat Comments:</strong> Course can only be repeated as a full sequence (189A-B-C). Not open to students who have completed ART 189A.", "units": "3", "description": "Students work in teams under the direction of a faculty advisor (and possibly an industrial sponsor) to tackle an engineering design project. Engineering communication, such as reports and oral presentations, are covered. Emphasis on practical, hands-on experience, and the integration of analytical and design skills.", "recommended_prep": "", "professor": "SUSKO", "college": "COE"},
"ME 189B": {"number": "189B", "sub_dept": "ME", "title": "Capstone Mechanical Engineering Design Project", "dept": "ME", "prereqs": [["ME 189A"]], "prereq_description": "ME 189A", "comments": "Designed for majors. Concurrently offered with ART 189B. Quarters usually offered: Winter. A 3-quarter sequence with grades issued for each quarter. Students may not concurrently enroll in ME 197 and ME 189A-B-C with the same design project.  Course materials fee required.</div><div><strong>Repeat Comments:</strong> Course can only be repeated as a full sequence (189A-B-C). Not open to students who have completed ART 189B.", "units": "3", "description": "Students work in teams under the direction of a faculty advisor (and possibly an industrial sponsor) to tackle an engineering design project. Engineering communication, such as reports and oral presentations, are covered. Course emphasizes practical, hands-on experience, and integrates analytical and design skills acquired in the companion ME 156 courses.", "recommended_prep": "", "professor": "SUSKO", "college": "COE"},
"ME 189C": {"number": "189C", "sub_dept": "ME", "title": "Capstone Mechanical Engineering Design Project", "dept": "ME", "prereqs": [["ME 189A"], ["ME 189B"]], "prereq_description": "ME 189A and 189B", "comments": "Designed for majors. Concurrently offered with ART 189C. Quarters usually offered: Spring. A 3-quarter sequence with grades issued for each quarter. Students may not concurrently enroll in ME 197 and ME 189A-B-C with the same design project.  Course materials fee required.</div><div><strong>Repeat Comments:</strong> Course can only be repeated as a full sequence (189A-B-C). Not open to students who have completed ART 189C.", "units": "3", "description": "Students work in teams under the direction of a faculty advisor (and possibly an industrial sponsor) to tackle an engineering design project. Engineering communication, such as reports and oral presentations, are covered. Course emphasizes practical, hands-on experience, and integrates analytical and design skills acquired in the companion ME 156 courses.", "recommended_prep": "", "professor": "SUSKO", "college": "COE"},
"ME 193": {"number": "193", "sub_dept": "ME", "title": "Internship in Industry", "dept": "ME", "prereqs": [], "prereq_description": "Consent of instructor. Prior departmental approval needed.", "comments": "Cannot be used as a departmental elective. May be repeated to a maximum of 2 units.", "units": "1", "description": "Students obtain credit for a mechanical engineering related internship   and/or industrial experience under faculty supervision. A 6-10 page    written report is required for credit. It may NOT be used to satisfy the engineering elective requirement for ME majors.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 197": {"number": "197", "sub_dept": "ME", "title": "Independent Projects in Mechanical Engineering Design", "dept": "ME", "prereqs": [["ME 16"]], "prereq_description": "ME 16; consent of instructor.", "comments": "May be repeated for a maximum of 12 units. No more than 4 units may be   used as departmental electives.", "units": "1-4", "description": "Special projects in design engineering. Course offers motivated students opportunity to synthesize academic skills by designing and building new  machines.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 199": {"number": "199", "sub_dept": "ME", "title": "Independent Studies in Mechanical Engineering", "dept": "ME", "prereqs": [], "prereq_description": "Consent of instructor; upper-division standing; completion of two", "comments": "Students must have a minimum 3.0 grade-point average for the preceding 3 quarters and are limited to 5 units per quarter and 30 units total in  all 98/99/198/199/199DC/199RA courses combined. May be repeated for  credit to a maximum of 12 units but no more than four units may be used  as departmental electives.", "units": "1-5", "description": "Directed individual study.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 200": {"number": "200", "sub_dept": "ME", "title": "Professional Seminar", "dept": "ME", "prereqs": [], "prereq_description": "Graduate standing.", "comments": "", "units": "1", "description": "A series of weekly lectures given by university staff and outside experts in all fields of mechanical engineering.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 200P": {"number": "200P", "sub_dept": "ME", "title": "M.S. Project", "dept": "ME", "prereqs": [], "prereq_description": "Graduate standing.", "comments": "", "units": "3", "description": "A ten-week individual research project on an advanced topic in     mechanical engineering.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 201": {"number": "201", "sub_dept": "ME", "title": "Advanced Dynamics", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "", "units": "3", "description": "Newton\u0012s laws and symmetries, Newton, Laplace and principle of     determinism, qualitative analysis of Newton\u0012s equations of motion,   Hamiltonian mechanics, one degree of freedom (DOF) systems, two DOF    systems, motion in central fields, application to molecular dynamics,  control of classical dynamical systems, Lagrangian mechanics, chaos and  ergodic theory, rigid body motion.", "recommended_prep": "", "professor": "MEZIC</span> <i>", "college": "COE"},
"ME 203": {"number": "203", "sub_dept": "ME", "title": "Operator Theory Methods in Dynamical Systems", "dept": "ME", "prereqs": [["ME 201"]], "prereq_description": "ME 201.", "comments": "", "units": "3", "description": "Geometric mechanics, volume-preserving dynamical systems, molecular  dynamics; Infinite dimensional dynamics and finite dimensional     approximations including incompressible Euler equations and point  vortex theory, transport and fluid mixing, control of        measure-preserving systems, equilibrium and non-  equilibrium statistical  mechanics methods for vortex gases.", "recommended_prep": "", "professor": "MEZIC", "college": "COE"},
"ME 207": {"number": "207", "sub_dept": "ME", "title": "Faculty Research Seminar", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "", "units": "1", "description": "A series of bi-weekly presentations given by ladder faculty members to   familiarize graduate students with current department research projects. This course is required to be taken by all graduate students within the  first year of arrival.", "recommended_prep": "", "professor": "KHAMMASH</span> <i>", "college": "COE"},
"ME 210A": {"number": "210A", "sub_dept": "ME", "title": "Matrix Analysis and Computation", "dept": "ME", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "Students should be proficient in basic numerical methods, linear algebra,  mathematically rigorous proofs, and some programming language. Same course as Computer Science 211A, ECE 210A, Mathematics 206A, Chemical Engineering 211A, and Geology 251A.", "units": "4", "description": "Graduate level-matrix theory with introduction to matrix computations.   SVD's, pseudoinverses, variational characterization of eigenvalues,    perturbation theory, direct and iterative methods for matrix computations.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 210B": {"number": "210B", "sub_dept": "ME", "title": "Numerical Simulation", "dept": "ME", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "Students should be proficient in basic numerical methods, linear algebra,  mathematically rigorous proofs, and some programming language. Same course as Computer Science 211B, ECE 210B, Mathematics 206B, and Chemical   Engineering 211B and Geology 251B.", "units": "4", "description": "Linear multistep methods and Runge-Kutta methods for ordinary differential equations: stability, order and convergence. Stiffness. Differential   algebraic equations. numerical solution of boundary value problems.", "recommended_prep": "", "professor": "PETZOLD", "college": "COE"},
"ME 210C": {"number": "210C", "sub_dept": "ME", "title": "", "dept": "ME", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "Students should be proficient in basic numerical methods, linear algebra,  mathematically rigorous proofs, and some programming language. Same course as Computer Science 211C, ECE 210C, Mathematics 206C, Chemical Engineering 211C, and Geolgy 251C.", "units": "4", "description": "Finite difference methods for hyperbolic, parabolic and elliptic PDE's,  with application to problems in science and engineering. Convergence,  consistency, order and stability of finite difference methods. Dissipation and dispersion. Finite volume methods. Software design and adaptivity.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 210D": {"number": "210D", "sub_dept": "ME", "title": "Numerical Solution of Partial Differential Equations - Finite Element  Methods", "dept": "ME", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "Students should be proficient in basic numerical methods, linear algebra,  mathematically rigorous proofs, and some programming language. Same course as Computer Science 211D, ECE 210D, Mathematics 206D, Chemical Engineering 211D, and Geology 251D.", "units": "4", "description": "Weighted residual and finite element methods for the solution of     hyperbolic, parabolic and elliptical partial differential equations, with  application to problems in science and engineering. Error estimates.   Standard and discontinuous Galerkin methods.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 211": {"number": "211", "sub_dept": "ME", "title": "Pattern Formation and Self-Organization", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "", "units": "3", "description": "Introductory course to the processes of pattern formation and self-  organization in natural systems (physical and biological systems), as  well as in engineering. The goal of the course is to explain how   ordered spatial structures appear in different systems. We will    discuss the common aspects and the differences in the mechanisms that  establish the patterns, and introduce various techniques used in   different disciplines to study the formation of spatially extended   structures.", "recommended_prep": "", "professor": "CAMPAS</span> <i>", "college": "COE"},
"ME 215A": {"number": "215A", "sub_dept": "ME", "title": "Applied Dynamical Systems I", "dept": "ME", "prereqs": [], "prereq_description": "Graduate standing.", "comments": "", "units": "3", "description": "Phase-plane methods, non-linear oscillators, stability of fixed points   and periodic orbits, invariant manifolds, structural stability, normal   form theory, local bifurcations for vector fields and maps, applications from engineering, physics, chemistry, and biology.", "recommended_prep": "", "professor": "MOEHLIS", "college": "COE"},
"ME 215B": {"number": "215B", "sub_dept": "ME", "title": "Applied Dynamical Systems II", "dept": "ME", "prereqs": [["ME 215A"]], "prereq_description": "ME 215A; graduate standing.", "comments": "", "units": "3", "description": "Local codimension two bifurcations, global bifurcations, chaos for vector  fields and maps, Smale horshoe, symbolic dynamics, strange attractors,   universality, bifyrcation with symmetry, perturbation theory and     averaging, Melnikov's method, canards, applications from engineering,  physics, chemistry, and biology.", "recommended_prep": "", "professor": "MOEHLIS", "college": "COE"},
"ME 216": {"number": "216", "sub_dept": "ME", "title": "Level Set Methods", "dept": "ME", "prereqs": [["CMPSC 211C", "CH E 211C", "ECE 210C", "ME 210C"]], "prereq_description": "CMPSC 211C or CH E 211C or ECE 210C or ME 210C.", "comments": "Same course as CH E 226, ECE 226, and CMPSC 216.", "units": "4", "description": "Mathematical description of the level set method and design of the   numerical methods used in its implementations (ENO-WENO, Godunov,    Lax-Friedrich, etc.). Introduction to the Ghost Fluid Method.    Applications in CFD, Materials Sciences, Computer Vision and Computer  Graphics.", "recommended_prep": "", "professor": "GIBOU", "college": "COE"},
"ME 219": {"number": "219", "sub_dept": "ME", "title": "Mechanics of Materials", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "Same course as Materials 207.", "units": "3", "description": "Matrices and tensors, stress and deformation, compatibility and    equilibrium conditions, constitutive equations, and boundary conditions, applications in elasticity, plasticity and fracture.", "recommended_prep": "", "professor": "MCMEEKING, BEGLEY, BELTZ", "college": "COE"},
"ME 220A": {"number": "220A", "sub_dept": "ME", "title": "Fundamentals of Fluid Mechanics", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "", "units": "3", "description": "Introductory course in fluid mechanics. Basic equations of motion    (continuity, momentum, energy, vorticity), coordinate transformations,   \"potential\" flow, thin airfoil theory, conformal mapping, vortex dynamics, boundary layers, stability theory, laminar/turbulent transition,     turbulence. Inviscid/viscid, irrotational/rotational, incompressible/  compressible flow examples.", "recommended_prep": "", "professor": "</span> <i>", "college": "COE"},
"ME 220B": {"number": "220B", "sub_dept": "ME", "title": "Fundamentals of Fluid Mechanics", "dept": "ME", "prereqs": [["ME 151A"], ["ME 151B"], ["ME 152A"], ["ME 152B"]], "prereq_description": "ME 151A-B and ME 152A-B.", "comments": "", "units": "3", "description": "Introductory course in fluid mechanics. Basic equations of motion    (continuity, momentum, energy, vorticity), coordinate transformations,   \"potential\" flow, this airfoil theory, conformal mapping, vortex     dynamics, boundary layers, stability theory, laminar/turbulent transition, turbulence.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 221": {"number": "221", "sub_dept": "ME", "title": "Advanced Viscous Flow", "dept": "ME", "prereqs": [["ME 220A"]], "prereq_description": "ME 220A.", "comments": "", "units": "3", "description": "Review the Navier-Stokes equations in velocity, pressure, and vorticity  variables. Analyze details of important low and moderate reynolds number flow applications and then high reynolds number flows with boundary layer  phenomena. Compare exact, approximate, numerical, and experimental solutionmethods.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 225AAZZ": {"number": "225AAZZ", "sub_dept": "ME", "title": "Special Topics in Mechanical Engineering", "dept": "ME", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "3", "description": "Specialized courses dealing with advanced topics and recent developments inone or more of the following areas: dynamic systems, control and robotics, fluid mechanics, materials science and engineering, ocean engineering,   solid mechanics and structures, thermal sciences.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 226": {"number": "226", "sub_dept": "ME", "title": "Applied Numerical Methods", "dept": "ME", "prereqs": [["ME 140A"]], "prereq_description": "ME 140A.", "comments": "", "units": "3", "description": "An introduction to the numerical solution of ordinary and partial    differential equations by means of finite difference and finite element  procedures.", "recommended_prep": "", "professor": "GIBOU", "college": "COE"},
"ME 230": {"number": "230", "sub_dept": "ME", "title": "Elasticity and Plasticity", "dept": "ME", "prereqs": [["ME 219", "MATRL 207"]], "prereq_description": "ME 219 or MATRL 207", "comments": "Same course as Materials 230.", "units": "3", "description": "Review field equations of elasticity and plasticity. Energy principles and uniqueness theorems. Elementary problems in one and two    dimensions, stress functions, and complex variable methods. Plastic  stress-strain laws; flow potentials. Torsion and bending of plastic  flow, slip line theory. Bounding theorems.", "recommended_prep": "", "professor": "MCMEEKING, BEGLEY", "college": "COE"},
"ME 232": {"number": "232", "sub_dept": "ME", "title": "Plasticity", "dept": "ME", "prereqs": [["ME 219"]], "prereq_description": "ME 219.", "comments": "Same course as Materials 232.", "units": "3", "description": "Plastic, creep, and relaxation behavior of solids. Mechanics of    inelastically strained bodies; plastic stress-strain laws; flow    potentials.Torsion and bending of prismatic bars, expansion of thick   shells, plane plastic flow, slip line theory. Variational formulations,  approximate methods.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 233A": {"number": "233A", "sub_dept": "ME", "title": "Design of Composite Structures", "dept": "ME", "prereqs": [["ME 230", "ME 275A"]], "prereq_description": "ME 230 or ME 275A.", "comments": "", "units": "3", "description": "Emphasis is placed on the differences of design with composites vis a vis  the design of conventional metallic structures. The content is directed at the class of polymermatrix composites.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 236": {"number": "236", "sub_dept": "ME", "title": "NONLINEAR CONTROL SYSTEMS", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "SAME COURSE AS ECE 236.", "units": "4", "description": "ANALYSIS AND DESIGN OF NONLINEAR CONTROL SYSTEMS. FOCUS ON LYAPUNOV    STABILITY THEORY, WITH SUFFICIENT TIME DEVOTED TO CONTRASTS BETWEEN LINEAR AND NONLINEAR SYSTEMS, INPUT-OUTPUT STABILITY AND THE DESCRIBING FUNCTION  METHOD.", "recommended_prep": "ECE 230A.", "professor": "KOKOTOVIC, TEEL", "college": "COE"},
"ME 238": {"number": "238", "sub_dept": "ME", "title": "Advanced Control Design Laboratory", "dept": "ME", "prereqs": [["ME 243A", "ECE 230A"], ["ME 243B"]], "prereq_description": "ME 243A/ECE 230A and at least one class among the following: ME 243B/ECE", "comments": "", "units": "4", "description": "A laboratory course requiring students to design and implement advanced control systems on a physical experiment. Experiments from any engineering or scientific discipline are chosen by the student.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 243A": {"number": "243A", "sub_dept": "ME", "title": "Linear Systems I", "dept": "ME", "prereqs": [["ECE 210A"]], "prereq_description": "ECE 210A.", "comments": "Same course as ECE 230A.", "units": "4", "description": "Internal and external descriptions. Solution of state equations.     Controllability and observability realizations. Pole assignment,     assignment, observers; modern compensator design. Distribance localization and decoupling. Least-squares control. Least-squares estimation; Kalman  filters; smoothing. The seperation theorem; LQG compensator design.    Computational considerations. Selected additional topics.", "recommended_prep": "", "professor": "KOKOTOVIC, BAMIEH", "college": "COE"},
"ME 243B": {"number": "243B", "sub_dept": "ME", "title": "Linear Systems II", "dept": "ME", "prereqs": [["ECE 140", "ECE 230A", "ME 243A"], ["ME 210A"]], "prereq_description": "ECE 140; 230A or ME 243A; and ME 210A.", "comments": "Same course as ECE 230B.", "units": "4", "description": "Internal and external descriptions. Solution of state equations.     Controllability and observability realizations. Pole assignment,     assignment, observers; modern compensator design. Distribance localization and decoupling. Least-squares control. Least-squares estimation; Kalman  filters; smoothing. The seperation theorem; LQG compensator design.    Computational considerations. Selected additional topics.", "recommended_prep": "", "professor": "KOKOTOVIC, BAMIEH", "college": "COE"},
"ME 244A": {"number": "244A", "sub_dept": "ME", "title": "Advanced Theoretical Methods in Engineering", "dept": "ME", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "Same course as Chemical Engineering 230A.", "units": "4", "description": "Methods of solution of partial differential equations and boundary value problems. Linear vector and function spaces, generalized fourier analysis, Sturm-Liouville theory, calculus of variations, and conformal mapping  techniques.", "recommended_prep": "", "professor": "FREDRICKSON", "college": "COE"},
"ME 244B": {"number": "244B", "sub_dept": "ME", "title": "Advanced Theoretical Methods in Engineering", "dept": "ME", "prereqs": [["ENGR 244A"]], "prereq_description": "Mechanical Engineering 244A and consent of instructor.", "comments": "Same course as Chemical Engineering 230B.", "units": "3", "description": "Advanced mathematical methods for engineers and scientists. Complex    analysis, integral equations and Green's functions. Asymptotic analysis of integrals and sums. Boundary layer methods and WKB theory.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 245": {"number": "245", "sub_dept": "ME", "title": "Modeling and Control of Spatially Distributed Systems", "dept": "ME", "prereqs": [["ME 243B", "ECE 230B"]], "prereq_description": "ME 243B or ECE 230B or consent of instructor.", "comments": "", "units": "4", "description": "Modeling, dynamics, and control of spatially distributed systems   described by partial differential equations or dynamical systems on  lattices.  The emphasis is on linear, constructive, and algebraic    techniques, with motivation from physical examples such as oscillator  networks and hydrodynamic stability.", "recommended_prep": "", "professor": "BAMIEH", "college": "COE"},
"ME 246": {"number": "246", "sub_dept": "ME", "title": "Molecular and Cellular Biomechanics", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "Concurrently offered with ME 146. Quarters usually offered: Fall.", "units": "3", "description": "Course introduces fundamental concepts in molecular and cellular     biomechanics. Will consider the role of physical, thermal and chemical   forces, examine their influence on cell strength and elasticity, and   explore the properties of enzymatically-active materials.", "recommended_prep": "", "professor": "VALENTINE", "college": "COE"},
"ME 252A": {"number": "252A", "sub_dept": "ME", "title": "Computational Fluid Dynamics", "dept": "ME", "prereqs": [["ME 210C", "CMPSC 211C", "ECE 210C", "MATH 206C", "ENGR 211C"]], "prereq_description": "ME 210C or Computer Science 211C or ECE 210C or Mathematics 206C or ChemicaEngineering 211C.", "comments": "", "units": "3", "description": "Numerical simulation of fluid flows. Basic discretization techniques for parabolic, elliptic, and hyperbolic conservation laws. Stability and   accuracy. Diffusion equation, linear convection equation.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 252B": {"number": "252B", "sub_dept": "ME", "title": "Computational Fluid Dynamics", "dept": "ME", "prereqs": [["ME 210C", "CMPSC 211C", "ECE 210C", "MATH 206C", "ENGR 211C"]], "prereq_description": "ME 210C or Computer Science 211C or ECE 210C or Mathematics 206C or ChemicaEngineering 211C.", "comments": "", "units": "3", "description": "Discussion of appropriate boundary conditions. Nonlinear convection    dominated problems, curvilinear coordinates, basics of grid generation.  Inviscid flow, boundary layer flow, incompressible Navier-Stokes flows.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 254": {"number": "254", "sub_dept": "ME", "title": "Optimal Control of Dynamic Systems", "dept": "ME", "prereqs": [["ME 243A", "ECE 230A"]], "prereq_description": "ME 243A or ECE 230A or equivalent", "comments": "THIS COURSE IS CROSS-LISTED WITH ECE 271C.", "units": "4", "description": "Calculus of variations and Gateaux and Frechet derivatives.  Optimization in dynamic systems and Pontryagin's principle. Invariant Imbedding and deterministic and stochastic Dynamic Programming.  Numerical solutions of optimal control problems.  Min-max problems and differential games. Extensive treatment of Linear Quadratic Problems.", "recommended_prep": "", "professor": "BAMIEH", "college": "COE"},
"ME 256": {"number": "256", "sub_dept": "ME", "title": "Introductory Robust Control with Applications", "dept": "ME", "prereqs": [["ECE 230A", "ME 255A", "ECE 230B [O]", "ME 243B [O]"]], "prereq_description": "ECE 230A or ME 255A; and, ECE 230B or ME 243B (may be taken concurrently).", "comments": "Same course as ECE 232.", "units": "4", "description": "Robust Control theory; uncertainty modeling; stability of systems in the presence of norm-bounded perturbations; induced norm performance problems; structured singular value analysis; H-infinity control theory; model reduction; computer simulation based design project involving practical problems.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 257": {"number": "257", "sub_dept": "ME", "title": "Introduction to Multiphysics Simulation", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "Concurrently offered with ME 157.", "units": "3", "description": "Introduces students to the concepts of multiphysics simulation. Students are introduced to PDE's, associated analytical solutions, and the  finite element method. Multiphysics problems are solved in multiple  domains, and with fluid/structure interactions. Each student conducts a  project where multiphysics tools are used to explore details of    multiphysical processes.", "recommended_prep": "", "professor": "MEINHART", "college": "COE"},
"ME 258": {"number": "258", "sub_dept": "ME", "title": "Methods in Mechanobiology and Biofabrication", "dept": "ME", "prereqs": [], "prereq_description": "The course assumes an engineering background but is structured to be accessible to graduate students in life sciences who have a strong physics and math background, and to engineering graduate students with basic biology knowledge.", "comments": "Same course as BMSE 258.", "units": "3", "description": "Cell mechanobiology topics including cell structure, mechanical models, and chemo-mechanical signaling. Review and apply methods for controlling and analyzing the biomechanics of cells using traction force microscopy, AFM, micropatterning, and cell stimulation. Practice and theory for the design and application of methods for quantitative cell mechanobiology. Weekly lecture and hands-on laboratory sessions. Final project in the form of a research proposal.", "recommended_prep": "Students should have a grounding in Physics/Mechanics, Biology, Differential equations, Linear Algebra, and familiarity with use of a scripting language like MATLAB for analyses.", "professor": "PRUITT", "college": "COE"},
"ME 264": {"number": "264", "sub_dept": "ME", "title": "Mechanical Behavior of Materials", "dept": "ME", "prereqs": [["ME 219"]], "prereq_description": "ME 219; consent of instructor.", "comments": "Same course as Materials 220.", "units": "3", "description": "Concepts of stress and strain. Deformation of metals, polymers, and ceramics. Elasticity, viscoelasticity, plastic flow, and creep. Linear elastic fracture mechanics. Mechanisms of ductile and brittle fracture.", "recommended_prep": "", "professor": "ZOK, ODETTE", "college": "COE"},
"ME 265": {"number": "265", "sub_dept": "ME", "title": "Composite Materials", "dept": "ME", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "Same course as Materials 261.", "units": "3", "description": "Stress and strain relations in composites. Residual stresses. The fracture resistance of organic and inorganic matrix composites. Statistical aspects of fiber failure. Composite laminates and delamination cracks. Cumulative  damage concepts. Interface properties. Design criteria.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 267": {"number": "267", "sub_dept": "ME", "title": "Thin Films and Multilayers", "dept": "ME", "prereqs": [["MATRL 207", "ME 219"]], "prereq_description": "Materials 207 (same course as ME 219); consent of instructor", "comments": "", "units": "3", "description": "The development of stresses in thin films and its relaxation. Edge   effects and discontinuities. Cracks in films and at interfaces.    Delamination of residually stressed films. Buckling and buckle     propagation of compressed films. Cyclic behavior and ratcheting    effects.", "recommended_prep": "", "professor": "BEGLEY", "college": "COE"},
"ME 269": {"number": "269", "sub_dept": "ME", "title": "Network Systems: Dynamics and Control", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Motivating socio/economic networks, power grids, multi-  agent robotics. Perron-  Frobenius matrix theory and algebraic graph theory. Fundamental dynamics in networks: averaging dynamics in discrete and continuous  time; positive and compartmental systems; robotic coordination problems; coupled oscillator systems; virus propagation models; population dynamic models.", "recommended_prep": "", "professor": "BULLO</span> <i>", "college": "COE"},
"ME 271": {"number": "271", "sub_dept": "ME", "title": "Finite Element Structural Analysis", "dept": "ME", "prereqs": [["ME 219"]], "prereq_description": "ME 219.", "comments": "Same course as Materials 240.", "units": "3", "description": "Definitions and basic element operations displacement approach in linear elasticity. Element formulation: direct methods and variational methods. Global analysis procedures: assemblage and solution. Plane stress and  plane strain. Solids of revolution and general solids. Isoparametric   representation and numerical integration. Computer implementation.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 275": {"number": "275", "sub_dept": "ME", "title": "Fracture Mechanics", "dept": "ME", "prereqs": [["ME 219"]], "prereq_description": "ME 219.", "comments": "Same course as Materials 234.", "units": "3", "description": "Analytic solutions of a stationary crack under static loading. Elastic and elastoplastic analysis. The J integral. Energy balance and crack growth. Criteria for crack initiation and growth. Dynamic crack propagation.   Fatigue. The micromechanics of fracture.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 291A": {"number": "291A", "sub_dept": "ME", "title": "Physics of Transducers", "dept": "ME", "prereqs": [], "prereq_description": "Graduate standing.", "comments": "", "units": "3", "description": "The use of concepts in electromagnetic theory and solid state physics  to describe capacitive, piezoresistive, piezoelectric and tunneling    transduction mechanisms and analyze their applications in microsystems   technology.", "recommended_prep": "", "professor": "SOH", "college": "COE"},
"ME 292": {"number": "292", "sub_dept": "ME", "title": "Design of Transducers", "dept": "ME", "prereqs": [], "prereq_description": "graduate standing", "comments": "", "units": "3", "description": "Design issues associated with microscale transduction. Electrodynamics,  linear and nonlinear mechanical behavior, sensing methods, MEMS-specific fabrication rules, and layout are all covered. Modeling techniques for electromechanical systems are also discussed.", "recommended_prep": "", "professor": "PENNATHUR, TURNER", "college": "COE"},
"ME 295": {"number": "295", "sub_dept": "ME", "title": "Group Studies: Controls, Dynamical Systems, and Computation", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "Same course as ECE 295, Computer Science 592, and Chemical Engineering   295.", "units": "1", "description": "A series of weekly lectures given by university staff and outside experts  in the fields of control systems, dynamical systems, and computation.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"ME 501": {"number": "501", "sub_dept": "ME", "title": "Teaching Assistant Practicum", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "Normally required of students serving as teaching assistants. No unit  credit allowed towards advanced degree.", "units": "1-4", "description": "Practical experience in the various activities associated with teaching, including lecturing, supervision of laboratories and discussion sections,  preparation and grading of homework and exams.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 503": {"number": "503", "sub_dept": "ME", "title": "Research Assistant Practicum", "dept": "ME", "prereqs": [], "prereq_description": "", "comments": "Will not count as unit credit towards M.S. or Ph.D. degree in mechanical engineering.", "units": "1-4", "description": "Practical experience in the various activities associated with research, including experimental work, theoretical work and analyses, and assisting  department faculty and other professional researchers in their duties.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 596": {"number": "596", "sub_dept": "ME", "title": "Directed Research", "dept": "ME", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "Not applicable to course requirement for M.S. or Ph.D. degree. S/U grading.", "units": "1-12", "description": "Experimental or theoretical research undertaken under the direction of   a faculty member for graduate students who have not yet advanced to    candidacy.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 597": {"number": "597", "sub_dept": "ME", "title": "Individual Study for Ph.D. Qualifying Examination", "dept": "ME", "prereqs": [], "prereq_description": "Graduate standing.", "comments": "No unit credit allowed toward advanced degree. Maximum of 12 units per   quarter; enrollment limited to 24 units per examination. Instructor is   normally student's major advisor. S/U grading.", "units": "1-12", "description": "Individual studies for ph.d. qualifying examination.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 598": {"number": "598", "sub_dept": "ME", "title": "Master's Thesis Research and Preparation", "dept": "ME", "prereqs": [], "prereq_description": "Consent of thesis adviser.", "comments": "No unit credit allowed toward advanced degree.", "units": "1-12", "description": "For research underlying the thesis and writing of the thesis.", "recommended_prep": "", "professor": "", "college": "COE"},
"ME 599": {"number": "599", "sub_dept": "ME", "title": "Ph.D. Dissertation Research and Preparation", "dept": "ME", "prereqs": [], "prereq_description": "Consent of dissertation adviser.", "comments": "No unit credit allowed toward advanced degree.", "units": "1-12", "description": "For research and preparation of the dissertation.", "recommended_prep": "", "professor": "", "college": "COE"}
}