{"EDS 211": {"title": "Team Science, Collaborative Analysis and Project Management", "dept": "ESM", "sub_dept": "EDS", "number": "211", "prereqs": [], "prereq_description": "", "comments": "", "units": "2", "description": "Science in general, and data science in particular, are more and more requiring team science approaches to addressing the most pressing questions. Managing team science projects is therefore becoming an increasingly important skill for any scientist. This course explores the principles and practical tools available for effective and efficient project management.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 212": {"title": "Essential Math for Environmental Data Science", "dept": "ESM", "sub_dept": "EDS", "number": "212", "prereqs": [], "prereq_description": "", "comments": "", "units": "2", "description": "Review of quantitative methods that are commonly used in environmental science. The course covers single and multi-variable functions and graphing, basic linear algebra, complex numbers, integral calculus and simple differential equations.", "recommended_prep": "", "professor": "HORST</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 213": {"title": "Metadata Standards, Data Modeling and Data Semantics", "dept": "ESM", "sub_dept": "EDS", "number": "213", "prereqs": [], "prereq_description": "", "comments": "", "units": "2", "description": "Metadata is the information that provides the context for environmental data, rendering it usable by programs and intelligible to humans. This course introduces students to the ontologies that define, and the tools needed to compose, standard environmental metadata. Examples drawn from evaluating fitness-for-use, synthesizing composite datasets, and reusing historical datasets will motivate the need for correct and complete metadata.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 214": {"title": "Analytical Workflows and Scientific Reproducibility", "dept": "ESM", "sub_dept": "EDS", "number": "214", "prereqs": [], "prereq_description": "", "comments": "", "units": "2", "description": "The generation and analysis of environmental data is often a complex, multi-step process that may involve the collaboration of many people. Increasingly tools that document help to organize and document workflows are being used to ensure reproducibility and transparency of the results. This course introduces students to conceptual organization of workflows as a way to conduct reproducible analyses, as well as various software tools that help users to manage multi-step processes that requires tools for storing, managing and sharing workflows, code, documents and data, including GitHub, Pegasus, remake and Kepler.", "recommended_prep": "", "professor": "BRUN</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 216": {"title": "Meta-analysis and Systematic Reviews", "dept": "ESM", "sub_dept": "EDS", "number": "216", "prereqs": [], "prereq_description": "", "comments": "", "units": "2", "description": "Synthesis tools in environmental science are rapidly evolving and becoming standard, formalized tools for review and assessment. Synthesis can include data aggregation, narrative reviews, systematic reviews, and meta-analysis. Meta-analyses in particular are often viewed as the gold-standard methodology to quantitatively estimate the state-of-the-art of a research domain. The analytics and assumptions have changed significantly within the last 5 years. Key topics covered in this course include effect sizes, scope of inference, and statistical analyses using weighted measures.", "recommended_prep": "", "professor": "JASECHKO</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 217": {"title": "Python for Environmental Data Science", "dept": "ESM", "sub_dept": "EDS", "number": "217", "prereqs": [], "prereq_description": "None required", "comments": "", "units": "4", "description": "This course teaches the fundamentals of programming in Python. Students learn foundational skills and concepts including data structures, programming basics, and how to clean, subset, aggregate, transform and visualize data. Course materials demonstrate the application of these techniques for environmental data analysis and problem solving.", "recommended_prep": "", "professor": "STAFF", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 220": {"title": "Working with Environmental Data", "dept": "ESM", "sub_dept": "EDS", "number": "220", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Introduces students to the broad range of data sets used to monitor and understand human and natural systems. Covers field and station data, remote sensing products, and large-scale climate datasets including climate model projections. Skills include evaluating data collection and quality control methods used in existing datasets, and working with existing databases of time-series and spatial information including cloud computing databases and new repositories of environmental datasets. Students learn basic workflows for selecting, obtaining, and visualizing datasets, and best practices for reliable data intercomparisons.", "recommended_prep": "", "professor": "STEVENSON</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 221": {"title": "Scientific Programming Essentials", "dept": "ESM", "sub_dept": "EDS", "number": "221", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "This course teaches key scientific programming skills and demonstrates the application of these techniques to environmental data analysis and problem solving. Topics include structured programming and algorithm development, flow control, simple and advanced data input-output and representation, functions and objects, documentation, testing and debugging. The course is taught using a combination of the R and Python programming languages.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 222": {"title": "Statistics for Environmental Data Science", "dept": "ESM", "sub_dept": "EDS", "number": "222", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Teaches a variety of statistical techniques commonly used to analyze environmental data sets and quantitatively address environmental questions with empirical data. Covers fundamental statistical concepts and tools, including sampling and study design, linear regression, inference, and time series analysis, as well as foundational concepts of spatial and space-time dependency and associated impacts on inference.", "recommended_prep": "", "professor": "CARLETON</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 223": {"title": "Geospatial Analysis and Remote Sensing", "dept": "ESM", "sub_dept": "EDS", "number": "223", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Introduces the spatial modeling and analytic techniques of geographic information science to data science students. The emphasis is on deep understanding of spatial data models and the analytic operations they enable. Recognizing remotely sensed data as a key data type within environmental data science, this course also introduces fundamental concepts and applications of remote sensing. In addition to this theoretical background, students become familiar with libraries, packages, and APIs that support spatial analysis in R.", "recommended_prep": "", "professor": "OLIVER</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 230": {"title": "Modeling Environmental Systems", "dept": "ESM", "sub_dept": "EDS", "number": "230", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Computer-based modeling and simulation for practical environmental problem solving and environmental research. The course covers both the selection and application of existing models and best practices for designing new models. Topics include conceptual models, static and dynamic models, spatial models, and models of diffusion, growth and disturbance. Techniques include sensitivity analysis, calibration and model scenario design.", "recommended_prep": "", "professor": "TAGUE</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 231": {"title": "Text and Sentiment Analysis for Environmental Problems", "dept": "ESM", "sub_dept": "EDS", "number": "231", "prereqs": [], "prereq_description": "", "comments": "", "units": "2", "description": "Covers foundations and applications of natural language processing. Problem sets and class projects leverage common and emerging text-based data sources relevant to environmental problems, including but not limited to social media feeds (e.g., twitter) and text documents (e.g., agency reports), and builds capacity and experience in common tools, including text processing and classification, semantics, and natural language parsing.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 232": {"title": "Machine Learning in Environmental Science", "dept": "ESM", "sub_dept": "EDS", "number": "232", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Machine learning can help process big/complex data and extract knowledge. It forms one of the foundations in data science. This course provides a broad introduction to machine learning and statistical pattern recognition. Topics include supervised learning (decision tree, random forest, support vector machines, neural networks) and unsupervised learning (clustering, dimensionality reduction, deep learning). Problems and exercises are framed within environmental science applications. The course uses programming languages like R and Python to support learning how to do advanced scientific programming to solve real environmental problems.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 240": {"title": "Data Visualization and Communication", "dept": "ESM", "sub_dept": "EDS", "number": "240", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Effective display and analysis of scientific information is a critical skill. This course includes a discussion of the theory of good visual design and interactive analysis and also presents software tools and techniques supporting visual analysis. Students learn how to ask an interesting data question through MySQL, learn processing software to visualize it in 2D, do a 3D interactive visualization, then follow with a project of a data of their choice. Additional topics include dynamic and interactive visualization and web-based visualization frameworks.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 241": {"title": "Environmental Policy Evaluation", "dept": "ESM", "sub_dept": "EDS", "number": "241", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "This course presents state of the art program evaluation techniques necessary to evaluate the impact of environmental policies. The program evaluation methods presented aim at identifying and measuring the causal effect of policies, regulations, and interventions on environmental outcomes of interest. Students learn the research designs and methods for estimating causal effects with experimental and non-experimental data. This will prepare students for interpreting and conducting high-quality empirical research, with applications in cross-sectional data and panel data settings.", "recommended_prep": "", "professor": "DESCHENES</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 242": {"title": "Ethics &amp; Bias in Environmental Data Science", "dept": "ESM", "sub_dept": "EDS", "number": "242", "prereqs": [], "prereq_description": "", "comments": "", "units": "2", "description": "This course focuses on ethical considerations in collecting, using, and reporting environmental data, and how to recognize and account for biases in algorithms, training data, and methodologies. Students also examine the human and societal implications of these issues within environmental data science.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 411A": {"title": "Capstone Project", "dept": "ESM", "sub_dept": "EDS", "number": "411A", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "First quarter of a two-quarter group study/analysis of how to apply data science and tools to an environmental problem. In this quarter students are expected to work with their project client to finalize project plans, assign individual roles and responsibilities, develop a project plan and deliverables, and make significant headway on implementing those plans.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 411B": {"title": "Capstone Project", "dept": "ESM", "sub_dept": "EDS", "number": "411B", "prereqs": [], "prereq_description": "EDS 411A", "comments": "", "units": "4", "description": "Second quarter of a two-quarter group study/analysis of how to apply data science and tools to an environmental problem. In this quarter students are expected to complete all project plans and deliverables, write and submit a project report, give an oral defense of the project, present the research to a general audience, and produce a policy brief of the main results.", "recommended_prep": "", "professor": "STAFF", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []},
"EDS 430": {"title": "Workshop in Environmental Data Science", "dept": "ESM", "sub_dept": "EDS", "number": "430", "prereqs": [], "prereq_description": "", "comments": "", "units": "1", "description": "", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "BREN", "offered": [], "majors_required_for": [], "majors_optional_for": [], "general_education_fields": []}
}