{"BIOE 101": {"number": "101", "sub_dept": "BIOE", "title": "Responsible Conduct of Research", "dept": "BIOE", "prereqs": [], "prereq_description": "", "comments": "", "units": "1", "description": "The responsible conduct of research (RCR) is essential to good science. Examples of goals of RCR education and training are to:  Develop, foster, and maintain a culture of integrity in science;  discourage and prevent unethical conduct; empower researchers to hold themselves and others accountable to high ethical standards; increase knowledge of, and sensitivity to, ethical issues surrounding the conduct of research by researchers with diverse backgrounds; improve the ability to make responsible choices when faced with ethical dilemmas involving research; provide an appreciation for the range of accepted scientific practices for conducting research; inform scientists and research trainees about the regulations, policies, and statutes.", "recommended_prep": "", "professor": "DENNIS CLEGG</span> <i>", "college": "COE"},
"BIOE 120A": {"number": "120A", "sub_dept": "BIOE", "title": "Molecular Bioengineering", "dept": "BIOE", "prereqs": [["MATH 6B"], ["PHYS 3"]], "prereq_description": "Chemistry 1B, Chemistry 1BL, Mathematics 6B, and Physics 3", "comments": "Concurrently offered with BIOE 220A. Quarters usually offered: Fall.", "units": "3", "description": "Introduces students to molecular components of biology with application of engineering principles for analysis. Topics include: molecular components of cells, DNA/RNA structure and function, protein structure/function/folding, gene and protein regulation, DNA replication, and experimental and computational research methods.", "recommended_prep": "One or more undergraduate courses in biochemistry or cell biology similar to MCDB 108ABC or Chem 142ABC or MCDB 103, or consent of instructor.", "professor": "STAFF", "college": "COE"},
"BIOE 120B": {"number": "120B", "sub_dept": "BIOE", "title": "Cellular Bioengineering", "dept": "BIOE", "prereqs": [["BIOE 120A", "ENGR 120A"]], "prereq_description": "BIOE 120A, or ENGR 120A, or consent of Instructor", "comments": "Concurrently offered with BIOE 220B. Quarters usually offered: Winter.", "units": "3", "description": "Introduces students to structural components of cells with application of engineering principles for analysis. Topics include: biomembrane structure and function, membrane proteins, membrane transport, intracellular compartments, intracellular trafficking, chemotaxis, cell cycle, apoptosis, and stem cells.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"BIOE 210": {"number": "210", "sub_dept": "BIOE", "title": "Biomolecular and Biochemical Methods", "dept": "BIOE", "prereqs": [], "prereq_description": "General biology, general chemistry, and differential equations", "comments": "", "units": "4", "description": "The goal of the course is to generate in our students an understanding of the logic behind the key tools used to characterize biomolecules and biosystems.  Both the mechanisms by which these techniques work, and the rationale for why each would be employed (strengths, weaknesses, potential pitfalls).", "recommended_prep": "", "professor": "PLAXCO, MUKHERJEE", "college": "COE"},
"BIOE 211": {"number": "211", "sub_dept": "BIOE", "title": "Quantitative Experiments", "dept": "BIOE", "prereqs": [], "prereq_description": "At least one undergraduate course in biochemistry/cell biology and differential equations, or consent of the instructor.", "comments": "Concurrently offered with ENGR 220A. Quarters usually offered: Fall.", "units": "3", "description": "This course is built around experimental design, data analysis, and quantitative modeling of biological processes and phenomena. Topics including experimental design considerations and a priori assumptions, probability, dimensional reduction, hypothesis testing, statistical analysis, and quantitative modeling through ordinary and partial differential equations. Case studies of recent and classic research papers in Bioengineering are used to illustrate key course topics through class discussions.", "recommended_prep": "", "professor": "STOWERS", "college": "COE"},
"BIOE 212": {"number": "212", "sub_dept": "BIOE", "title": "Great Experiments", "dept": "BIOE", "prereqs": [["BIOE 210"], ["BIOE 211"]], "prereq_description": "BIOE 210 and BIOE 211 or consent of instructor.", "comments": "Quarters usually offered: Winter.", "units": "4", "description": "Introduces students to seminal experiments that introduced pioneering biological engineering methods and experimental analysis. Students learn the principles of sound experimental design to test a hypothesis, become familiar with techniques using bacterial and stem cell model systems, as well as imaging and analysis methods.", "recommended_prep": "", "professor": "PRUITT, STREICHAN", "college": "COE"},
"BIOE 220A": {"number": "220A", "sub_dept": "BIOE", "title": "Molecular Bioengineering", "dept": "BIOE", "prereqs": [["CHEM 1B"], ["MATH 6B"], ["PHYS 3"]], "prereq_description": "Chem 1B/2B, Math 6B,  Physics 3", "comments": "Quarters usually offered: Fall. Designed for graduate students enrolled in the bioengineering emphasis.", "units": "3", "description": "Introduces students to molecular components of biology and application of engineering principles for their analysis. Topics include: molecular components of cells; DNA structure and function, including replication; gene regulation; protein structure, function, and folding; chemical kinetics; signal transduction and mathematical descriptions thereof; and mechanics of biomolecules and subcellular structures (membranes, cytoskeleton).", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"BIOE 220B": {"number": "220B", "sub_dept": "BIOE", "title": "Cell and Tissue Bioengineering", "dept": "BIOE", "prereqs": [["ENGR 220A"]], "prereq_description": "Engr 220A  or consent of Instructor", "comments": "Concurrently offered with BIOE 120B. Quarters usually offered: Winter. Designed for graduate students enrolled in the optional bioengineering emphasis.", "units": "3", "description": "Introduces students to structural components of cells, tissues, and organ systems, and the application of engineering principles for analysis. Topics include: biomembrane structure, function, and transport; intracellular compartments and trafficking; cell proliferation and death; cell-cell communication; biomaterials and stem cells; quantitative physiology of major organ systems (transport, mechanics, and electrical signaling); and homeostasis.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"BIOE 225": {"number": "225", "sub_dept": "BIOE", "title": "Current Topics in Bioengineering", "dept": "BIOE", "prereqs": [], "prereq_description": "", "comments": "Designed for majors. Quarters usually offered: Winter, Spring, Fall.", "units": "1", "description": "Seminar series highlighting current topics and advances in bioengineering presented by UCSB faculty or visiting scientists providing context and motivation for bioengineering learning, introducing students to concepts outside of their primary research specialty, and promoting interdisciplinary thinking and research collaboration.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"BIOE 230": {"number": "230", "sub_dept": "BIOE", "title": "Bioengineering Student Seminar", "dept": "BIOE", "prereqs": [], "prereq_description": "", "comments": "Designed for majors. Quarters usually offered: Winter, Spring, Fall.", "units": "1", "description": "Seminar series where students present their original thesis research and also review journal articles that critically analyze contemporary bioengineering research. Three quarters of BIOE 230 are required for the optional BioE graduate emphasis. Presentations are evaluated and feedback is  provided.", "recommended_prep": "", "professor": "STAFF", "college": "COE"},
"BIOE 240": {"number": "240", "sub_dept": "BIOE", "title": "Haptics: Touch Perception, Interaction, and Engineering", "dept": "BIOE", "prereqs": [], "prereq_description": "None.", "comments": "", "units": "4", "description": "Haptics lies at the intersection of robotics, human-computer interaction, and computational and human perception.  The term \"haptics\" is often used to refer to science and engineering related to the sense of touch.  This course introduces human haptics, including sensory specializations and touch perception.  It reviews the engineering of electronic technologies for haptic (touch) feedback, emerging technologies, and the design of haptic systems for human-computer interaction, sensory substitution, virtual reality, augmented reality, and other emerging areas. The class involves a mix of readings, hands-on activities, lecture/discussion, and projects.", "recommended_prep": "", "professor": "YON VISELL", "college": "COE"},
"BIOE 596": {"number": "596", "sub_dept": "BIOE", "title": "Directed Research", "dept": "BIOE", "prereqs": [], "prereq_description": "Must be a graduate student enrolled in the Biological Engineering PhD Program.", "comments": "", "units": "1-6", "description": "Experimental or theoretical research undertaken under the direction of a faculty member for graduate students who have not yet advanced to candidacy.", "recommended_prep": "", "professor": "STAFF", "college": "COE"}
}