{"CLASS 20A": {"number": "20A", "sub_dept": "CLASS", "title": "The Ancient Greeks", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "An introduction to the literature and culture of ancient Greece. The study of literary and material remains will illustrate how the Greeks lived and  the values they expressed through literature and the arts. Topics may  include the rituals and festivals of Greek religion, the conflict between  heroic ideals and democratic ideology, the institutions that shaped public and private life, and the competitive nature of law, drama, athletics and  politics.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 20B": {"number": "20B", "sub_dept": "CLASS", "title": "The Romans", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "An introduction to the civilization of the ancient Romans. Topics such as  Rome?s legends of male and female virtue, Augustus?s ingenious     transformation of the republic into a monarchy, gladiators and chariot   racing, slavery, Rome and the Christians, and the competing philosophical  systems of Stoicism and Epicureanism will be explored through literary   texts and archaeological remains. Encounter a range of sources from Livy,  Virgil, and Seneca to monuments of the emperors, and examine the complex legacies of Roman culture across time.", "recommended_prep": "", "professor": "MACLEAN, MORSTEIN-MARX", "college": "L&S"},
"CLASS 20AH": {"number": "20AH", "sub_dept": "CLASS", "title": "The Ancient Greeks - Honors", "dept": "CLASS", "prereqs": [["CLASS 20A"]], "prereq_description": "Concurrent enrollment in Classics 20A and consent of instructor.", "comments": "", "units": "1", "description": "A discussion section led by the instructor, provided for students in the honors program. Students receive one unit for the honors seminar (20AH) in addition to four units for Classics 20A.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 36": {"number": "36", "sub_dept": "CLASS", "title": "The World of Heroes", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "A study of the Iliad, the Odyssey, the Aeneid and other ancient epics, and of the place of these works in Greek and Roman society. The course explores how the epic hero embodies a culture?s ideals concerning the  individual, the community, and the universe.", "recommended_prep": "", "professor": "DUNN, GALLUCCI", "college": "L&S"},
"CLASS 36H": {"number": "36H", "sub_dept": "CLASS", "title": "World of Heroes - Honors", "dept": "CLASS", "prereqs": [["CLASS 36"]], "prereq_description": "Concurrent enrollment in Classics 36; consent of instructor.", "comments": "", "units": "1", "description": "A discussion section led by the instructor, provided for students in the honors program. Students receive one unit for the honors seminar (36H) in addition to four units for Classics 36.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 39": {"number": "39", "sub_dept": "CLASS", "title": "Gender and Sexuality in Greece and Rome", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "5", "description": "Study of gender and sexuality in a wide range of Greek and Latin texts and contexts, exploring diverse ideals of masculinity and femininity, and sexual codes, norms, and practices.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 39H": {"number": "39H", "sub_dept": "CLASS", "title": "Gender and Sexuality in Greece and Rome-Honors", "dept": "CLASS", "prereqs": [["CLASS 39"]], "prereq_description": "Concurrent enrollment in Classics 39; consent of instructor.", "comments": "", "units": "1", "description": "Discussion section led by the instructor, provided for students in the honors program. Students receive one unit for the honors seminar (39H) in addition to four units for Classics 39.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 40": {"number": "40", "sub_dept": "CLASS", "title": "Greek Mythology", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Introduction to the principal myths of ancient Greece and the ways in  whichthese myths have been understood. Format and readings vary.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 40H": {"number": "40H", "sub_dept": "CLASS", "title": "Greek Mythology--Honors", "dept": "CLASS", "prereqs": [["CLASS 40"]], "prereq_description": "Concurrent enrollment in Classics 40 and consent of instructor.", "comments": "", "units": "1", "description": "A discussion section led by the professor is available to students in the  honors program. Students will receive one unit for the honors seminar  (40H)in addition to four units for Classics 40.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 50": {"number": "50", "sub_dept": "CLASS", "title": "Introduction to Classical Archaeology", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Examines the techniques and methods of classical archaeology as revealed through an examination of the major monuments and artifacts of the   Greco-Roman world from prehistory to the Late Empire.", "recommended_prep": "", "professor": "ERICKSON", "college": "L&S"},
"CLASS 55": {"number": "55", "sub_dept": "CLASS", "title": "Troy", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Troy and the Trojan War hold a central place in the imagination, from the  ancient Greek world to the present. What was the connection between heroic ideals and a Bronze Age world of palaces and archives? This course will  consider the Trojan War through different lenses -- the archaeology of Bronze Age Greece, Homer?s epic poems the Iliad and Odyssey, trade and   commerce with the Near East, and contemporary re-imaginings.", "recommended_prep": "", "professor": "GALLUCCI", "college": "L&S"},
"CLASS 60": {"number": "60", "sub_dept": "CLASS", "title": "Science and Medicine in Ancient Greece", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "An examination of the origins and development of ancient science,    especially Greek medicine and science in the Classical and Hellenistic   periods. Topics may include scientific methodologies, the first atomic   theory, the science of warfare, and the politics of science.", "recommended_prep": "", "professor": "DUNN", "college": "L&S"},
"CLASS 70": {"number": "70", "sub_dept": "CLASS", "title": "Food and Wine in the Ancient World", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "History of the cultural significance of food and wine in the societies of the ancient Mediterranean. Analysis of literary texts, artistic representations, and archaeological evidence. History of trade and cultural influence amongst various peoples of the ancient Mediterranean.", "recommended_prep": "", "professor": "MACLEAN", "college": "L&S"},
"CLASS 99": {"number": "99", "sub_dept": "CLASS", "title": "Introduction To Research", "dept": "CLASS", "prereqs": [], "prereq_description": "Consent of instructor and department chair.", "comments": "Students must have a minimum 3.0 GPA for the preceding 3 quarters. May be  repeated to a maximum of six units. Students are limited to 5 units per  quarter and 30 units total in all 98/99/198/199/199AA-ZZ courses combined.", "units": "1-3", "description": "Directed study, oriented toward research, to be arranged with individual faculty members. Course offers exceptional students an opportunity to  participate in a research project or group.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 101": {"number": "101", "sub_dept": "CLASS", "title": "Greek Intellectual Revolutions", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "A wide-ranging introduction to innovative Ancient Greek thinking as it   transformed over several centuries. Topics may include theories of   justice, the nature of the gods, the ?quarrel between poetry and     philosophy,? and the invention of history. Reading in translation of   poetic, historical, and philosophical texts.", "recommended_prep": "", "professor": "SHILO</span> <i>", "college": "L&S"},
"CLASS 102": {"number": "102", "sub_dept": "CLASS", "title": "Understanding Greek Tragedy", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Greek tragedy was a dramatic phenomenon first performed in ancient Athens. It is obsessively concerned with desire, betrayal, and loss, and with  civic and democratic values. This course studies the original contexts in  which Greek tragedy was first seen -- religious, theatrical, military,   political, and philosophical -- and the magnetic force it still holds for  us today. Introduces students to some of the most important moments in the modern reception of Greek tragedy, in theory, politics, and drama.", "recommended_prep": "", "professor": "DUNN, MORALES</span> <i>", "college": "L&S"},
"CLASS 106": {"number": "106", "sub_dept": "CLASS", "title": "Ancient Magic and Modern Revivals", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Explores the practice of magic in classical antiquity, beginning with the  archaic period and ending in the seventh century CE. This historicized   survey of practices, laws, and literary representations serves as a    springboard for reflecting on magic as a social phenomenon and category of thought, and for discussion of the modern reception and contemporary   revivals of Greco-Roman magic.", "recommended_prep": "", "professor": "DUTSCH</span> <i>", "college": "L&S"},
"CLASS 109": {"number": "109", "sub_dept": "CLASS", "title": "Ethnicity and Diversity in the Ancient World", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "", "recommended_prep": "", "professor": "DUNN</span> <i>", "college": "L&S"},
"CLASS 110": {"number": "110", "sub_dept": "CLASS", "title": "From Homer To Harlequin: Masculine, Feminine And The Romance", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "The romance, from Homer's Odyssey to the contemporary romance novel,   creates images of masculinity and feminity. This course considers these  gender representations and questions whether they vary among ancient   novels, and between the romances of antiquity and those of today.", "recommended_prep": "", "professor": "LINDHEIM</span> <i>", "college": "L&S"},
"CLASS 114": {"number": "114", "sub_dept": "CLASS", "title": "Topics in Classical Archaeology", "dept": "CLASS", "prereqs": [["CLASS 50"]], "prereq_description": "Classics 50", "comments": "", "units": "4", "description": "A topical framework addressing a particular set of issues in Classical   archaeology. These topics might include state formation, urbanization,   colonization, the ancient economy, or a more focused examination of a  particular issue or period. In each, students gain knowledge of some of  the key sites and monuments of Classical archaeology and an      understanding of archaeological contexts, methods of categorization, and chronologies. In addition, the course exposes students to various    theoretical approaches to archaeological interpretation.", "recommended_prep": "", "professor": "ERICKSON", "college": "L&S"},
"CLASS 130": {"number": "130", "sub_dept": "CLASS", "title": "Humor and Laughter in the Classical World", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "", "recommended_prep": "", "professor": "DUTSCH</span> <i>", "college": "L&S"},
"CLASS 136": {"number": "136", "sub_dept": "CLASS", "title": "Epic Heroes, Classic Texts", "dept": "CLASS", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "Same course as Comparative Literature 121.</div><div><strong>Repeat Comments:</strong> Illegal Repeat of C Lit 197 from Fall 2004 to Fall 2006.", "units": "4", "description": "Through readings of the three major epics of Greek and Latin Antiquity (the Iliad, the Odyssey, and the Aeneid, read in English translation) and some of their modern rewritings, this course allows students to (1) explore the changing idea of hero and heroism in the Western tradition, and (2) engage critically with the idea of canonicity and foundational texts in Western literature, and in world literature.", "recommended_prep": "", "professor": "JULLIEN", "college": "L&S"},
"CLASS 140": {"number": "140", "sub_dept": "CLASS", "title": "Slavery and Freedom in the Ancient World", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Examination of the nature and impact of chattel slavery in the ancient   Mediterranean, with emphasis on classical Greece and imperial Rome. How  did ancient thinkers like Aristotle and Seneca define slavery in     opposition to freedom? What modes of slave labor thrived in antiquity and  why? How did the enslaved resist subjugation, whether through outright   rebellion like the revolt led by Spartacus or by other means? Primary  sources and comparative evidence will guide discussion of these and other  key questions.", "recommended_prep": "", "professor": "MACLEAN</span> <i>", "college": "L&S"},
"CLASS 145": {"number": "145", "sub_dept": "CLASS", "title": "Cicero?s Toughest Trials", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Cicero, Rome?s greatest trial lawyer and sharpest wit, faced many tough  cases in his long career at the bar (81-43 BC). Students will read a   selection of Cicero?s most famed speeches against the background of Roman  handbooks on forensic argument, compare his strategy with that of opposing counsel, and consider the similarities as well as differences between  Roman procedures and our own. Aspiring lawyers are very welcome, as are  all students interested in persuasive speaking or Roman culture.", "recommended_prep": "", "professor": "MORSTEIN-MARX</span> <i>", "college": "L&S"},
"CLASS 150": {"number": "150", "sub_dept": "CLASS", "title": "The Fall of the Ancient Republic: Cicero, Caesar, and Rome", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "The tumultuous end of the Roman Republic, from Tiberius Gracchus (133 BC)  to the Rubicon (49 BC), had profound importance for the history of the   West and produced a fascinating literature of crisis in the writings of  Sallust, Cicero, Catullus, and Caesar.", "recommended_prep": "", "professor": "MORSTEIN-MARX</span> <i>", "college": "L&S"},
"CLASS 151": {"number": "151", "sub_dept": "CLASS", "title": "Emperors and Gladiators: The Roman Empire to Marcus Aurelius", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "History of the Roman empire from the turbulent rise of Augustus to the   reign of Stoic emperor Marcus Aurelius (44 BCE to 180 CE). Literary and  archaeological sources will illuminate such topics as the nobility?s   response to autocratic rule; the relationship between soldier and civilian in the provinces; the expansion of the Roman legal system; the social  function of violent spectacle; and the diversity of cultic practices, from worship of the Olympian gods to Isis, Mithras, and early Christianity.", "recommended_prep": "", "professor": "MACLEAN</span> <i>", "college": "L&S"},
"CLASS 152": {"number": "152", "sub_dept": "CLASS", "title": "Citizenship: Ancient Origins and Modern Practice", "dept": "CLASS", "prereqs": [], "prereq_description": "Not open to freshmen.", "comments": "", "units": "4", "description": "How did forms of citizenship practiced today in the West, particularly in the United States, develop in conversation with ancient Greece and Rome? This course examines the relationship between ancient and modern citizenship by asking not only how the past illuminates the present, but also how contemporary experience can (and should) affect the ways in which we engage Classical models. Themes may include: theories of democracy; foundation myths; imperialism and globalization; multiculturalism; immigration; and the impact of marginalized social groups.", "recommended_prep": "", "professor": "MACLEAN", "college": "L&S"},
"CLASS 155": {"number": "155", "sub_dept": "CLASS", "title": "Greek Religion and Identity", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "The ancient Greeks defined themselves through their religion, and this   course examines different forms of Greek identity from the standpoint  of religious practice and belief. Topics addressed include the role  of  animal sacrifice, material objects dedicated to the gods, gender  and  class distinctions among the worshippers, the built environment,     athletics, and local myths and variations in practice. By  considering ancient evidence through the lens of contemporary theory,  we will   attempt to reconstruct the richness and diversity of Greek  religious  experience.", "recommended_prep": "", "professor": "ERICKSON", "college": "L&S"},
"CLASS 165": {"number": "165", "sub_dept": "CLASS", "title": "Greek Painting", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Examines the art of painting and its social context in Greek antiquity,  including monumental wall painting, vase painting, and the relationship  between these and other media from prehistory to the Hellenistic period.", "recommended_prep": "", "professor": "ERICKSON", "college": "L&S"},
"CLASS 170": {"number": "170", "sub_dept": "CLASS", "title": "Pompeii", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "Not open for credit to students who have completed Classics 170B.", "units": "4", "description": "A study of the history, buildings, and people of Pompeii, a city buried by the eruption of Mt. Vesuvius.", "recommended_prep": "", "professor": "SHELTON", "college": "L&S"},
"CLASS 171": {"number": "171", "sub_dept": "CLASS", "title": "Artifact and Text: The Archaeology and Literature of Early Greece", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "A survey of the archaeological record and literature of early Greece from  the Late Bronze Age to the end of the Archaic Age, with special attention  paid to the interconnection of artifact and text for our understanding of  this period.", "recommended_prep": "", "professor": "GALLUCCI</span> <i>", "college": "L&S"},
"CLASS 175": {"number": "175", "sub_dept": "CLASS", "title": "Ancient Theories of Literature", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "An introduction to Greek and Roman theories of literature and      representation, with attention both to the major texts of Plato,     Aristotle, Horace, Tacitus, and Longinus, and to central issues such as  education, imitation, persuasion, allegory, genre, and style.", "recommended_prep": "", "professor": "DUNN</span> <i>", "college": "L&S"},
"CLASS 180A": {"number": "180A", "sub_dept": "CLASS", "title": "Advanced Study in Classical Civilization", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "For Classical Civilization and Greek and Roman Culture majors.", "units": "4", "description": "Specialized study in classical civilization addressing central themes or genres in detail. Topics vary and may include subjects such as The Family in Ancient Rome, Greek Oracles and Politics, and Imperial Theology: Augustus, Politics and Religion.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 180B": {"number": "180B", "sub_dept": "CLASS", "title": "Interfaces in Classical Civilization", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "For Classical Civilization and Greek and Roman Culture majors.", "units": "4", "description": "Specialized study in classical civilization addressing influence or reception of classical culture, or meeting and competition of cultures. Topics vary and may include subjects such as Greek Tragedy and Western Theater, Greek and Roman Comedy and Reception, and Julius Caesars: Ancient and Modern.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 185": {"number": "185", "sub_dept": "CLASS", "title": "Undergraduate Seminar", "dept": "CLASS", "prereqs": [], "prereq_description": "Consent of instructor and upper-division standing.", "comments": "Priority given to Classics majors, Classics minors, and students in the honors program. May be repeated for credit to a maximum of 12 units.", "units": "4", "description": "Study and research of special topics in classical literature, civilization, and culture. Topics may include: Rome: the ancient city, food in antiquity, the Roman family, religious thought and practice in Rome, culture and crisis in Athens, culture and crisis in Rome, etc.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 187": {"number": "187", "sub_dept": "CLASS", "title": "Special Topics in the Humanities", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Content varies by instructor. This course is designed to give the instructor maximum flexibility to explore a topic in the humanities that stresses a multi-disciplinary approach, including exposing students to methods of literary analysis, material culture, and possibly include anthropological and historical themes. Students gain experience working with primary sources and the secondary literature and are expected to convey research in oral and/or written form.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "L&S"},
"CLASS 195A": {"number": "195A", "sub_dept": "CLASS", "title": "Senior Honors Thesis in Classics", "dept": "CLASS", "prereqs": [], "prereq_description": "Must have been in residence as a Classics major for at least one full", "comments": "Designed for majors. Quarters usually offered: Winter.", "units": "4", "description": "Research and writing of a senior thesis paper under the close supervision  of a Classics faculty member.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 195B": {"number": "195B", "sub_dept": "CLASS", "title": "Senior Honors Thesis in Classics", "dept": "CLASS", "prereqs": [], "prereq_description": "Must have been in residence as a Classics major for at least two full", "comments": "Quarters usually offered: Spring.", "units": "4", "description": "Research and writing of a senior thesis paper under the close supervision  of a Classics faculty member.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 196": {"number": "196", "sub_dept": "CLASS", "title": "Internship in Classical Studies", "dept": "CLASS", "prereqs": [], "prereq_description": "Upper Division Standing and consent of department.", "comments": "", "units": "4", "description": "Course enables students to obtain credit for internship experience related to the study of Classical antiquity and the Classical tradition. Faculty supervision and a final report are required.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 198": {"number": "198", "sub_dept": "CLASS", "title": "", "dept": "CLASS", "prereqs": [], "prereq_description": "Consent of instructor and department chair; upper-division standing;", "comments": "Students must have a minimum 3.0 GPA for the preceding 3 quarters and are  limited to 5 units per quarter and 30 units total in all       98/99/198/199/199AA-ZZ courses combined. Total credit for this course is limited to six units.", "units": "1-4", "description": "Individual or small group reading and study in subjects not included in  theregular curriculum.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 199": {"number": "199", "sub_dept": "CLASS", "title": "", "dept": "CLASS", "prereqs": [], "prereq_description": "Consent of instructor and department chair; upper-division standing;", "comments": "Students must have a minimum 3.0 GPA for the preceding 3 quarters and are  limited to 5 units per quarter and 30 units total in all       98/99/198/199/199AA-ZZ courses combined.", "units": "1-5", "description": "Independent study in areas in which both Greek and Latin are necessary.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 199RA": {"number": "199RA", "sub_dept": "CLASS", "title": "", "dept": "CLASS", "prereqs": [], "prereq_description": "Upper-division standing; completion of 2 upper-division courses in", "comments": "Students must have a minimum 3.0 GPA for the preceding 3 quarters and are  limited to 5 units per quarter and 30 units total in all       98/99/198/199/199AA-ZZ courses combined.", "units": "1-5", "description": "To cooperate on an active basis with a professor on a research project   involving the Classics.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 201": {"number": "201", "sub_dept": "CLASS", "title": "Proseminar", "dept": "CLASS", "prereqs": [], "prereq_description": "Graduate standing.", "comments": "", "units": "2", "description": "Bibliography, methodology, and history of classical scholarship.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 211": {"number": "211", "sub_dept": "CLASS", "title": "History of Greek and Latin Literature", "dept": "CLASS", "prereqs": [], "prereq_description": "Graduate standing.", "comments": "", "units": "2", "description": "Survey of development of poetry and prose; major authors. Special readings and reports.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 212": {"number": "212", "sub_dept": "CLASS", "title": "History of Greek and Latin Literature", "dept": "CLASS", "prereqs": [], "prereq_description": "Graduate standing.", "comments": "", "units": "2", "description": "Survey of development of poetry and prose; major authors. Special readings and reports.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 213": {"number": "213", "sub_dept": "CLASS", "title": "History of Greek and Latin Literature", "dept": "CLASS", "prereqs": [], "prereq_description": "Graduate standing.", "comments": "", "units": "2", "description": "Survey of development of poetry and prose; major authors. Special readings and reports.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 214": {"number": "214", "sub_dept": "CLASS", "title": "Topics in Classical Archaeology", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "Concurrently offered with CLASS 114.", "units": "4", "description": "A topical framework addressing a particular set of issues in Classical archaeology. These topics might include state formation, urbanization, colonization, the ancient economy, or a more focused examination of a  particular issue or period. In each, students gain knowledge of some of  the key sites and monuments of Classical archaeology and an      understanding of archaeological contexts, methods of categorization, and chronologies. In addition, the course exposes students to various    theoretical approaches to archaeological interpretation.", "recommended_prep": "", "professor": "ERICKSON", "college": "L&S"},
"CLASS 231": {"number": "231", "sub_dept": "CLASS", "title": "Seminar in Literary Studies", "dept": "CLASS", "prereqs": [], "prereq_description": "Graduate standing.", "comments": "", "units": "4", "description": "A graduate-level course in Greek and Roman authors, themes, or genres.   Topics vary and may include, Aristotle's De Anima, construction of gender  in Augustan poetry, texts and intertexts, and Roman tragedy.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 232": {"number": "232", "sub_dept": "CLASS", "title": "Seminar in Cultural Studies", "dept": "CLASS", "prereqs": [], "prereq_description": "Graduate standing.", "comments": "", "units": "4", "description": "A graduate-level course in the culture and cultures of the ancient   Mediterranean. Topics vary and may include, animals and ethics in the  ancient world, religion and politics in the Roman Republic, and    performance on and off the stage.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 233": {"number": "233", "sub_dept": "CLASS", "title": "Seminar in Ancient History", "dept": "CLASS", "prereqs": [], "prereq_description": "Graduate standing.", "comments": "", "units": "4", "description": "Advanced study in the scholarship, methods, and ancillary disciplines of Greek and Roman history. Topics may include, slavery in ancient Greece,  naval strategy in classical Greece, current problems and debates in Roman  history, and Augustus and foundation of the Principate.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 234": {"number": "234", "sub_dept": "CLASS", "title": "Seminar in Archaeology", "dept": "CLASS", "prereqs": [], "prereq_description": "Graduate standing.", "comments": "", "units": "4", "description": "", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 235": {"number": "235", "sub_dept": "CLASS", "title": "Seminar: Specialized Topics in Classical Studies", "dept": "CLASS", "prereqs": [], "prereq_description": "Graduate standing.", "comments": "", "units": "4", "description": "A graduate-level course in the major sub-disciplines of classical    scholarship. Topics vary and may include, comparative Greek and Latin  morphology and syntax, Greek and Latin textual criticism, Greek and Latin  metrics, and Greek and Latin epigraphy.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 500": {"number": "500", "sub_dept": "CLASS", "title": "Teaching Assistant Practicum", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "2", "description": "Weekly discussions, directed by faculty, of topics especially relevant for teaching assistants assigned to Classics 40 (Greek Mythology). Includes  analyses of texts and materials, discussion of teaching techniques,    formulation of exam questions and paper topics, grading, and pedagogical ethics.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "L&S"},
"CLASS 501": {"number": "501", "sub_dept": "CLASS", "title": "Language Teaching Practicum", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "2", "description": "Weekly discussions, directed by faculty, of topics relevant for graduate students assigned to introductory language courses. Includes design of   syllabi, quizzes and exams, and especially discussion of teaching    techniques and evaluation of teaching methods by observation and follow-up consultations.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "L&S"},
"CLASS 596": {"number": "596", "sub_dept": "CLASS", "title": "Directed Reading and Research", "dept": "CLASS", "prereqs": [], "prereq_description": "Written proposal approved by department chair and graduate advisor.", "comments": "", "units": "2-4", "description": "Individual tutorial.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 597": {"number": "597", "sub_dept": "CLASS", "title": "Preparation for Comprehensive Exams", "dept": "CLASS", "prereqs": [], "prereq_description": "Consent of graduate advisor and chair.", "comments": "No unit credit allowed toward degree.", "units": "1-6", "description": "Study for master's examinations and Ph.D. examinations.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 598": {"number": "598", "sub_dept": "CLASS", "title": "Master's Thesis Research and Preparation", "dept": "CLASS", "prereqs": [], "prereq_description": "Graduate standing and consent of instructor and graduate advisor.", "comments": "No unit credit allowed toward degree.", "units": "1-4", "description": "Independent research.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"CLASS 599": {"number": "599", "sub_dept": "CLASS", "title": "", "dept": "CLASS", "prereqs": [], "prereq_description": "", "comments": "", "units": "2-12", "description": "Ph.D. dissertation presentation. Preparation of the dissertation.", "recommended_prep": "", "professor": "STAFF</span> <i>", "college": "L&S"}
}