{"ENV S 1": {"number": "1", "sub_dept": "ENV S", "title": "Introduction to Environmental Studies", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "\"Environmental Studies\" requires insights from many disciplines, including the social as well as biophysical science and the humanities. This   introduction offers an overview of the field, examining both our planet  and the ways in which we humans depend on it.", "recommended_prep": "", "professor": "FREUDENBURG", "college": "L&S"},
"ENV S 1H": {"number": "1H", "sub_dept": "ENV S", "title": "Introduction to Environmental Studies - Honors", "dept": "ENV S", "prereqs": [["ENV S 1"]], "prereq_description": "Concurrent enrollment in ENV S 1; consent of instructor.", "comments": "", "units": "1", "description": "Honors section designed for highly motivated students to receive one unit  of additional honors credit.  Requires one hour per week of in-depth   analysis and discussion of \"Environmental Studies\" with course instructor  and completion of a related project.", "recommended_prep": "", "professor": "FREUDENBURG", "college": "L&S"},
"ENV S 2": {"number": "2", "sub_dept": "ENV S", "title": "Introduction to Environmental Science", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "Not open for credit to students who have completed Environmental Studies 12.", "units": "4", "description": "Provides integration of fundamental science with environmental topics. Includes impacts of human population increase; principles of systems and change, biogeochemical cycles, ecosystems and global climate; energy and laws of thermodynamics; water supply and pollution; toxicology and risk analysis; air pollution and stratospheric ozone depletion.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 2H": {"number": "2H", "sub_dept": "ENV S", "title": "Introduction to Environmental Science - Honors", "dept": "ENV S", "prereqs": [["ENV S 2"]], "prereq_description": "Concurrent enrollment in ENV S 2; consent of instructor.", "comments": "", "units": "1", "description": "Honors section designed for highly motivated students to receive one unit  of additional honors credit.  Requires one hour per week of in-depth   analysis and discussion of \"Environmental Science\" with course instructor  and completion of a related project.", "recommended_prep": "", "professor": "KELLER", "college": "L&S"},
"ENV S 3": {"number": "3", "sub_dept": "ENV S", "title": "Introduction to the Social and Cultural Environment", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "Not open for credit to students who have completed Environmental Studies 11.", "units": "4", "description": "An introduction to the relationship of societies and the environment from prehistorical times to the present. The course is global in perspective, and includes history, literature, philosophy, economics, science, and culture as evidence for examining the human social environment.", "recommended_prep": "", "professor": "GRAVES", "college": "L&S"},
"ENV S 3H": {"number": "3H", "sub_dept": "ENV S", "title": "Introduction to the Social and Cultural Environment - Honors", "dept": "ENV S", "prereqs": [["ENV S 3"]], "prereq_description": "Concurrent enrollment in ENV S 3; Consent of instructor.", "comments": "", "units": "1", "description": "Honors section designed for highly motivated students to receive one unit  of additional honors credit.  Requires one hour per week of in-depth   analysis and discussion of the social and cultural environments with   course instructor and completion of a related project.", "recommended_prep": "", "professor": "GRAVES", "college": "L&S"},
"ENV S 15A": {"number": "15A", "sub_dept": "ENV S", "title": "", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "Designed for majors. Quarters usually offered: Winter. Designed for environmental studies B.A. majors; not open to chemistry or other science majors or anyone who has completed Chem 1B, 1C, or 123, or Environmental Studies 15.", "units": "4", "description": "Introduction to chemistry from an environmental perspective. Introduces subatomic particles, nuclear instability and decay, radon, radiation, fission, fusion, nuclear power, half-life, nucleogenesis, cosmic abundance of elements, quantum mechanics, atomic orbitals, valence, the periodic chart, ionic and covalent bonding, moles, Earth layers, lithosphere, ores, mining, Iron Mountain Mine, acid mine drainage, and physical weathering. Weekly discussion section allows for review, questions, and quizzes.", "recommended_prep": "", "professor": "GARDNER", "college": "L&S"},
"ENV S 15B": {"number": "15B", "sub_dept": "ENV S", "title": "", "dept": "ENV S", "prereqs": [["ENV S 15A"]], "prereq_description": "Environmental Studies 15A.", "comments": "Designed for majors. Quarters usually offered: Spring. Course is not open to students who have completed Environmental Studies 15 or Chemistry 1B or 1C or 123.", "units": "4", "description": "A continuation of Environmental Chemistry 1. Explores the characteristics of water, solutions, chemical weathering, chemical reactions (redox, acid-base, precipitation, synthesis, decomposition, single displacement, double displacement), balancing chemical reactions, equilibrium, the hydrosphere and water cycle, issues of water chemistry, quality, and testing, sedimentation, fossil fuels and their combustion, an introduction to organic chemistry, common air pollutants, the chemistry of climate change.", "recommended_prep": "Concurrent enrollment in Environmental Studies 15BL.", "professor": "GARDNER", "college": "L&S"},
"ENV S 15BL": {"number": "15BL", "sub_dept": "ENV S", "title": "Environmental Chemistry Lab", "dept": "ENV S", "prereqs": [["ENV S 15A"], ["ENV S 15B", "ENV S 15B"]], "prereq_description": "Environmental Studies 15A and 15B (Env. St. 15BL may be taken concurrently with Env. St. 15B)", "comments": "Designed for majors. Quarters usually offered: Spring.", "units": "1", "description": "Introduces laboratory exercises, including explorations of nuclear phenomena, recycling aluminum, spectrophotometric analysis of iron, field and laboratory analysis of soil and water for N and pH, titration for acidity, chromatography, and air quality monitoring, that provide students valuable laboratory and field skills used by environmental professionals.", "recommended_prep": "This is the laboratory companion of Environmental Studies 15B.", "professor": "GARDNER", "college": "L&S"},
"ENV S 20": {"number": "20", "sub_dept": "ENV S", "title": "Introduction to Shoreline and Watershed Issues, Policy, and Research", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Students are introduced to shoreline and watershed issues facing the local community by meeting with scholars, researchers, activists, and artists who study coastal preservation, restoration, and related environmental issues. Course includes local field trips, in-class discussions, and elective short-research project.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 25": {"number": "25", "sub_dept": "ENV S", "title": "Quantitative Thinking in Environmental Studies", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Improve students' ability to deal with quantitative aspects of environmental topics by developing skills in algebra, computer use (Excel), graphing, and processing and conceptualizing environmental data by using numerical modeling. Collaborative learning is emphasized.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 30": {"number": "30", "sub_dept": "ENV S", "title": "Introduction to Environmental Economics", "dept": "ENV S", "prereqs": [["MATH 34A", "MATH 3A", "MATH 2A"]], "prereq_description": "Mathematics 34A or 3A or 2A.", "comments": "", "units": "4", "description": "Economic processes underlie many of the environmental problems facing humanity, but can also play an important role in solving those challenges. This course introduces key theories from micro- and macroeconomics, and applies them to a variety of environmental problems. Topics covered include individual preferences, efficiency, valuation, market failures and policy analysis.", "recommended_prep": "", "professor": "HEILMAYR", "college": "L&S"},
"ENV S 30H": {"number": "30H", "sub_dept": "ENV S", "title": "Introduction to Environmental Economics - Honors", "dept": "ENV S", "prereqs": [["ENV S 30"]], "prereq_description": "Concurrent enrollment in ENV S 30 and active member of the College of L&amp;S Honors Program; or consent of instructor.", "comments": "", "units": "1", "description": "Honors section designed for highly motivated students to receive one unit of additional honors credit.  Requires one hour per week of in-depth analysis and discussion of \"Environmental Economics\" with course instructor and completion of a related project.", "recommended_prep": "", "professor": "HEILMAYR", "college": "L&S"},
"ENV S 40": {"number": "40", "sub_dept": "ENV S", "title": "Critical Thinking and Evidence-Based Reasoning for the Environment", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 2", "ENV S 3"]], "prereq_description": "Environmental Studies 1 or 2 or 3.", "comments": "", "units": "4", "description": "An introduction to the different ways that researchers and practitioners have defined and applied critical thinking skills in environmental studies. In the first half, we will focus on the three important skills: 1. finding and evaluating evidence; 2. identifying assumptions; and 3. synthesizing evidence into clear and reasoned arguments. In second half, we will bring together both quantitative and qualitative approaches through case studies, so that students can practice using key terms and analytical habits.", "recommended_prep": "", "professor": "MARTIN", "college": "L&S"},
"ENV S 50": {"number": "50", "sub_dept": "ENV S", "title": "Bending the Curve: Your Climate Change Solutions", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "Open to non-majors. Same course as Environmental Studies ENV SW 50.", "units": "4", "description": "A unique solutions-oriented introduction to the crisis of climate change, building on the Carbon Neutrality Initiative of the UC system. Topics cover technical, scientific, and social aspects of climate change with the goal of empowering you with the capacities and knowledge to engage with possible solutions for stabilizing the climate. Offered as a hybrid online course in which asynchronous video lectures taught by faculty from across the UC campuses are accompanied by live discussion, collaborative group work, and an individual capstone project in which you will develop in a climate solution of your own.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 60": {"number": "60", "sub_dept": "ENV S", "title": "Applied Ecology", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "Same course as ENV SW 60 - the online version.", "units": "4", "description": "Course provides an introduction to ecology: biological interactions and processes at the level of organisms, populations, communities and ecosystems. Ecological concepts are presented and discussed in the context of current challenges in environmental management and conservation.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 70": {"number": "70", "sub_dept": "ENV S", "title": "Introduction to Environmental Ethics", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Introductory survey of issues and methods in environmental ethics. Topics include anthropocentrism and ecocentrism; individualistic vs. holistic approaches; animal rights and liberation; ecofeminism; perspectives from ecological and evolutionary science; environmental justice and obligations to future generations; climate change and geoengineering; ecological theology and nature religion.", "recommended_prep": "", "professor": "SIDERIS", "college": "L&S"},
"ENV S 95": {"number": "95", "sub_dept": "ENV S", "title": "Introduction to Ecological Restoration Field Skills", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "Open to non-majors. Quarters usually offered: Winter, Spring, Fall.", "units": "1", "description": "Visit local natural areas to gain hands-on experience in facets of   ecological restoration including project planning, site assessment,  invasive species management, plant identification and propagation,   vegetation and water quality monitoring, and wildlife observation.   Internships available at conclusion of course.", "recommended_prep": "Completion of an introductory course in biology, ecology or      environmental science.", "professor": "STAFF", "college": "L&S"},
"ENV S 96": {"number": "96", "sub_dept": "ENV S", "title": "Introduction to Curation of Natural History Collections", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "Open to non-majors. Quarters usually offered: Winter, Spring, Fall. Same course as EEMB 96.</div><div><strong>Repeat Comments:</strong> EEMB 96 and ENV S 96 combined may be taken 3 times in total.", "units": "1", "description": "Introduction to curation of natural history collections including vertebrate, plants, algae and lichen. Learn to collect, prepare, catalog, and preserve specimens via lectures, hands-on activities, and field trips. Collection focus changes quarterly. Internships available at conclusion of the course.", "recommended_prep": "Completion of an introductory course in biology, ecology or environmental science.", "professor": "STAFF", "college": "L&S"},
"ENV S 99": {"number": "99", "sub_dept": "ENV S", "title": "Introduction to Research", "dept": "ENV S", "prereqs": [], "prereq_description": "Consent of department and instructor.", "comments": "Students should have an overall GPA average of 3.0. May be repeated to a maximum of 8 units.", "units": "1-5", "description": "Directed study under the guidance of an environmental studies faculty member. Course offers motivated students an opportunity to undertake independent or collaborative research for faculty-directed research projects. Topic and scope varies, to be specified by student and supervisory faculty member prior to registration.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 100": {"number": "100", "sub_dept": "ENV S", "title": "Environmental Ecology", "dept": "ENV S", "prereqs": [["ENV S 2"], ["ENV S 1", "ENV S 3"], ["MCDB 20"]], "prereq_description": "Environmental Studies 2; and Environmental Studies 1 or 3; and MCDB 20 or", "comments": "", "units": "4", "description": "A study of principles of ecology and their implications for analyzing environmental problems. Focus on understanding the processes controlling the dynamics of populations,communities and ecosystems. Specific examples emphasize the application of these concepts to the management of natural resources.", "recommended_prep": "", "professor": "TYLER", "college": "L&S"},
"ENV S 101": {"number": "101", "sub_dept": "ENV S", "title": "Ecosystems Services and Biodiversity", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 3"], ["ENV S 60", "EEMB 2"]], "prereq_description": "Environmental Studies 1 or 3 and either Environmental Studies 60 or EEMB 2.", "comments": "", "units": "4", "description": "Course examines ecosystem services ? the benefits we derive from nature ? focusing on biodiversity and the values of natural and managed ecosystems. Takes an interdisciplinary approach, examining natural science, social science, and humanities perspectives on this topic.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 102": {"number": "102", "sub_dept": "ENV S", "title": "Qualitative Methods for Environmental Studies", "dept": "ENV S", "prereqs": [], "prereq_description": "Not Open to Freshmen.", "comments": "", "units": "4", "description": "Introduces students to theories and practices of qualitative knowledge production, with a focus on understanding environmental problems from an inductive and phenomenological perspective. Students learn to conduct interviews, take field notes, and analyze documents while drawing on a variety of methodological approaches, including case studies, narrative analyses, ethnographies, and participatory action research studies. The aim is to critically examine how environmental problems are framed in order to foster change.", "recommended_prep": "", "professor": "GRAY", "college": "L&S"},
"ENV S 103": {"number": "103", "sub_dept": "ENV S", "title": "Nature Spirituality", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper Division Standing", "comments": "Same course as Religious Studies 103.", "units": "4", "description": "Is the human connection to nature a form of religion? Can activities like hiking, surfing, swimming and birdwatching be understood as spiritual practices? What are the implications of framing environmentalism as a religious commitment? Through a variety of lenses, including nature writing, neo-pagan and animistic practices, BIPOC perspectives, and the reflections of scientists and religion scholars, this course considers the many ways in which humans engage spiritually with nature and nonhumans.", "recommended_prep": "", "professor": "SIDERIS", "college": "L&S"},
"ENV S 103A": {"number": "103A", "sub_dept": "ENV S", "title": "Flora and Vegetation of California", "dept": "ENV S", "prereqs": [["MCDB 1A"], ["MCDB 1B"], ["EEMB 2"], ["EEMB 3"]], "prereq_description": "MCDB 1A, MCDB 1B, EEMB 2 and EEMB 3. Completion of all listed prerequisites", "comments": "Same course as EEMB 103A.", "units": "4", "description": "An introduction to plant families, species, and communities in California by means of laboratory work and field observations, and including techniques of plant collection and identification. One three-day field trip is required in addition to the regularly scheduled laboratories.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 105": {"number": "105", "sub_dept": "ENV S", "title": "Renewable Energy Systems", "dept": "ENV S", "prereqs": [["MATH 2B", "MATH 3B", "MATH 34B", "MATH 34A"], ["ENV S 25"]], "prereq_description": "Upper-division standing; Mathematics 2B, or 3B, or 34B, or Mathematics 34A and Environmental Studies 25.", "comments": "", "units": "4", "description": "Introduction to renewable energy generation and energy storage technologies, their economics, their associated environmental and social issues, and policies and regulations important to the adoption and use of renewable energy systems. Course includes field trips and guest lecturers.", "recommended_prep": "", "professor": "DESHMUKH", "college": "L&S"},
"ENV S 108O": {"number": "108O", "sub_dept": "ENV S", "title": "HISTORY OF THE OCEANS", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper division standing.", "comments": "SAME COURSE AS HISTORY 108O.", "units": "4", "description": "EXPLORES HOW PEOPLE HAVE EXPERIENCED, UNDERSTOOD,  TRANSFORMED, AND    ATTEMPTED TO CONSERVE THE WORLD\u0012S OCEANS THROUGHOUT HUMAN HISTORY.   INTERDISCIPLINARY APPROACH INCLUDES ASPECTS OF SCIENCE, TECHNOLOGY,    POLITICS, LAW, CULTURE, AND MATERIAL BIOPHYSICAL RELATIONSHIPS.", "recommended_prep": "", "professor": "PETER ALAGONA", "college": "L&S"},
"ENV S 108W": {"number": "108W", "sub_dept": "ENV S", "title": "Wildlife in America", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "Explores the turbulent, contested, and colorful history of  human interactions with wild animals in North America from the Pleistocene to the present. Readings will explore  historical changes in science, politics, law, management,  and cultural ideas about nature.", "recommended_prep": "", "professor": "ALAGONA", "college": "L&S"},
"ENV S 111": {"number": "111", "sub_dept": "ENV S", "title": "The California Channel Islands", "dept": "ENV S", "prereqs": [["MCDB 1AL and EEMB ", "MCDB 2", "MCDB 20", "EEMB 22", "ENV S 2", "ENV S 60", "GEOG 3", "GEOG 4", "EARTH 2"]], "prereq_description": "MCDB 1A-1AL and EEMB 2; or MCDB 20 or EEMB 22 or Environmental Studies 2 or 60 or Geography 3 or 4 or Earth Science 2.", "comments": "Same course as Geography 149.", "units": "4", "description": "Discussion of biological, geological, ecological, anthropological, and oceanographic characteristics of the Channel Islands area as well as the management and human uses of this region. Emphasis on islands and ocean waters off Southern California.", "recommended_prep": "Introductory chemistry.", "professor": "STAFF", "college": "L&S"},
"ENV S 112": {"number": "112", "sub_dept": "ENV S", "title": "World Population, Policies, and the Environment", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "Examines the history of global human population growth, with a specific emphasis on demographic dynamics within developing nations (or the Global South). Will consider the social, economic, and environmental consequences of and the relationships between population trends and human migration. Will analyze governmental policies and how they influence population growth and their myriad and often unintended consequences. Students will be expected to demonstrate familiarity with key theories and methods by scholars like Thomas Malthus, Karl Marx, and Ester Bose.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 113": {"number": "113", "sub_dept": "ENV S", "title": "Engineering and Environmental Geology", "dept": "ENV S", "prereqs": [["MATH 3A", "MATH 3B", "MATH 34A", "MATH 34B", "PHYS 1", "PHYS 6A", "PHYS 21"]], "prereq_description": "Mathematics 3A-B or 34A-B; and, Physics 1 or 6A or 21; upper-division", "comments": "Course fee charged.", "units": "4", "description": "Application of geologic and environmental principles to civil engineering  problems. Includes: rock and soil mechanics; landslides; hydrology;    earthquakes; and professional practice.", "recommended_prep": "", "professor": "KELLER", "college": "L&S"},
"ENV S 114A": {"number": "114A", "sub_dept": "ENV S", "title": "Soil Science", "dept": "ENV S", "prereqs": [["GEOG 3B", "GEOG 4", "EARTH 2"]], "prereq_description": "Chemistry 1A-B; and Geography 3B or 4 or Earth Science 2.", "comments": "Same course as Geography 114A.", "units": "5", "description": "Introduction to the chemical, hydrological, and biological characteristics of soils, their global distribution, and  response to management. Field and laboratory projects provide an understanding of soil-landscape distribution, soil morphology, and the physical and chemical properties that influence management decisions.", "recommended_prep": "", "professor": "CHADWICK", "college": "L&S"},
"ENV S 114B": {"number": "114B", "sub_dept": "ENV S", "title": "Soil Genesis and Classification", "dept": "ENV S", "prereqs": [["ENV S 114A"]], "prereq_description": "Environmental Studies 114A.", "comments": "Same Course as Geography 114B.", "units": "5", "description": "Introduction to chemical, physical, and biological processes that produce  soil and influence their management. Soil morphology, genesis,     classification, and global distribution emphasized. Labs cover field site  selection, soil description, sampling, laboratory preparation of samples and selected chemical and physical analyses.", "recommended_prep": "", "professor": "CHADWICK", "college": "L&S"},
"ENV S 115": {"number": "115", "sub_dept": "ENV S", "title": "Energy and the Environment", "dept": "ENV S", "prereqs": [["ENV S 2"], ["MATH 2B", "MATH 3B", "MATH 34B", "MATH 34A"], ["ENV S 25"]], "prereq_description": "Upper-division standing; Environmental Studies 2; and Mathematics 2B, or 3B, or 34B, or Mathematics 34A and Environmental Studies 25.", "comments": "", "units": "4", "description": "Fundamentals of energy science; energy extraction, generation, distribution, and consumption in electricity, transportation, and other sectors; environmental impacts; energy justice and access; energy economics and policy; transition to sustainable energy; U.S. and international perspectives.", "recommended_prep": "", "professor": "DESHMUKH", "college": "L&S"},
"ENV S 116": {"number": "116", "sub_dept": "ENV S", "title": "Sustainable Communities", "dept": "ENV S", "prereqs": [], "prereq_description": "Not open to Freshmen.", "comments": "", "units": "4", "description": "Examines sustainability, communities, and urban systems in a global context. Covers impacts cities have on the environmental systems that support them, and explores ways to improve urban systems through technology, policy, and design.", "recommended_prep": "", "professor": "PELLOW", "college": "L&S"},
"ENV S 117": {"number": "117", "sub_dept": "ENV S", "title": "Transition to a Low Carbon Society", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "Transitioning to a low carbon society presents both a significant opportunity and an enormous challenge. This course aims to address the complexity of the low carbon transition, integrating knowledge about climate change science, responses to climate impacts, and the technological, behavioral and policy solutions needed for local and global transitions away from fossil fuels.", "recommended_prep": "", "professor": "PULVER", "college": "L&S"},
"ENV S 118": {"number": "118", "sub_dept": "ENV S", "title": "Industrial Ecology: Designing for the Environment", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "Not open for credit to students who have completed Environmental Studies 193IE.", "units": "4", "description": "Industrial Ecology is a philosophical and methodical framework interwoven with concepts in ecology and economics used to aid in understanding of how industrial systems interact with the environment. Capital, energy, and material flows are examined and viewed in cultural context.", "recommended_prep": "Environmental Studies 1, 2, and 3.", "professor": "STAFF", "college": "L&S"},
"ENV S 119": {"number": "119", "sub_dept": "ENV S", "title": "Ecology and Management of California Wildlands", "dept": "ENV S", "prereqs": [["ENV S 100", "EEMB 120", "EEMB 168"]], "prereq_description": "Environmental Studies 100 or EEMB 120 or EEMB 168.", "comments": "Quarters usually offered: Fall. Same course as EEMB 119. One weekend fieldtrip is mandatory.", "units": "5", "description": "Explore ecological processes in California habitats and the challenges of their management through field trips, discussions with land managers, lectures and readings. Focus on regional habitats including specialized habitats such as coastal salt marsh and vernal pools, and more widespread such as oak savanna and chaparral.", "recommended_prep": "", "professor": "D'ANTONIO", "college": "L&S"},
"ENV S 120A": {"number": "120A", "sub_dept": "ENV S", "title": "Introduction to Environmental Toxicology", "dept": "ENV S", "prereqs": [["ENV S 2", "ENV S 60", "MCDB 20", "EEMB 22", "MCDB 1A"], ["EEMB 2", "EEMB 1A"], ["EEMB 1B", "ENV S 15A"], ["ENV S 15B"]], "prereq_description": "Environmental Studies 2; Environmental Studies 60 or MCDB 20 or EEMB 22 or MCDB 1A and EEMB 2; Chemistry 1A and 1B or Environmental Studies 15A and 15B.", "comments": "Course not open to students who completed Environmental Studies 120.", "units": "4", "description": "Uses case studies, such as the poisoning at Minamata, Japan, to introduce the various fields of toxicology (eco-, environmental, biomedical, and epidemiology) and basic toxicological principles such as metal and radiation toxicities, transformations, cycling, and transport of metals and radioisotopes in the environment, toxins vs toxicants, routes of exposure, absorption, distribution, target organs, dose, metabolism, sequestration, and excretion, as well as destruction due to atomic bomb blast (Hiroshima) vs. fission reactor explosion (Chernobyl and Fukushima), mutagenicity, and carcinogenicity.", "recommended_prep": "One course in introductory statistics.", "professor": "GARDNER", "college": "L&S"},
"ENV S 120B": {"number": "120B", "sub_dept": "ENV S", "title": "Advanced Environmental Toxicology", "dept": "ENV S", "prereqs": [["ENV S 120", "ENV S 120A"]], "prereq_description": "Environmental Studies 120 or 120A.", "comments": "", "units": "4", "description": "A continuation of Introduction to Environmental Toxicology (ENV S 120A). Using additional case studies such as the decline of Baltic seals, the birth defects caused by thalidomide, and the cancers caused by DES, course explores reproductive and developmental toxicology, teratogenicity, epigenetic effects, carcinogenicity (again), and estrogen effects while examining organic chemistry, chlorinated hydrocarbons, pesticides, solvents, and structure activity relationships.", "recommended_prep": "", "professor": "GARDNER", "college": "L&S"},
"ENV S 121": {"number": "121", "sub_dept": "ENV S", "title": "Contaminants of Emerging Concern", "dept": "ENV S", "prereqs": [["ENV S 120", "ENV S 120A"]], "prereq_description": "Environmental Studies 120 or 120A.", "comments": "", "units": "4", "description": "There has been an increase in both the number of substances to which consumers are exposed and the awareness of the potential ill effects of these substances. Personal care products, medications, and food additives are coming under increasing scrutiny, and we are aware that they are having unintended effects, but their presence in the environment is largely unregulated. This course takes students through the classes of contaminants of emerging concern (CECs), discussing previously-assigned papers and researching a CEC of their choice from cradle-to-grave.", "recommended_prep": "", "professor": "GARDNER", "college": "L&S"},
"ENV S 122CC": {"number": "122CC", "sub_dept": "ENV S", "title": "Cultural Representations - The Rhetoric of Climate Change", "dept": "ENV S", "prereqs": [["WRIT 2"]], "prereq_description": "Writing 2 or upper-division standing.", "comments": "Same course as English 122CC.", "units": "4", "description": "Course examines the debate around climate change and climate science.  We will examine rhetorics and utilize literary methodologies to    investigate their imagined futures. We will read texts that urge us to   take climate change seriously as well as analyze some of the tropes most frequently used in denial literature. The goal is not only to understand the implicit narrativization of climate change, but to assess how    humanistic methodologies can contribute to these debates and contribute  to imagining different futures.", "recommended_prep": "", "professor": "HILTNER", "college": "L&S"},
"ENV S 122LE": {"number": "122LE", "sub_dept": "ENV S", "title": "Cultural Representations: Literature and the Environment", "dept": "ENV S", "prereqs": [["WRIT 2"]], "prereq_description": "Writing 2 or upper-division standing.", "comments": "", "units": "4", "description": "Environmental survey of Western literature that explores the often-ignored literary history of the natural world.", "recommended_prep": "", "professor": "HILTNER", "college": "L&S"},
"ENV S 122NE": {"number": "122NE", "sub_dept": "ENV S", "title": "Cultural Representations: Nature and the Environment", "dept": "ENV S", "prereqs": [["WRIT 2", "WRIT 50", "WRIT 109", "WRIT 109", "ENGL 10"]], "prereq_description": "Writing 2 or 50 or 109 (one course from 109 series) or English 10 or", "comments": "Same course as English 122NE.", "units": "4", "description": "Perceptions of nature have changed throughout history and vary across  cultures. Course explores changing expressions of our changing     relations to the world we live in, with emphasis on cultural movements   (films, literature, newspapers, etc.) that have affected contemporary  American experience.", "recommended_prep": "", "professor": "", "college": "L&S"},
"ENV S 125A": {"number": "125A", "sub_dept": "ENV S", "title": "Principles of Environmental Law", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 2", "ENV S 3"]], "prereq_description": "Environmental Studies 1 or 2 or 3; and upper-division standing.", "comments": "Quarters usually offered: Winter.", "units": "4", "description": "An introduction to federal constitutional principles, environmental laws and regulations, and the role of the judiciary in enforcing such principles and laws. Case studies are used to examine common law, the development of modern environmental law, major court decisions, and current issues.", "recommended_prep": "", "professor": "KROP", "college": "L&S"},
"ENV S 125B": {"number": "125B", "sub_dept": "ENV S", "title": "Climate Change Law and Policy", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 2", "ENV S 3"], ["ENV S 40"]], "prereq_description": "Environmental Studies 1 or 2 or 3; and Environmental Studies 40.", "comments": "Quarters usually offered: Spring. Same course as ENV SW 125B - the online version.", "units": "4", "description": "A review of laws and regulations addressing climate change, and the use of various constitutional and legal theories to respond to the impact of rising carbon levels on the environment, public health, and the economy. Case studies will be used to track current trends.", "recommended_prep": "Environmental Studies 125A.", "professor": "STAFF", "college": "L&S"},
"ENV S 127A": {"number": "127A", "sub_dept": "ENV S", "title": "Foundations of Environmental Education", "dept": "ENV S", "prereqs": [], "prereq_description": "Sophomore standing or higher.", "comments": "Quarters usually offered: Winter.</div><div><strong>Repeat Comments:</strong> Not open to students who have completed ENVS 127.", "units": "4", "description": "Introduction to the underlying principles to be an environmental educator. Includes understanding the fundamental characteristics and goals of    Environmental Education (EE), evolution of the field, instructional  methodologies, and how to design, implement, and assess effective EE   instruction in a variety of disciplines, including: nature connection,   environmental justice, outdoor education, and primary, secondary, and  higher education. Course includes presentations by local EE      professionals and field trips.", "recommended_prep": "Environmental Studies 1 or 2 or 3 or any introductory natural science  course or consent of instructor.", "professor": "LEWIN", "college": "L&S"},
"ENV S 127B": {"number": "127B", "sub_dept": "ENV S", "title": "Advanced Environmental Education and Practicum", "dept": "ENV S", "prereqs": [["ENV S 127A"]], "prereq_description": "Environmental Studies 127A.", "comments": "Quarters usually offered: Spring.", "units": "4", "description": "Students learn advanced teaching skills, mentoring strategies, and   methods of assessing Environmental Education (EE). Course provides the   opportunity to implement and evaluate one's own EE project in a self-  selected local organization, school, agency, or other educational    setting. Provides real-world teaching experience with support from EE  professionals. Students create a portfolio to showcase their community   environmentally educational placement.", "recommended_prep": "Environmental Studies 1, 2, and 3.", "professor": "LEWIN", "college": "L&S"},
"ENV S 128": {"number": "128", "sub_dept": "ENV S", "title": "Foundations of Ecosystem Restoration", "dept": "ENV S", "prereqs": [["MCDB 1A"], ["MCDB 1B"], ["EEMB 2"], ["EEMB 3", "EEMB 1"], ["EEMB 2"], ["EEMB 3"], ["EEMB 60", "EEMB 100"], ["CHEM 1A"], ["CHEM 1AL"], ["CHEM 1B", "CHEM 15A"], ["CHEM 15B"], ["CHEM 15BL"]], "prereq_description": "MCDB 1A, MCDB 1B, EEMB 2, and EEMB 3; or ENVS 1, 2, 3 and 60 or 100, and either Chem 1A, 1AL, 1B, or ENVS 15A, 15B, and 15BL. Completion of all listed prerequisites with a grade of C- or better.", "comments": "Same course as EEMB 128.", "units": "4", "description": "Integrates ecological principles with practical issues involved in ecosystem restoration. Beginning with the challenge of selecting goals and establishing a target trajectory, students evaluate how ecological knowledge can guide restoration and whether sustainable states or trajectories can be achieved.", "recommended_prep": "", "professor": "D'ANTONIO", "college": "L&S"},
"ENV S 129": {"number": "129", "sub_dept": "ENV S", "title": "Ecopsychology", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 2", "ENV S 3"]], "prereq_description": "Environmental Studies 1 or 2 or 3.", "comments": "", "units": "4", "description": "Course explores the theories and practices of psychologists, educators,  and others whose work is focused on the connections between \"inner\"    human nature and \"outer\" nature within which humans experience themselves  and the rest of the world.", "recommended_prep": "", "professor": "MCGINNES", "college": "L&S"},
"ENV S 130A": {"number": "130A", "sub_dept": "ENV S", "title": "Un-naturalizing Disasters: Risk, Vulnerability, and Resilience", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 3", "ANTH 2"]], "prereq_description": "Environmental Studies 1 or 3 or Anthropology 2.", "comments": "", "units": "4", "description": "Course provides an understanding of different approaches to and meanings of disasters, and how people have faced disaster-related challenges in practical ways in a range of social, cultural, and environmental contexts. The course is designed to develop both critical analytical skills and hands-on problem solving skills.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 130B": {"number": "130B", "sub_dept": "ENV S", "title": "Global Tourism and Environmental Justice", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 3", "ANTH 2"]], "prereq_description": "Environmental Studies 1 or 3 or Anthropology 2.", "comments": "", "units": "4", "description": "Focus on the contradictions between international tourism as an economic development strategy and environmental justice and conservation efforts, especially in an era of climate change. One major objective is to help students make more informed decisions about their own tourist experiences.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 130C": {"number": "130C", "sub_dept": "ENV S", "title": "Aquatic Food and Resource Management", "dept": "ENV S", "prereqs": [["ENV S 60", "ENV S 100", "MCDB 1A"], ["MCDB 1B"], ["EEMB 2"], ["EEMB 3"]], "prereq_description": "Environmental Studies 60 or 100 or MCDB 1A, MCDB 1B, EEMB 2 and EEMB 3. Completion of all listed prerequisites with a grade of C- or better.", "comments": "Same course as EEMB 130C.", "units": "4", "description": "Introduction to the use and protection of aquatic food resources globally. Familiarization with the primary literature and key ecological concepts to identify the impacts which influence fisheries and aquaculture and in turn how these different food systems impact wild aquatic species and ecosystems. Offers an applied, food system perspective connecting ecological theory with policy and management.", "recommended_prep": "", "professor": "FROEHLICH", "college": "L&S"},
"ENV S 130EV": {"number": "130EV", "sub_dept": "ENV S", "title": "Eco Vista:  Creating Systemic Alternatives", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "Same course as Sociology 130EV.", "units": "4", "description": "\"Eco Vista\" names the project of turning Isla Vista into something like an eco-village by 2030. This course is grounded in existing models and visions of \"Systemic Alternatives\" - systems change designed to confront the climate crisis. It offers analysis of the historical background and contemporary situation of Isla Vista.  We then assess the state of the existing Eco Vista Project:  www.ecovistacommunity.com, alongside in-depth study of both the theories and case studies relevant to achieving deep social transformation today and in the near future.  Students collaborate in hands-on research, design, and direct participation on an existing project, or form one of their own.", "recommended_prep": "", "professor": "FORAN", "college": "L&S"},
"ENV S 130SD": {"number": "130SD", "sub_dept": "ENV S", "title": "The World in 2050: Systemic Alternatives", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "Same course as Sociology 130SD.", "units": "4", "description": "Starting with the current political, economic, cultural, and climate crises of Earth and humanity, we consider alternatives to the present system - sustainable development, regrowth, transition towns, resilience - and our roles in building a far better world by 2050.", "recommended_prep": "", "professor": "FORAN", "college": "L&S"},
"ENV S 131": {"number": "131", "sub_dept": "ENV S", "title": "International Environmental Law and Politics", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 2", "ENV S 3"]], "prereq_description": "Environmental Studies 1 or 2 or 3.", "comments": "", "units": "4", "description": "An examination of the actors and institutions of international     environmental law and politics, with an emphasis on explaining patterns of success and failure in addressing global environmental problems.", "recommended_prep": "", "professor": "PULVER", "college": "L&S"},
"ENV S 132": {"number": "132", "sub_dept": "ENV S", "title": "Human Behavior and Global Environment", "dept": "ENV S", "prereqs": [], "prereq_description": "Course is not open to freshmen.", "comments": "", "units": "4", "description": "Study of global environmental impacts of major human technological innovations, including the use of fire, development of agriculture, and the process of industrialization. How did Western and non-Western societies view and treat nature? Evaluation of prospects for altering human behavior to encourage sustainable development is included.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 133": {"number": "133", "sub_dept": "ENV S", "title": "Biodiversity and Conservation Biology", "dept": "ENV S", "prereqs": [["MCDB 1A"], ["MCDB 1B"], ["EEMB 2"], ["EEMB 3"]], "prereq_description": "MCDB 1A, MCDB 1B, EEMB 2 and EEMB 3. Completion of all listed prerequisites with a grade of C- or better.", "comments": "Same course as EEMB 133.", "units": "4", "description": "An integration of concepts central to effectively describing biodiversity patterns on our planet and better understanding the dynamics by which wildlife and ecosystems are altered by people. Includes exposure to topics such as extinction dynamics, climate change, and the human dimensions of biodiversity change. Course reviews classical and next-generation tools for conserving nature.", "recommended_prep": "", "professor": "MCCAULEY", "college": "L&S"},
"ENV S 134": {"number": "134", "sub_dept": "ENV S", "title": "Coastal Processes and Management", "dept": "ENV S", "prereqs": [["ENV S 2", "MATH 2A", "MATH 3A", "MATH 34A", "ENV S 25", "EARTH 1", "EARTH 2", "EARTH 4", "EARTH 20", "GEOG 3", "GEOG 4"]], "prereq_description": "Environmental Studies 2; Mathematics 2A or 3A or 34A or Environmental Studies 25; EARTH 1 or 2 or 4 or 20 or Geography 3 or 4.", "comments": "", "units": "4", "description": "Using representative coastal regimes, students study the major processes at work in our nation's coastal zones and examine the nature and efficacy of the planning and management programs that have been put in place in these areas.", "recommended_prep": "", "professor": "KELLER", "college": "L&S"},
"ENV S 134CJ": {"number": "134CJ", "sub_dept": "ENV S", "title": "Climate Justice", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper division standing.", "comments": "Same course as Sociology 134CJ.", "units": "4", "description": "Overview of the climate change problem and exploration of the meanings of  the term \"climate justice\" as used by scholars and social movement   activists to imagine and create a sustainable, equitable, democratic   world for future generations.", "recommended_prep": "", "professor": "FORAN", "college": "L&S"},
"ENV S 134EC": {"number": "134EC", "sub_dept": "ENV S", "title": "Earth in Crisis", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper division standing.", "comments": "", "units": "4", "description": "Explores the causes and consequences of climate change on a global   scale, covering the state of the science in layman's terms, the current  and future social impacts of climate change, the global negotiations   process, and climate justice activism.", "recommended_prep": "", "professor": "FORAN", "college": "L&S"},
"ENV S 135A": {"number": "135A", "sub_dept": "ENV S", "title": "Principles of Environmental Planning", "dept": "ENV S", "prereqs": [], "prereq_description": "At least sophomore standing.", "comments": "", "units": "4", "description": "Introduction to the history, theory, trends, and practice of environmental land use planning in California and the United States, with special emphasis on sustainable and resilient communities.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 135B": {"number": "135B", "sub_dept": "ENV S", "title": "Advanced Environmental Planning", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "Advanced seminar analyzing current issues affecting the natural and built environment, the practice of regional and local government planning, and the ability of local government to address future environmental challenges.", "recommended_prep": "", "professor": "STEPHENS", "college": "L&S"},
"ENV S 136": {"number": "136", "sub_dept": "ENV S", "title": "Green Works - Exploring Technology and the Search for Sustainability", "dept": "ENV S", "prereqs": [], "prereq_description": "Consent of instructor.", "comments": "", "units": "4", "description": "A multi-disciplinary class examining the interplay of technology,    society, science, and history.  Investigate green technologies in an   interactive class format designed to encourage discussion and debate.  Innovative science and social science labs provide hands-on learning.", "recommended_prep": "", "professor": "DILLEMUTH", "college": "L&S"},
"ENV S 136O": {"number": "136O", "sub_dept": "ENV S", "title": "Sustainable Architecture: History and Aesthetics", "dept": "ENV S", "prereqs": [], "prereq_description": "Not open to freshmen.", "comments": "Same course as Art History 136O.", "units": "4", "description": "Course examines history and theory of sustainable and \"green\"      architecture since the early twentieth century. Emphasis is placed on  the critical analysis of a distinct \"green\" architectural aesthetic; the scope is global.", "recommended_prep": "Art History 5A or 6F.", "professor": "WELTER", "college": "L&S"},
"ENV S 137": {"number": "137", "sub_dept": "ENV S", "title": "Conservation Planning", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing required.", "comments": "ENV S 193CP is the former number for ENV S 137.", "units": "4", "description": "Conservation planning practitioners have knowledge and skill sets that focus on protecting and maintaining biodiversity in the face of global changes to land, water, and climate. This course addresses the basic principles of ecosystem and landscape ecology, conservation theory, monitoring and adaptive management, interdisciplinary engagement, and problem solving. In teams, students will utilize the international 'Conservation Standards' strategy to present a conservation plan for a species or ecosystem of concern.", "recommended_prep": "Environmental Studies 2 or 60 or EEMB 2 or some ecology background.", "professor": "MORET", "college": "L&S"},
"ENV S 139": {"number": "139", "sub_dept": "ENV S", "title": "Business and Environment", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing only", "comments": "Quarters usually offered: Spring.", "units": "4", "description": "Analysis of the practices of environmentally responsible firms and of the  drivers of business greening at the level of individual firms,     particular industries, and of the economy as a whole.", "recommended_prep": "", "professor": "PULVER", "college": "L&S"},
"ENV S 141": {"number": "141", "sub_dept": "ENV S", "title": "Chemistry of Global Change", "dept": "ENV S", "prereqs": [["MATH 3B"], ["MATH 34B", "ENV S 25"]], "prereq_description": "Chemistry 1B and Math 3B, Math 34B or Environmental Studies 25.", "comments": "", "units": "4", "description": "Examines the fate of fossil fuel carbon dioxide within the context of the global carbon cycle. It will address questions such as: Which reservoirs have adsorbed the emitted fossil fuel carbon dioxide? Why has so little of the emitted carbon dioxide entered the ocean? Why and how will the ocean chemistry change? What are the expected effects on the marine ecosystem? Includes a term paper, problem sets, and in-class exams.", "recommended_prep": "", "professor": "CLARK", "college": "L&S"},
"ENV S 142": {"number": "142", "sub_dept": "ENV S", "title": "Microbes and the Human Environment", "dept": "ENV S", "prereqs": [["ENV S 15A", "MCDB 20", "EEMB 22"]], "prereq_description": "Chemistry 1A or Environmental Studies 15A; and, MCDB 20 or EEMB 22 or", "comments": "", "units": "4", "description": "The Earth is a microbial planet. Most life on earth is microbial: bacteria, fungi, single-celled algae. Microbes control the climate and drive ecosystems. They also control human society: disease, enabling agriculture, and producing valued materials. Course will involve modules exploring how microorganisms influence the human environment: Microbes in the Earth System, Agriculture, Industry, and Disease. In each module, we will explore important current news stories and develop some of the essential background science.", "recommended_prep": "", "professor": "SCHIMEL", "college": "L&S"},
"ENV S 143": {"number": "143", "sub_dept": "ENV S", "title": "Endangered Species Management", "dept": "ENV S", "prereqs": [["ENV S 2"], ["ENV S 1", "ENV S 3"]], "prereq_description": "Environmental Studies 2 and 1 or 3.", "comments": "", "units": "4", "description": "Examination of the protection and management of endangered species through analysis of the state and federal endangered species acts. Topics include  biodiversity, speciation and extinction rates, the history of endangered species legislation, and selected species' case studies.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 144": {"number": "144", "sub_dept": "ENV S", "title": "Form, Process And Human Use Of Rivers", "dept": "ENV S", "prereqs": [["MATH 3A", "MATH 3B", "MATH 34A", "MATH 34B"]], "prereq_description": "Mathematics 3A-B or 34A-B.", "comments": "Same course as Geography 144.", "units": "4", "description": "Basic understanding of fluvial (river) hydrology. In-depth evaluation of channel form and fluvial processes and impact of human use of rivers.", "recommended_prep": "Physics 1 or 6A/6AL or Geology 117.", "professor": "KELLER", "college": "L&S"},
"ENV S 145": {"number": "145", "sub_dept": "ENV S", "title": "Climate Change Mitigation Strategies", "dept": "ENV S", "prereqs": [["ENV S 2"], ["MATH 2B"], ["MATH 3B"], ["MATH 34B", "MATH 34A"], ["ENV S 25"]], "prereq_description": "Upper-division Standing, Environmental Studies 2, and either Math 2B, 3B, 34B or Math 34A and Environmental Studies 25.", "comments": "", "units": "4", "description": "An introduction to cross-sector strategies that reduce GHG emissions and sequester carbon by comparing their climate change mitigation potential, challenges in implementation, costs, and co-benefits. Provides the analytical tools and frameworks for estimating costs and socio-environmental tradeoffs that can be used to design or evaluate portfolios of climate change mitigation strategies.", "recommended_prep": "", "professor": "WU", "college": "L&S"},
"ENV S 146": {"number": "146", "sub_dept": "ENV S", "title": "Animals in Human Society: Ethical Issues of Animal Use", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "An exploration of the ethical issues which arise when humans interact with other animals, and an examination of conflicting attitudes toward the valueof animal life in such specific areas as food production, recreational   activities, research and environmental protection.", "recommended_prep": "", "professor": "SHELTON", "college": "L&S"},
"ENV S 147": {"number": "147", "sub_dept": "ENV S", "title": "Air Quality and the Environment", "dept": "ENV S", "prereqs": [["MATH 3A", "MATH 34A", "ENV S 25"], ["ENV S 1A"], ["ENV S 1B"]], "prereq_description": "Mathematics 3A or 34A or Environmental Studies 25; and, Chemistry 1A and 1B, or", "comments": "", "units": "4", "description": "Types, sources, effects, and control of air pollution. Topics include gaseous pollutants particulates, toxic contaminants, atmospheric dispersion, photochemical smog, acid rain control measures, the clean air act and regulatory trends, indoor air.", "recommended_prep": "", "professor": "GARDNER", "college": "L&S"},
"ENV S 148": {"number": "148", "sub_dept": "ENV S", "title": "Transforming Food Systems", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "In this intensive field seminar, we learn directly from the people and organizations on the frontlines of cultivating more just and sustainable food systems in California and the United States. Designed for students exploring a career or significant civic engagement in the food system, and introduces students to the diverse sectors and approaches in this dynamic field.", "recommended_prep": "", "professor": "CARLISLE", "college": "L&S"},
"ENV S 149": {"number": "149", "sub_dept": "ENV S", "title": "Food, Agriculture, and the Environment", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "Same course as Geography 161.", "units": "4", "description": "Our global food system is in crisis. Responsible for approximately a third of global greenhouse gas emissions, it leaves over a quarter of the world?s people suffering from moderate or severe food insecurity. Yet the food system also holds some of the most promising opportunities for just transition to a more sustainable and equitable society. This survey course introduces the history and structure of the global food system, pressing current challenges, and exciting potential solutions.", "recommended_prep": "", "professor": "CARLISLE", "college": "L&S"},
"ENV S 150": {"number": "150", "sub_dept": "ENV S", "title": "Healing Grounds: Regenerative Agriculture and Social Justice", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "Course explore the connections among climate change, agriculture, and social justice. We ask the question, how might farmers simultaneously restore the carbon cycle while repairing the harms of colonization? We will learn from specific examples of frontline scientists, farmers, and activists who are using regenerative agriculture as a means of healing the full suite of relationships that constitute their communities, from soil microbes to plants to people.", "recommended_prep": "", "professor": "CARLISLE", "college": "L&S"},
"ENV S 151": {"number": "151", "sub_dept": "ENV S", "title": "Environmental Anthropology", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 3", "ANTH 2"]], "prereq_description": "Environmental Studies 1 or 3 or Anthropology 2.", "comments": "Same course as Anthropology 152.", "units": "4", "description": "Examines the ways that humans interact with, use, and perceive the environment and nature, with a focus on the cultural, political, and economic features of human environment relationships across time and in different parts of the world. Through readings, in-class activities and discussions, field trips, and research projects, students will gain a better understanding of how anthropological theory, research, and applications can be used to address contemporary environment topics and problems.", "recommended_prep": "", "professor": "HOELLE", "college": "L&S"},
"ENV S 152": {"number": "152", "sub_dept": "ENV S", "title": "Applied Marine Ecology", "dept": "ENV S", "prereqs": [["ENV S 100", "MCDB 1A"], ["MCDB 1B"], ["EEMB 2"], ["EEMB 3"], ["MATH 3A", "MATH 34A"]], "prereq_description": "Environmental Studies 100, or MCDB 1A, MCDB 1B, EEMB 2 and EEMB 3; and Mathematics 3A or 34A. Completion of all listed prerequisites with a grade of C- or better.", "comments": "Same course as EEMB 152.", "units": "5", "description": "Introduction to the application of ecological principles and methods to environmental problems in marine habitats. Focus on problems that are local, regional, and global in scale. Concepts illustrated with case studies.", "recommended_prep": "EEMB 120.", "professor": "SCHMITT, STAFF", "college": "L&S"},
"ENV S 154": {"number": "154", "sub_dept": "ENV S", "title": "Geographic Information Systems (GIS) for Environmental Applications", "dept": "ENV S", "prereqs": [["ENV S 2"], ["ENV S 1", "ENV S 3"]], "prereq_description": "Environmental Studies 2 and either Environmental Studies 1 or 3.", "comments": "", "units": "4", "description": "Explores how Geographic Information Systems (GIS) can help environmental researchers and professionals analyze and communicate the spatial patterns underpinning a wide variety of environmental concerns. Introduces students to the basic theory and application of GIS through hands-on application of the technology to environmental questions.", "recommended_prep": "", "professor": "ROBERT HEILMAYR", "college": "L&S"},
"ENV S 155": {"number": "155", "sub_dept": "ENV S", "title": "The Built World: Infrastructure and Environmental Change", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "Introduces students to the built environment from a global perspective and explores the ways in which infrastructural arrangements are shaped by politics, technologies, ecologies, and ideas. Case studies include hydroelectric dams, nuclear power plants, pipelines, electrical grids, undersea cables, roads, bridges, canals, seawalls, and more. Students build on course concepts to research possibilities for ecologically adaptive and resilient cities in the age of climate change.", "recommended_prep": "", "professor": "GRAY", "college": "L&S"},
"ENV S 160": {"number": "160", "sub_dept": "ENV S", "title": "American Environmental Literature", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 2", "ENV S 3"], ["WRIT 2", "WRIT 2E", "WRIT 2LK"]], "prereq_description": "Environmental Studies 1 or 2 or 3; and Writing 2 or 2E or 2LK or one", "comments": "", "units": "4", "description": "Assesses contributions of literary texts to american environmental   movements. Examines influences of writers such as Thoreau, Rachel    Carson, and Edward Abbey upon environmental perceptions, values, and   attitudes in american cultural history and upon rhetorics and politics of contemporary environmental debates.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 161": {"number": "161", "sub_dept": "ENV S", "title": "Environmental Communications: Contemporary Strategies and Tactics", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 2", "ENV S 3"]], "prereq_description": "Environmental Studies 1 or 2 or 3 and upper-division standing.", "comments": "", "units": "4", "description": "Surveys strategies and tactics for communicating about the environment and sustainability in various organizational, political, cultural, business, mass media and social media contexts. Students will analyze, evaluate and practice communications methods using a spectrum of communications channels.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 162": {"number": "162", "sub_dept": "ENV S", "title": "Environmental Water Quality", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "Same course as Geography 162.", "units": "4", "description": "Study of physio-chemical and biological characteristics of natural waters, analysis of water pollution and treatment, water-quality regulations. Laboratory: independent and supervised research of water pollutants and treatment, quantitative analysis of water-quality data and one-day field work.", "recommended_prep": "Geography 4, lower-division biology and chemistry.", "professor": "LOAICIGA", "college": "L&S"},
"ENV S 163A": {"number": "163A", "sub_dept": "ENV S", "title": "Global Water Resources-Water Supply and Demand", "dept": "ENV S", "prereqs": [["ENV S 3", "POL S 12", "MATH 2A", "MATH 3A", "MATH 34A", "PSTAT 5A", "PSTAT 5LS", "PSTAT 109", "ECON 5"]], "prereq_description": "Environmental Studies 3 or Political Science 12; Math 2A or 3A or 34A; Pstat 5A or 5LS or 109 or Economics 5.", "comments": "Env. St. 193SD is the former number of Env. St. 163A.</div><div><strong>Repeat Comments:</strong> ES 163A may be used to repeat ES 193SD if a grade of C- or below was earned.", "units": "4", "description": "Water underpins all aspects of development. To evaluate water resources quantitatively, it is critical to understand water availability and water demand. How much water is there, and how is it distributed in space and time? How much water do humans and the environment need? And, how do these components translate into water scarcity? This course addresses these topics, providing a strong foundation in water resources.", "recommended_prep": "", "professor": "PERRONE", "college": "L&S"},
"ENV S 163B": {"number": "163B", "sub_dept": "ENV S", "title": "Global Water Resources?Water Management and Policy", "dept": "ENV S", "prereqs": [["ENV S 163A"]], "prereq_description": "Environmental Studies 163A.", "comments": "Env. St. 193WM is the former number of Env. St. 163B.", "units": "4", "description": "Water underpins all aspects of development. In 163A we learned how to evaluate water resource supply and demand. To manage water resources effectively, we also need to understand anthropogenic drivers of change and water policy. This class builds on topics covered in 163A and is a project-based course (independent AND group) that focuses on water tradeoffs and opportunities for management. The class prioritizes science communication skills.", "recommended_prep": "", "professor": "PERRONE", "college": "L&S"},
"ENV S 165A": {"number": "165A", "sub_dept": "ENV S", "title": "Environmental Impact Analysis", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "Analyzes the historical and theoretical approaches to environmental assessment methodology and procedures for preparing and reviewing environmental impact reports. Explores strengths and weaknesses of current public policy context.", "recommended_prep": "", "professor": "STONE", "college": "L&S"},
"ENV S 165B": {"number": "165B", "sub_dept": "ENV S", "title": "Advanced Environmental Impact Analysis", "dept": "ENV S", "prereqs": [["ENV S 165A"]], "prereq_description": "Environmental Studies 165A; consent of department.", "comments": "Other course work and/or experience may be substituted for Environmental Studies 165A, with the consent of the instructor(s).", "units": "4", "description": "Advanced seminar during which students prepare their own focused environmental impact report on a specific development project. Includes in-depth discussion of baseline, mitigation, impacts, and public comments. Assignments based on research and fieldwork provide reality professional environmental planning experience.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 166DC": {"number": "166DC", "sub_dept": "ENV S", "title": "Diet and Global Climate Change", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "Course investigates the potential of diet change to mitigate     anthropogenic global climate change via production, processing and   transport of food, and by improved nutrition and health. The potential for eaters to change diets and policy makers to promote diet change will also be examined.", "recommended_prep": "", "professor": "CLEVELAND", "college": "L&S"},
"ENV S 167": {"number": "167", "sub_dept": "ENV S", "title": "Biogeography: The Study of Plant and Animal Distributions", "dept": "ENV S", "prereqs": [["GEOG 3", "GEOG 4", "ENV S 2", "EEMB 2", "EARTH 2"]], "prereq_description": "Geography 3 or 4 or Environmental Studies 2 or EEMB 2 or Earth Science 2.", "comments": "Same course as Geography 167.", "units": "4", "description": "Basic processes governing geographic distribution patterns of biota, including migration, evolution, isolation, and endemism. Biogeographic regions and their histories and an introduction to island biogeography. Emphasis on plants and plant geography. One all-day field trip.", "recommended_prep": "A prior course in EEMB.", "professor": "STAFF", "college": "L&S"},
"ENV S 168": {"number": "168", "sub_dept": "ENV S", "title": "Aqueous Transport of Pollutants", "dept": "ENV S", "prereqs": [["MATH 3B"], ["MATH 1A"], ["MATH 1B"], ["MATH 1C"]], "prereq_description": "Mathematics 3B and Chemistry 1A-B-C.", "comments": "Same course as Earth 168.", "units": "4", "description": "Focus on the behavior of dissolved species in rivers. Examination of the basic advection-diffusion model. Particular emphasis on field data.", "recommended_prep": "Earth 113 or Earth 173 or Geography 116 or Geography 144 or Environmental Studies 144.", "professor": "CLARK", "college": "L&S"},
"ENV S 169": {"number": "169", "sub_dept": "ENV S", "title": "Tracer and Contaminant Hydrology", "dept": "ENV S", "prereqs": [["MATH 3B"], ["MATH 1A"], ["MATH 1B"], ["MATH 1C"]], "prereq_description": "Mathematics 3B and Chemistry 1A-B-C.", "comments": "Same course as Earth 169.", "units": "4", "description": "Introduction to principles of chemical and isotope tracer hydrology. Emphasis on methods of groundwater dating, the use of tracers as management tools, and contaminate plume monitoring.", "recommended_prep": "Earth 113 or Earth 173 or Geography 116 or Geography 144 or Environmental Studies 144.", "professor": "CLARK", "college": "L&S"},
"ENV S 171": {"number": "171", "sub_dept": "ENV S", "title": "Ecosystem Processes", "dept": "ENV S", "prereqs": [["MCDB 1A"], ["MCDB 1B"], ["EEMB 2"], ["EEMB 3", "EEMB 1"], ["EEMB 2"], ["EEMB 3"], ["EEMB 60", "EEMB 100"], ["CHEM 1A"], ["CHEM 1AL"], ["CHEM 1B"], ["CHEM 1C", "CHEM 15A"], ["CHEM 15B"], ["CHEM 15BL"]], "prereq_description": "MCDB 1A, MCDB 1B, EEMB 2, and EEMB 3; or ENVS 1, 2, 3 and 60 or 100, and either Chem 1A, 1AL, 1B, and 1C or ENVS 15A, 15B, and 15BL. Completion of all listed prerequisites with a grade of C- or better.", "comments": "Same course as EEMB 171.", "units": "4", "description": "An examination of the key processes that regulate ecosystem productivity and function in terrestrial ecosystems. Specific foci include: plant- soil linkages including decomposition and nutrient supply, and the role of above- and below-ground community composition on element cycles.", "recommended_prep": "EEMB 120.", "professor": "SCHIMEL", "college": "L&S"},
"ENV S 172": {"number": "172", "sub_dept": "ENV S", "title": "Waste Management: Product Stewardship, Recycling and Renewable Energy", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 2", "ENV S 3"]], "prereq_description": "Environmental Studies 1 or 2 or 3.", "comments": "", "units": "4", "description": "Overview of policy, technology, and economic dimensions of managing  wastes in the twenty-first century.  Covers the emergence of product   stewardship, domestic and international recycling, composting of organic materials, conversion of organic materials to renewable energy, waste  incineration and land filling.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 173": {"number": "173", "sub_dept": "ENV S", "title": "American Environmental History", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "Same course as History 173T.", "units": "4", "description": "Traces the history of American attitudes and behavior toward nature. Focus on wilderness, the conservation movement, and modern forms of      environmentalism.", "recommended_prep": "", "professor": "", "college": "L&S"},
"ENV S 174": {"number": "174", "sub_dept": "ENV S", "title": "Environmental Policy And Economics", "dept": "ENV S", "prereqs": [["ENV S 30", "ECON 1", "ECON 2", "ECON 9"]], "prereq_description": "Environmental Studies 30 or Economics 1 or 2 or 9.", "comments": "", "units": "4", "description": "Introductory course on economic analysis of environmental policy. Topics include market failure, the evaluation of environmental policy, energy sources, population growth, sustainable development, the optimal levels of biodiversity and pollution, and dispute resolution.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 175": {"number": "175", "sub_dept": "ENV S", "title": "Environmental Economics", "dept": "ENV S", "prereqs": [["ECON 10A"]], "prereq_description": "Economics 10A.", "comments": "Same course as Economics 115.", "units": "4", "description": "Provides a rigorous treatment of environmental economics. topics include welfare analysis, ethical dimensions of economic criteria for protecting the environment, measuring the demand for environmental goods, property rights, economic incentives, including marketable permits and emission fees, and regulating risk.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 176": {"number": "176", "sub_dept": "ENV S", "title": "Energy Politics and Policy", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 3", "POL S 6", "POL S 12"]], "prereq_description": "Environmental Studies 1 or 3 or Political Science 6 or 12.", "comments": "Same course as Political Science 176.</div><div><strong>Repeat Comments:</strong> Students who have taken POLS 106EP or POLS 106PE, and who earned a repeatable grade (a C- or lower), MAY retake the course with its new number.", "units": "4", "description": "Introduces students to the politics and policy of the contemporary global energy system. Covers major public policies and politics related to both the electricity and transportation systems. Students learn energy technologies? characteristics and understand contemporary political debates over the energy system.", "recommended_prep": "", "professor": "STOKES", "college": "L&S"},
"ENV S 176A": {"number": "176A", "sub_dept": "ENV S", "title": "Water Policy in the West: Linking Science with Environmental and Economic  Values", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "", "units": "4", "description": "Examines water supply and use, the science of water systems and    watersheds, key concepts in water policy, and the basics of water law as a fundamental element of the history and context for water policy in the West.", "recommended_prep": "", "professor": "", "college": "L&S"},
"ENV S 176B": {"number": "176B", "sub_dept": "ENV S", "title": "Advanced Study of Water Policy", "dept": "ENV S", "prereqs": [["ENV S 176A"]], "prereq_description": "Environmental Studies 176A.", "comments": "", "units": "4", "description": "Students are in the field full-time for approximately two weeks to study watersheds and water systems including Yosemite/Hetch Hetchy, Mono Lake, and the state and federal water systems in California.", "recommended_prep": "", "professor": "", "college": "L&S"},
"ENV S 177": {"number": "177", "sub_dept": "ENV S", "title": "Comparative Environmental Politics", "dept": "ENV S", "prereqs": [["ENV S 1", "POL S 6"]], "prereq_description": "Environmental Studies 1 or Political Science 6", "comments": "Same course as Political Science 177.", "units": "4", "description": "Course is structured around the major issues in environmental politics,  for example: global warming, nuclear waste, deforestation, and chemical  pollution. The roles of economics, technology and social organization are  each considered as explanatory variables for understanding environmental problems.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 178": {"number": "178", "sub_dept": "ENV S", "title": "Politics of the Environment", "dept": "ENV S", "prereqs": [["POL S 12", "ENV S 3"]], "prereq_description": "Political Science 12 or Environmental Studies 3; upper-division standing.", "comments": "Same course as Political Science 175.", "units": "4", "description": "Analysis of environmental policy issues and their treatment in the   political process. Discussion of the interplay of substantive issues,  ideology, institutions, and private groups in the development, management, protection, and preservation of natural resources and the natural    environment.", "recommended_prep": "", "professor": "SMITH", "college": "L&S"},
"ENV S 179": {"number": "179", "sub_dept": "ENV S", "title": "Natural Resource Economics", "dept": "ENV S", "prereqs": [["ECON 10A"]], "prereq_description": "Economics 10A.", "comments": "Same course as Economics 122.", "units": "4", "description": "Theory and capital theory applied to problems of conservation and management of natural resources. Analysis of public policy with special emphasis on nonrenewable resources, management of forests, deforestation and species extinction, and use of fish and game resources.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 180": {"number": "180", "sub_dept": "ENV S", "title": "Global Environmental Movements", "dept": "ENV S", "prereqs": [], "prereq_description": "Not open to freshman.", "comments": "", "units": "4", "description": "Examines historical and contemporary environmental and human rights movements around the world. Subject matter includes: policy-  driven/reformist environmental movements, radical underground and militant  movements, indigenous peoples? movements, environmental movements in the Global South, and coalitions and transnational advocacy networks focused on confronting climate change and resource extraction associated with industrial agriculture, mining, timber harvesting, hydroelectric dam construction, fracking, oil and tarsands, and the international hazardous waste trade. Students learn theories and concepts from the social sciences and environmental humanities.", "recommended_prep": "Environmental Studies 1 or 2 or 3.", "professor": "PELLOW", "college": "L&S"},
"ENV S 181": {"number": "181", "sub_dept": "ENV S", "title": "Power, Justice, and the Environment", "dept": "ENV S", "prereqs": [], "prereq_description": "Not open to Freshmen.", "comments": "Not open for credit to students who have completed Environmental Studies 193PJ</div><div><strong>Repeat Comments:</strong> Not open for credit to students who have completed Environmental Studies 193PJ.", "units": "4", "description": "Introduces students to the theoretical and historical foundations of research on environmental racism and environmental inequality. Examines social scientific evidence concerning these phenomena and the efforts by community residents, activists, workers, and governments to combat it. Considers the social forces that create environmental inequalities so that we may understand their causes, consequences, and the possibilities for achieving environmental justice. Students will master social scientific theories and concepts related to the subject matter.", "recommended_prep": "Environmental Studies 1 or 2 or 3.", "professor": "PELLOW", "college": "L&S"},
"ENV S 182": {"number": "182", "sub_dept": "ENV S", "title": "Seminar in Community and Personal Resilience", "dept": "ENV S", "prereqs": [], "prereq_description": "Not Open to Freshmen.", "comments": "", "units": "4", "description": "A meaningful introduction to community and personal resilience through collective problem-solving and transformative action. Topics include ecological crisis, social equity, intersectionality, and regenerative economy, bringing new perspectives, struggles, and voices into dialogue with environmental problems and visions for the future. Particular attention is paid to the inherent knowledge, wisdom, and experience of each student participant, with the goal of deepening personal resilience, environmental action, and community engagement.", "recommended_prep": "", "professor": "GRAY", "college": "L&S"},
"ENV S 183": {"number": "183", "sub_dept": "ENV S", "title": "Film, Representation, and the Environment", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "Introduces students to a series of films representing a range of environmental issues, ideas, and interventions. Topics include energy, water, agriculture, biodiversity, and climate change as well as the ecological impacts of media production and consumption. Special attention is paid to the ways in which film and media affect our imaginations of the world around us and impact our thoughts and actions toward human and non-human environments. Students work collaboratively on creative film projects.", "recommended_prep": "", "professor": "GRAY", "college": "L&S"},
"ENV S 184": {"number": "184", "sub_dept": "ENV S", "title": "Gender and the Environment", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "", "units": "4", "description": "A philosophical, evolutionary, and cross-cultural analysis of the ways   women and men may relate differently to their environment resulting in   the design of gender-sensitive and sustainable policies for planning and development in both the developing and the developed world.", "recommended_prep": "", "professor": "", "college": "L&S"},
"ENV S 185": {"number": "185", "sub_dept": "ENV S", "title": "Human Environmental Rights", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 3", "ANTH 2"]], "prereq_description": "Environmental Studies 1 or 3 or Anthropology 2.", "comments": "", "units": "4", "description": "Introduction to human environmental rights. Examines the expansion of human rights to include human environmental rights, abuses of human environmental rights, associated social conflicts, and emergent social movements including environmental justice and transnational advocacy networks.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 186": {"number": "186", "sub_dept": "ENV S", "title": "Development, Displacement, and Environmental Justice", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing required.", "comments": "", "units": "4", "description": "A look at policies and actions by international development agencies and governments, reviewing critiques of their systemic weaknesses, failures, and impacts on local communities and environments. Focuses on case studies of forced displacement, as well as examples from around the world where communities, activists, citizens, and scholars are advocating for alternative policies and actions to promote human rights and social and environmental justice.", "recommended_prep": "Environmental Studies 1 or 2 or 3.", "professor": "STAFF", "college": "L&S"},
"ENV S 187": {"number": "187", "sub_dept": "ENV S", "title": "Green Building Design &amp; Operations", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing required.", "comments": "", "units": "4", "description": "Introduction to Green Building best practices and foundational principles in sustainable design and operations. Students learn about LEED and the U. S. Green Building Council as well as other institutions currently leading the effort in sustainable development. This course utilizes technical audits, business writing, and critical thinking to develop a broad understanding of how sustainability is implemented in the built environment while preparing students for their LEED Green Associate credential.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 188": {"number": "188", "sub_dept": "ENV S", "title": "Ethics in the Anthropocene", "dept": "ENV S", "prereqs": [["ENV S 1", "ENV S 3"], ["ENV S 70"], ["BL ST 4"], ["FEMST 50"], ["LING 50"], ["PHIL 4"], ["POL S 1"]], "prereq_description": "Environmental Studies 1 or 3; and one course from the following:  Environmental Studies 70, Black Studies 4, Feminist Studies 50, Linguistics 50, Philosophy 4, Political Science 1.", "comments": "", "units": "4", "description": "Survey of emerging global environmental-ethical issues in the Anthropocene and technological responses to them. Major topics include: climate change and geoengineering, extinction and de-extinction, assisted evolution, biopolitics, wilderness preservation, and social and environmental justice.", "recommended_prep": "", "professor": "SIDERIS", "college": "L&S"},
"ENV S 189": {"number": "189", "sub_dept": "ENV S", "title": "Religion And Ecology In The Americas", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing or instructor approval.", "comments": "Same course as Religious Studies 193.", "units": "4", "description": "An overview of the growing field of religion and ecology in the Americas. Focus on spiritual traditions and landbased knowledge indigenous to the Western hemisphere.", "recommended_prep": "", "professor": "TALAMANTEZ", "college": "L&S"},
"ENV S 190": {"number": "190", "sub_dept": "ENV S", "title": "Colloquium On Current Topics In Environmental Studies", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "This is a one unit, pass/no pass only course open to all majors and  all levels. Students majoring in Environmental Studies are required to take the class at least once for graduation. May be repeated for credit  to a maximum of 3 units.", "units": "1", "description": "A series of weekly lectures by distinguished guest speakers designed   to offer insight into current research and issues in the diverse   intellectual fields that constitute environmental studies. Colloquium  themes vary quarter to quarter. Regular attendance and a brief written evaluation of each lecture is required.", "recommended_prep": "Introductory course in environmental studies or related discipline.", "professor": "STAFF", "college": "L&S"},
"ENV S 191": {"number": "191", "sub_dept": "ENV S", "title": "Nature and Science Education Practicum", "dept": "ENV S", "prereqs": [["MCDB 20", "EEMB 22", "MCDB 1A"], ["MCDB 1B"], ["EEMB 2"], ["EEMB 3"]], "prereq_description": "ENVS 2 and MCDB 20 or EEMB 22; or MCDB 1A and MCDB 1B and EEMB 2 and EEMB 3;", "comments": "Students in related majors should consult with the instructor about the possibility of using other course work toward meeting prerequisites.", "units": "4", "description": "Offered in conjunction with CCBER's Kids in Nature environmental education program, students gain hands-on experience teaching ecology and environmental science while receiving instruction from professionals on topics ranging from science education, teaching strategies, lesson plan development, and public speaking.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 192": {"number": "192", "sub_dept": "ENV S", "title": "Internships In Environmental Studies", "dept": "ENV S", "prereqs": [], "prereq_description": "Minimum sophomore standing, 2.75 overall G.P.A., and be declared an", "comments": "Quarters usually offered: Winter, Spring, Summer, Fall. This is a variable unit Pass/No Pass only course that may be repeated multiple quarters for a maximum of 12 total units. Only 4 units total may apply toward major requirements.", "units": "1-12", "description": "Opportunities to learn about practical approaches to environmental   problem solving by working under faculty direction as interns with   local, state, and federal agencies, non-governmental organizations, or private business concerned with the environment. Periodic and final  reports will be part of the internship.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 193AAZZ": {"number": "193AAZZ", "sub_dept": "ENV S", "title": "", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing.", "comments": "May be repeated for credit to a maximum of 20 units provided letter designations are different.", "units": "1-5", "description": "One-time course taught by lecturers or guest professors on a special area of interest in environmental studies. Specific course titles and topics to be announced by the Environmental Studies program each quarter.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 194AAZZ": {"number": "194AAZZ", "sub_dept": "ENV S", "title": "Group Study", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division status and consent of instructor.", "comments": "May be repeated for credit to a maximum of 15 units, but only 4 units may be applied toward the major.", "units": "1-5", "description": "Directed group reading, study, and research on specific subject for Environmental Studies majors. Admission by specific arrangement with the Environmental Studies chair.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 195A": {"number": "195A", "sub_dept": "ENV S", "title": "Environmental Leadership Incubator", "dept": "ENV S", "prereqs": [], "prereq_description": "Not open to Freshman.", "comments": "Open to non-majors. Quarters usually offered: Fall. Only open to students who will be returning to UCSB for one full year after taking the course. Students must complete application and secure instructor approval prior to registering.", "units": "4", "description": "Course combines the theory and practice of leadership, cultivating leadership skills in environmentally-oriented undergraduates and functions as an incubator for student-initiated individual or group projects focused on positive environmental change. Projects may address campus, community or regional environmental challenges through social activism, technology development, education, policy change, and other means. Requires multiple quarter commitment.", "recommended_prep": "", "professor": "PULVER", "college": "L&S"},
"ENV S 195B": {"number": "195B", "sub_dept": "ENV S", "title": "Environmental Leadership Incubator Project", "dept": "ENV S", "prereqs": [["ENV S 195A"]], "prereq_description": "Environmental Studies 195A", "comments": "Quarters usually offered: Winter. Continuation of the yearlong Environmental Leadership Incubator series.  Only open to students enrolled in ENVS 195A the previous quarter.", "units": "1", "description": "Continuation of Environmental Leadership Incubator series.  Students work independently on their environmental leadership projects with the support of an external mentor. Students meet regularly with their mentors and the ELI Program Manager.", "recommended_prep": "", "professor": "PULVER", "college": "L&S"},
"ENV S 195C": {"number": "195C", "sub_dept": "ENV S", "title": "Environmental Leadership Incubator Project", "dept": "ENV S", "prereqs": [["ENV S 195B"]], "prereq_description": "Environmental Studies 195B", "comments": "Quarters usually offered: Spring.", "units": "1", "description": "Continuation of Environmental Leadership Incubator series. Students complete their environmental leadership projects, meeting regularly with their mentors and the ELI Program Manager. Course concludes with ELI Capstone Presentations.", "recommended_prep": "Continuation of the yearlong Environmental Leadership Incubator series.  Only open to students enrolled in ENVS 195B the previous quarter.", "professor": "PULVER", "college": "L&S"},
"ENV S 196": {"number": "196", "sub_dept": "ENV S", "title": "Introduction to Teaching in Environmental Studies", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing; consent of instructor and department.", "comments": "May be repeated for credit to a maximum of 8 units but only 4 units can  be applied towards the major.", "units": "2-4", "description": "Students assist instructor in teaching course in which the student   previously received a grade of A- or better. Activities determined in  consultation with the instructor and may include assisting in      laboratories, tutorials, discussion sections and field trips.", "recommended_prep": "", "professor": "", "college": "L&S"},
"ENV S 197": {"number": "197", "sub_dept": "ENV S", "title": "Senior Thesis", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing; consent of instructor.", "comments": "Course normally taken fall quarter of the senior year and is required for  students completing the environmental studies senior honors program.", "units": "6", "description": "Under the guidence of the instructor, students select a topic and advisor  in an environmental field of their choice and develop, write and present a thesis.", "recommended_prep": "Student should have an overall grade-point average of 3.0 or higher.", "professor": "GRAVES", "college": "L&S"},
"ENV S 199": {"number": "199", "sub_dept": "ENV S", "title": "Independent Investigation in Environmental Studies", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing; completion of two upper-division courses in", "comments": "Students must have a minimum 3.0 GPA for the preceding 3 quarters and  are limited to 5 units per quarter and 30 units total in all     98/99/198/199/199AA-ZZ courses combined. Only four units count for   credit in the major. May be repeated to a maximum of 30 units.", "units": "1-5", "description": "Independent research under the guidance of a faculty member in the   department. Course offers qualified students the opportunity to undertake  research or work in a topic related to the characteristics and problems  in the environment.", "recommended_prep": "", "professor": "", "college": "L&S"},
"ENV S 199RA": {"number": "199RA", "sub_dept": "ENV S", "title": "Independent Research Assistance in Environmental Studies", "dept": "ENV S", "prereqs": [], "prereq_description": "Upper-division standing; completion of two upper-division courses in", "comments": "Students must have a minimum 3.0 GPA for the preceding 3 quarters and  are limited to 5 units per quarter and 30 units total in all     98/99/198/199/199AA-ZZ courses combined. No more than 4 units may be   counted toward the major.", "units": "1-5", "description": "Faculty supervised research assistance.", "recommended_prep": "", "professor": "", "college": "L&S"},
"ENV S 200": {"number": "200", "sub_dept": "ENV S", "title": "Core Seminar in Environment and Society", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "Quarters usually offered: Fall. Required for students pursuing the   Interdepartmental PhD Emphasis in Environment and Society. May be taken  for a maximum of 12 units but no more than 4 units may apply towards the PhD Emphasis requirements.", "units": "4", "description": "Seminar provides students with a broad introduction to key environmental theories, concepts, problems, and methods from the humanities, social  sciences, and natural sciences. Students learn to appreciate the   diversity of approaches to understanding current environmental issues, and develop a basic vocabulary to discuss these issues with colleagues from other disciplines. Course is required for students pursuing the   Interdepartmental PhD Emphasis in Environment and Society and is open to others with the permission of the instructor.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 257": {"number": "257", "sub_dept": "ENV S", "title": "Advanced Santa Barbara County Agrifood System", "dept": "ENV S", "prereqs": [], "prereq_description": "Graduate level and instructor approval required.", "comments": "Concurrently offered with ENV S 157.", "units": "4", "description": "Investigates current agricultural system and potential benefits and costs  of localization. Covers theory, data collection, analysis methods, key   indicators (greenhouse gas emissions, biodiversity, migrant labor,   nutrition, community health), policies and actions for change. Students  conduct and present research at advanced level.", "recommended_prep": "Environmental Studies 149 or Anthropology 149 or Geography 161.", "professor": "CLEVELAND", "college": "L&S"},
"ENV S 293AAZZ": {"number": "293AAZZ", "sub_dept": "ENV S", "title": "Advanced Special Topics in Environmental Studies", "dept": "ENV S", "prereqs": [], "prereq_description": "Graduate standing and consent of the instructor.", "comments": "", "units": "1-4", "description": "Graduate seminar focusing on special topics of current importance in   Environmental Studies. Course content will vary.  Information on course  may be obtained from the Environmental Studies office.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 500": {"number": "500", "sub_dept": "ENV S", "title": "Teaching Assistant Training", "dept": "ENV S", "prereqs": [], "prereq_description": "", "comments": "May be repeated for credit.", "units": "1", "description": "Examines effective teaching methods and professional conduct and     responsibilities. Emphasis on teaching aids, examination preparation, and  grading. Includes general orientation regarding the University of    California and UCSB campus; various pertinent regulations; and services  available to teaching assistants and to students.", "recommended_prep": "", "professor": "STAFF", "college": "L&S"},
"ENV S 501": {"number": "501", "sub_dept": "ENV S", "title": "Teaching Assistant Practicum", "dept": "ENV S", "prereqs": [], "prereq_description": "Concurrent appointment as a teaching assistant in environmental studies.", "comments": "May be repeated for credit.", "units": "4", "description": "Students gain practical experience in teaching while coordinating one or more discussion/lab sections. Responsibilities include analyses of course  texts/materials, discussion/lab sections, and formulation of topics/   questions for papers and examinations. Evaluations are completed by    members of the class sections.", "recommended_prep": "", "professor": "", "college": "L&S"},
"ENV S 596": {"number": "596", "sub_dept": "ENV S", "title": "Directed Reading and Research", "dept": "ENV S", "prereqs": [], "prereq_description": "Enrolled graduate student at UCSB; consent of instructor and department.", "comments": "May be repeated for credit.", "units": "2-8", "description": "Individual tutorial. Hours and credit by arrangement with an individual  faculty member in environmental studies. Written proposal for each   tutorial must be approved by the instructor and the department chair.", "recommended_prep": "", "professor": "", "college": "L&S"}
}